[
    "College of Biological Sciences - Jacqueline Barlow Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Jacqueline Barlow Breadcrumb Home Faculty Jacqueline Barlow Position Title Associate Professor Microbiology and Molecular Genetics 530-752-9529 jhbarlow@ucdavis.edu Lab website 313 Briggs Hall Bio Research Interests Accurate cell division requires complete duplication of nuclear DNA, providing the daughter cell with a precise copy of the encoded genomic information. For faithful replication, the replication phases of initiation, elongation and termination must be coordinated to copy the nuclear DNA once and only once per cell cycle. Faithful replication must also retain higher order epigenetic components of chromatin that confer transcriptional regulation, three-dimensional organization, and cell identity. DNA damage can arise as a consequence of replicative stress, a phenomenon that encompasses a wide array of conditions leading to replication fork stalling or collapse. Defects in replication can lead to DNA damage and inappropriate repair can result in heritable mutations—including point mutations, deletion or duplication events, or chromosomal translocations—all of which are hallmarks of cancer. DNA replication begins with the coordinated association of over 100 proteins onto DNA at starting points -- called origins -- at tens of thousands of distinct genomic sites in mammals. Replication fork collapse results in a double-strand break (DSB) in the DNA, which requires proteins involved in homologous recombination (HR) for repair of the lesion and subsequent fork restart. By examining HR protein recruitment using chromatin immunoprecipitation followed by high-throughput sequencing (ChIP-Seq), we identified genomic loci that associated with multiple DNA replication and repair factors in response to the replication poison hydroxyurea (HU), and termed these regions early replicating fragile sites or ERFS. The Barlow lab uses a combination of molecular biology, microscopy and genome-wide sequencing techniques to investigate the molecular and genetic factors that predispose replicating cells DNA damage and genome instability using the mouse immune system as our model. Activated B lymphocytes can have a doubling time as short as 8 hours, suggesting that these rapidly proliferating cells are particularly vulnerable to replicative stress, and may contribute to lymphomagenesis. Center Affiliations Genome Center Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Education and Degree(s) 2000 B.A. in Biology, Rice University 2008 Ph.D. in Genetics and Development, Columbia University Publications Waisertreiger I, Popovich K, Block M, Anderson KR, and Barlow JH. Visualizing locus-specific sister chromatid exchange reveals differential patterns of replication stress-induced fragile site breakage. Oncogene. 39(6):1260-1272. 2020. Lopes-Contreras, A.J., Specks, J., Barlow, J.H., Ambrogio, C., Desler, C., Vikinsson, S., Rodrigo-Perez, S., Green, H., Rasmussen, L.J., Murga, M., Nussenzweig, A., and Fernandez-Capetillo, O. Increased Rrm2 dosage reduces fragile site breakage and prolongs survival of ATR mutant mice. Genes Dev.  29(7):690-5. 2015. Barlow, J. H. and Nussenzweig, A. replication initiation and genome instability: a crossroads for DNA and RNA synthesis. Cell Mol Life Sci. 71(23): 4545-59. 2014. Barlow, J.H.*, Faryabi, R. B.*, Callen, E., Wong, N., Malhowski, A., Chen, H.T., Gutierrez-Cruz, G., Sun, H., McKinnon, P., Wright, G., Casellas, R., Robbiani, D.F., Staudt, L., Fernandez-Capetillo, O., and Nussenzweig, A. A novel class of early replicating fragile sites that contribute to genome instability in B cell lymphomas. Cell.152: 620-632, 2013. Bothmer, A., Robbiani, D.F., Di Virgilio, M., Bunting, S.F., Klein, I.A., Feldhahn, N.A., Barlow, J.H., Chen, H., Bosque, D., Callen, E., Nussenzweig, A., and Nussenzweig, M.C. Regulation of DNA End Joining, Resection, and Immunoglobulin Class Switch Recombination by 53BP1. Molecular Cell. 42(3):319-329, 2011. Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Jacqueline Barlow Gateway to Cancer Research: Popular Undergraduate Course Inspires Future Scientists July 10, 2018 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Jonathan H. Bragg | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Jonathan H. Bragg Breadcrumb Home Faculty Jonathan H. Bragg Position Title Assistant Professor of Teaching Microbiology and Molecular Genetics he/him/they/them jhbragg@ucdavis.edu Google Scholar ORCID (0000-0002-3172-7451) 335 Briggs Hall Bio Research Interests As an educator in microbiology, I'm focused primarily on bringing the world of microbes into focus for students while building inclusive, equitable learning experiences in our courses. As a researcher, I also study microbial genetics and physiology, specifically including the application of Active Learning at large scale in microbiology courses; investigating the role of identity formation as a scientist in undergraduate education; and development of course-based undergraduate research experiences (CUREs). Each fall, I lead the BioLaunch seminar (BIS005) for new UC Davis students, which helps them explore the opportunities available to them and find their place on our large, diverse campus. Education and Degree(s) 2003 B.A. in Biochemistry, Lawrence University 2013 Ph.D. in Microbiology, UC Davis Publications Tags Department of Microbiology and Molecular Genetics Content by Jonathan H. Bragg CBS Welcomes New Faculty in the 2022-23 Year September 29, 2022 Jonathan H. Bragg (0000-0002-3172-7451) ORCID record for Jonathan H. Bragg. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 25, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Sean R. Collins Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Sean R. Collins Breadcrumb Home Faculty Sean R. Collins Position Title Associate Professor Microbiology and Molecular Genetics 530-752-7497 srcollins@ucdavis.edu Lab website Google Scholar ORCID (0000-0002-4276-5840) 334 Briggs Hall Bio Research Interests Our lab is interested in how individual cells process information, make decisions, and enact appropriate responses. This often requires using molecular components to achieve properties such as adaptation, sensitivity, and spatial processing of signals. As a favorite model system, we study how human neutrophils process dynamic extracellular chemical cues to guide their behavior. In order to chase a pathogen or migrate to a site of infection, a neutrophil must overcome challenges of breaking symmetry, generating stable cell polarity, and responding to spatial gradients of signaling molecules. The neutrophil response needs to be highly sensitive and decisive so that it can generate polarity, reorganize its cytoskeleton, and move, even if the input signal is weak or provides little spatial information. Additionally, in order to orient itself towards the highest concentration of the chemical attractant, the cell needs to compare input levels across space. We still know very little about how cells balance these goals or about the mechanisms that enable spatial processing. Finally, these cells are capable of responding to multiple attractant signals and prioritizing some over others. To tackle these questions, we use a combination of techniques with particular emphasis on systematic quantitative analysis of genetic perturbations, direct monitoring of signaling using live-cell imaging of fluorescent biosensors, optogenetic approaches to control protein activities with light, and mathematical modeling. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Immunology Graduate Group Integrative Genetics and Genomics Graduate Group Microbiology Graduate Group Education and Degree(s) 2000 B.S. in Mathematics, Stanford University 2006 Ph.D. in Biochemistry and Molecular Biology, University of California, San Francisco Publications Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Sean R. Collins Understanding Neutrophil Decision-Making: How Immune Cells Prioritize Competing Signals November 09, 2023 Two UC Davis Juniors Receive Goldwater Scholarships May 13, 2021 Taking a Bite Out of Research: BMCDB Ph.D. Student Natalie Sahabandu Reflects on Her Journey as an Aggie January 27, 2020 Gateway to Cancer Research: Popular Undergraduate Course Inspires Future Scientists July 10, 2018 “Smart” Immune Cells: Emerging Cancer Therapy Research at UC Davis Receives a Boost with NIH Award October 05, 2017 Pagination Page 1 Next page Next Sean R. Collins (0000-0002-4276-5840) ORCID record for Sean R. Collins. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Scott C. Dawson Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Scott C. Dawson Breadcrumb Home Faculty Scott C. Dawson Position Title Professor Microbiology and Molecular Genetics 530-752-3633 scdawson@ucdavis.edu Lab website Google Scholar ORCID (0000-0002-0843-1759) 237 Briggs Hall Bio Research Interests Our lab studies cytoskeletal organelle function, and evolution in the widespread protistan parasite Giardia lamblia. We are also interested in how cytoskeletal variation, function, and evolution is achieved in diverse amoeboid protists.  With respect to parasitology, we also are interested in the metabolic interactions that occur between Giardia and the host gut microbiome. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Education and Degree(s) 1989 B.S. in Biology, University of Michigan 2000 Ph.D. in Molecular and Cell Biology, University of California, Berkeley Publications Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Scott C. Dawson College of Biological Sciences Students, Faculty Honored with Chancellor’s Awards for Excellence June 19, 2018 Scott C. Dawson (0000-0002-0843-1759) ORCID record for Scott C. Dawson. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 25, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Sam L. Díaz-Muñoz Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Sam L. Díaz-Muñoz Breadcrumb Home Faculty Sam L. Díaz-Muñoz Position Title Assistant Professor Microbiology and Molecular Genetics they/them samdiazmunoz@ucdavis.edu Lab website Google Scholar 255 Briggs Hall Bio Research Interests We study the social lives of viruses. Viruses frequently infect the same host, leading to conflicts of interest over host resources. Viruses can evolve strategies to contend with co-infecting viruses, ranging from exploiting other viruses to synergistically interacting to increase their reproduction. Our research focuses on the evolution, ecology, and molecular mechanisms of these virus-virus interactions using genomics, experimental evolution, and environmental microbiology. The lab currently works on genetic exchange in two segmented RNA viruses: Cystovirus phages that infect Pseudomonas bacteria and influenza A viruses. The genome of these viruses is divided into segments. Viruses can swap their segments while reproducing within a cell, a process called reassortment. Reassortment is an important factor in determining the capacity to infect new hosts, evade immune responses or vaccines, and adapt to new environments. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Publications Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Sam L. Díaz-Muñoz Study Confirms the Low Likelihood That SARS-Cov-2 on Hospital Surfaces is Infectious July 01, 2021 Dr. Kishana Taylor Awarded HHMI's Inclusive Excellence Teaching Fellowship June 10, 2020 Equipped to Fight in 2020: College of Biological Sciences Launches Capstone COVID-19 Virtual Lab Course April 02, 2020 College of Biological Sciences Virologists Talk Coronavirus March 09, 2020 The Infection Heist: How Social Viruses Team Up for the Perfect Score July 11, 2019 Pagination Page 1 Next page Next Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Wolf-Dietrich Heyer Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Wolf-Dietrich Heyer Breadcrumb Home Faculty Wolf-Dietrich Heyer Position Title Distinguished Professor and Chair Microbiology and Molecular Genetics 530-752-3001 wdheyer@ucdavis.edu Lab website Google Scholar 3163 Green Hall Bio Research Interests Double-stranded DNA breaks (DSBs) are among the most genotoxic lesions and can be generated by ionizing radiation, drugs, or cellular processes. In eukaryotes, several pathways compete for the repair of such lesions. Homologous recombination is the critical DSB repair pathway in yeasts and an important DSB repair pathway in all eukaryotes studied. We are using  Saccharomyces cerevisiae as a lead system and employ genetical, molecular, and biochemical methods to elucidate the molecular mechanism of homologous recombination and recombinational DNA repair and its regulation by the DNA damage checkpoints. The key results are validated with human proteins and in human cells to establish lasting paradigms. Recombination has dual significance for cancer. Recombination genes are guardians of the genome and classic tumor suppressors. Hence, defects in recombination genes increase cancer risk. DNA repair and specifically recombination is also critical in anti-cancer therapy, as many modalities of treatment involve DNA damaging agents. We are applying our mechanistic insights from basic studies in more translational studies relating to cancer predisposition and anti-cancer therapy. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Education and Degree(s) 1982 Diploma in Biology, Free University of Berlin (Germany) 1985 Ph.D. in Biology, University of Bern. Switzerland 1995 Habilitation in Microbiology and Molecular Genetics, University of Bern (Switzerland) Publications Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Wolf-Dietrich Heyer Experiments in Yeast Hint at Possible Origins of Cancer and Autism October 24, 2023 CBS Nets Multiple Year-End Mentorship and Research Awards June 07, 2022 Study Highlights Molecular Targets Integral to Breast Cancer Treatment November 16, 2021 Study Provides Insights into Molecular Interactions of Breast Cancer Protein July 29, 2020 Alumni Profile: Fascinating Fungi with Dr. Fun Guy February 13, 2020 Pagination Page 1 Next page Next Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Neil Hunter Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Neil Hunter Breadcrumb Home Faculty Neil Hunter Position Title Professor Microbiology and Molecular Genetics 530-754-4401 nhunter@ucdavis.edu Lab website Google Scholar 347C Briggs Hall Bio Research Interests The mechanism and regulation of chromosome repair by homologous recombination and its roles in chromosome transmission and genome stability. The nature and function of post-translational modifications of proteins involved in chromosome metabolism during meiosis. Understanding how oocyte quality is influenced by intrinsic and extrinsic factors, including aging, obesity and environmental contaminants. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Education and Degree(s) 1992 B.S. in Biochemistry and Applied Molecular Biology, University of Manchester, United Kingdom 1996 Ph.D. in Genetics, Wolfson College, Oxford University, Oxford, United Kingdom Publications Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Neil Hunter Aged Before Their Time: Atrazine and Diminished Egg Quality in Mice January 03, 2023 “Cellular Memory” of DNA Damage in Oocyte Quality Control September 27, 2018 College of Biological Sciences Students, Faculty Honored with Chancellor’s Awards for Excellence June 19, 2018 New Steps in the Meiosis Chromosome Dance February 06, 2017 Hunter Named American Academy of Microbiology Fellow March 14, 2016 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 25, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Chang-il Hwang | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Chang-il  Hwang Breadcrumb Home Faculty Chang-il  Hwang Position Title Assistant Professor Microbiology and Molecular Genetics cihwang@ucdavis.edu Lab website Google Scholar ORCID (0000-0002-5710-7672) 241B Briggs Hall Bio Research Interests The Hwang lab studies how genetic and epigenetic alterations contribute to pancreatic cancer progression, and exploits epigenetic vulnerabilities in cancer therapeutics. Dr. Hwang has established pancreatic organoid models of human and mouse pancreatic cancer and utilized these models for understanding epigenetic landscape of disease progression. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Education and Degree(s) D.V.M., Seoul National University, Seoul, South Korea M.S., Seoul National University, Seoul, South Korea Ph.D., Cornell University Publications Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Chang-il  Hwang New Findings Shed Light on Pancreatic Cancer Treatment Targets February 01, 2024 Two UC Davis Juniors Receive Goldwater Scholarships May 13, 2021 VIDEO: Building Mini-Organs to Fight Pancreatic Cancer September 10, 2019 Discovering Curiosity: Building Mini-Organs to Fight Pancreatic Cancer with New Faculty Chang-il Hwang March 21, 2019 College of Biological Sciences Welcomes Eight New Faculty for 2018-2019 Year October 17, 2018 Chang-il  Hwang (0000-0002-5710-7672) ORCID record for Chang-il  Hwang. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Michele M. Igo Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Michele M. Igo Breadcrumb Home Faculty Michele M. Igo Position Title Associate Dean of Undergraduate Academic Programs Professor Microbiology and Molecular Genetics 530-752-6778 (executive assistant) mmigo@ucdavis.edu Google Scholar 203 Green Hall Bio Research Interests My research focuses on developing tools and strategies to help instructors gain greater insight into how students engage with online content, with the ultimate goal of enhancing learning outcomes. By employing innovative methodologies, I aim to bridge the gap between student interaction with online materials and instructional effectiveness, thereby fostering a more interactive and effective learning environment. I utilize data-driven approaches to analyze student behavior and engagement patterns, enabling educators to tailor their teaching methods to better meet student needs. This work not only enhances the educational experience but also contributes to the development of more effective and inclusive online learning environments. Education and Degree(s) 1978 B.S. in Biology, Purdue University 1986 Ph.D. in Biology, Harvard University Publications Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Michele M. Igo Equipped to Fight in 2020: College of Biological Sciences Launches Capstone COVID-19 Virtual Lab Course April 02, 2020 Microbiologist Michele Igo Named Associate Dean of Undergraduate Academic Programs August 15, 2018 Luca Comai and Michele Igo Receive College of Biological Sciences Faculty Teaching Award August 17, 2017 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Stephen Kowalczykowski Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Stephen Kowalczykowski Breadcrumb Home Faculty Stephen Kowalczykowski Position Title Distinguished Professor Microbiology and Molecular Genetics 530-752-5938 sckowalczykowski@ucdavis.edu Lab website Google Scholar Briggs Hall 310 Bio Research Interests My research is centered on the mechanisms of DNA repair, recombination, and replication. I investigate the molecular processes that maintain genome stability, focusing on the proteins and enzymes involved in these critical cellular functions. I use a combination of biochemical, biophysical, and genetic approaches to elucidate how cells repair damaged DNA and ensure accurate replication. My research provides insights into the fundamental mechanisms of genetic maintenance and has important implications for understanding the causes of genetic diseases and developing new therapeutic strategies. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Biophysics Graduate Group Education and Degree(s) 1972 B.S. in Chemistry, Rensselaer Polytechnic Institute 1976 Ph.D. in Chemistry (Biochemistry), Georgetown University Publications Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Stephen Kowalczykowski Understanding Why BRCA2 Is Linked to Cancer Risk April 04, 2023 Single-protein Images Show How E. coli Repairs DNA While Replicating It September 22, 2022 Close-Up View of DNA Replication Yields Surprises June 15, 2017 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Su-Ju Lin Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Su-Ju Lin Breadcrumb Home Faculty Su-Ju Lin Position Title Professor Microbiology and Molecular Genetics she/her/hers 530-754-6081 slin@ucdavis.edu 342 Briggs Hall Bio Research Interests Research in my laboratory is currently focused on understanding the interaction between NAD+ homeostasis and calorie restriction (CR)-related nutrient sensing pathways, and their regulation in budding yeast Saccharomyces cerevisiae. The main goal of our research is to utilize the genetically tractable yeast S. cerevisiae to identify factors that regulate NAD+ homeostasis and longevity pathways. Understanding the mechanisms of these molecular processes in yeast may provide clues to the molecular basis of human aging and age-associated diseases. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Education and Degree(s) 1991 B.A. in Public Health, National Taiwan University 1997 Ph.D. in Toxicological Sciences, Johns Hopkins University 2003 Biology Postdoctoral Fellow, Massachusetts Institute of Technology Publications Groth B, Venkatakrishnan P, Lin SJ. NAD+ Metabolism, Metabolic Stress, and Infection. Front Mol Biosci. 2021;8:686412. Croft T, Venkatakrishnan P, James Theoga Raj C, Groth B, Cater T, Salemi MR, Phinney B, Lin SJ. N-terminal protein acetylation by NatB modulates the levels of Nmnats, the NAD+ biosynthetic enzymes in Saccharomyces cerevisiae. J Biol Chem. 2020 May 22;295(21):7362-7375. Croft T, Venkatakrishnan P, Lin SJ. NAD+ Metabolism and Regulation: Lessons From Yeast. Biomolecules. 2020 Feb 19;10(2). James Theoga Raj C, Lin SJ. Cross-talk in NAD+ metabolism: insights from Saccharomyces cerevisiae. Curr Genet. 2019 Oct;65(5):1113-1119. James Theoga Raj C, Croft T, Venkatakrishnan P, Groth B, Dhugga G, Cater T, Lin SJ. The copper-sensing transcription factor Mac1, the histone deacetylase Hst1, and nicotinic acid regulate de novo NAD+ biosynthesis in budding yeast. J Biol Chem. 2019 Apr 5;294(14):5562-5575. Croft T, James Theoga Raj C, Salemi M, Phinney BS, Lin SJ. A functional link between NAD+ homeostasis and N-terminal protein acetylation in Saccharomyces cerevisiae. J Biol Chem. 2018 Feb 23;293(8):2927-2938. Tags Academic Departments Department of Microbiology and Molecular Genetics Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Miriam Markum Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Miriam Markum Breadcrumb Home Faculty Miriam Markum Position Title Associate Professor of Teaching Microbiology and Molecular Genetics she|her|hers 530-754-0511 memarkum@ucdavis.edu ORCID (0000-0001-5356-8036) 246 Briggs Hall Bio Education and Degree(s) 1996 B.A. in Biology, University of Oregon 2003 Ph.D. in Microbiology, Indiana University, Bloomington Publications Miriam E. Martin and Arik Davidyan. (2021) Implementing an Undergraduate Learning Assistant Program Tailored for Remote Instruction. Journal of Microbiology and Biology Education, 22(1):ev22i1.2463. Skoog, Emma C., Miriam E. Martin, Roberto M. Barrozo, Lori M. Hansen, Lucy P. Cai, Seung-Joo Lee, Joseph M. Benoun, Stephen J. McSorley, and Jay V. Solnick. (2020) Maintenance of Type IV Secretion Function During Helicobacter pylori Infection in Mice. mBio, 11(6):e03147-20. Kable, Mary E., Lori M. Hansen, Cathy M. Styer, Samuel L. Deck, Olena Rakhimova, Anna Shevtsova, KathrynA. Eaton, Miriam E. Martin, Pär Gideonsson, Thomas Borén & JayV. Solnick. (2017) Host Determinants of Expression of the Helicobacter pylori BabA Adhesin. Scientific Reports, 7(1):e46499. Barrozo, Roberto M., Lori M. Hansen, Anna M. Lam, Emma C. Skoog, Miriam E. Martin, Lucy P. Cai, Yong Lin, Andreas Latoscha, Sebastian Suerbaum, Don R. Canfield, and Jay V. Solnick. (2016) CagY Is an Immune-Sensitive Regulator of the Helicobacter pylori Type IV Secretion System. Gastroenterology, 151(6):1164-1175. Martin, Miriam E., Srijak Bhatnagar, Michael D. George, Bruce J. Paster, Don R. Canfield, Jonathan A. Eisen, and Jay V. Solnick. (2013) Helicobacter spp. and the resident microbiota in the stomach of the rhesus macaque. PLoS ONE, 8(10):e76375. Tags Academic Departments Department of Microbiology and Molecular Genetics Miriam Markum ( 0000-0001-5356-8036) ORCID record for Miriam Markum. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Satoshi H. Namekawa | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Satoshi H. Namekawa Breadcrumb Home Faculty Satoshi H. Namekawa Position Title Professor Microbiology and Molecular Genetics 530-754-1876 snamekawa@ucdavis.edu Lab website ORCID (0000-0002-1052-943X) 312 Briggs Hall Bio Research Interests One of the greatest mysteries in biology concerns how life has perpetuated, and continues to perpetuate, from generation to generation. A key feature of the mammalian germline is sexual dimorphism: the dual developmental processes of spermatogenesis and oogenesis. These processes are inherently complex, which poses significant challenges to understanding the perpetuity of life and the development of treatments for germline-derived genetic and epigenetic diseases. Our research directions converge to address how epigenetic mechanisms govern spermatogenesis and oogenesis, culminating in the generation of functional sperm and eggs. Ultimately, we aim to clarify how fundamental germline mechanisms intersect to ensure genome maintenance, genome defense, and epigenetic gene regulation on a systemic level. Graduate Program Affiliations Biochemistry, Molecular, Cellular, and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Education and Degree(s) 2000 B.S. Tokyo University of Science, Japan 2002 M.S. Tokyo University of Science, Japan 2005 Ph.D. Tokyo University of Science, Japan Publications PRC1 suppresses a female gene regulatory network to ensure testicular differentiation. Maezawa S, Yukawa M, Hasegawa K, Sugiyama R, Iizuka M, Hu M, Sakashita A, Vidal M, Koseki H, Barski A, DeFalco T, Namekawa SH . Cell Death Dis. 2023 Aug 4;14(8):501. doi: 10.1038/s41419-023-05996-6. PMID: 37542070 Free PMC article.  2 Epigenetic programming in the ovarian reserve. Hu M, Schultz RM, Namekawa SH . Bioessays. 2023 Jul 7:e2300069. doi: 10.1002/bies.202300069. Online ahead of print. PMID: 37417392  3 Polycomb protein SCML2 mediates paternal epigenetic inheritance through sperm chromatin. Sakashita A, Ooga M, Otsuka K, Maezawa S, Takeuchi C, Wakayama S, Wakayama T, Namekawa SH . Nucleic Acids Res. 2023 Jul 21;51(13):6668-6683. doi: 10.1093/nar/gkad479. PMID: 37283086 Free PMC article.  4 ADAD2 interacts with RNF17 in P-bodies to repress the Ping-pong cycle in pachytene piRNA biogenesis. Xiong M, Yin L, Gui Y, Lv C, Ma X, Guo S, Wu Y, Feng S, Fan X, Zhou S, Wang L, Wen Y, Wang X, Xie Q, Namekawa SH , Yuan S. J Cell Biol. 2023 May 1;222(5):e202206067. doi: 10.1083/jcb.202206067. Epub 2023 Mar 17. PMID: 36930220  5 Active DNA damage response signaling initiates and maintains meiotic sex chromosome inactivation. Abe H, Yeh YH, Munakata Y, Ishiguro KI, Andreassen PR, Namekawa SH . Nat Commun. 2022 Nov 28;13(1):7212. doi: 10.1038/s41467-022-34295-5. PMID: 36443288 Free PMC article. Tags Department of Microbiology and Molecular Genetics Content by Satoshi H. Namekawa New Research Identifies Protein Integral to Sperm Development and Male Fertility February 22, 2024 Defects in DNA Packaging May Drive Age-Related Decline in Fertility February 06, 2024 Study Reveals How the Ovarian Reserve is Established August 09, 2022 Satoshi H. Namekawa (0000-0002-1052-943X) ORCID record for Satoshi H. Namekawa. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Kenjiro W. Quides | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Kenjiro W. Quides Breadcrumb Home Faculty Kenjiro W. Quides Position Title Assistant Professor of Teaching Microbiology and Molecular Genetics he/him/his kwquides@ucdavis.edu Google Scholar Briggs Hall room 337A Bio Research Interests I am interested in the use of active learning strategies to improve retention of students from diverse backgrounds. I use in-class strategies to promote active engagement in course material, as well as project-based learning to maximize opportunities for hands-on collaborative learning. Additionally, I enjoy the creative process of integrating research and teaching during the development of a Course-based Undergraduate Research Experience (CURE). Education and Degree(s) 2013 B.A. in Biology, Occidental College 2018 Ph.D. in Evolution, Ecology and Organismal Biology, University of California, Riverside 2022 Postdoctoral Fellow in Biology, Chapman University Publications Tags Department of Microbiology and Molecular Genetics Content by Kenjiro W. Quides CBS Welcomes New Faculty in the 2022-23 Year September 29, 2022 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 25, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Katherine Ralston Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Katherine Ralston Breadcrumb Home Faculty Katherine Ralston Position Title Associate Professor Microbiology and Molecular Genetics 530-752-5429 ksralston@ucdavis.edu Lab website 266 Briggs Hall Bio Research Interests We focus on interactions between the microbial eukaryote Entamoeba histolytica and the human host . E. histolytica causes amoebiasis, a potentially lethal diarrheal disease in the developing world. The species was named “histolytica” ( histo-: tissue; lytic-: dissolving) for its ability to injure host tissue. E. histolytica trophozoites (“amoebae”) possess potent cell-killing activity that is likely to drive tissue damage, but the mechanism by which amoebae kill cells was previously unclear. We discovered that amoebae kill human cells via an unusual mechanism, in which they bite off and ingest human cell fragments that contain human cell membrane, cytoplasm, and organelles. We named this “amoebic trogocytosis” ( trogo-: nibble). Trogocytosis provides a new paradigm for the pathogenesis of amoebiasis. As an unusual cell killing insult, it further provides a vehicle to uncover new host cell death and survival signaling. Unlike phagocytosis ( phago-: devour), in which one cell “swallows” another, trogocytosis is poorly understood. However, there is an emerging appreciation that many eukaryotes take bites of membrane from other cells, sometimes together with intracellular contents, suggesting that this process is likely to be fundamental. Trogocytosis plays a role in signaling between immune cells, and intracellular bacteria stimulate host cell trogocytosis to promote their transfer from one cell to another. Other eukaryotic microbes use trogocytosis for cell killing, including the “brain-eating” amoeba, Naegleria fowleri . Therefore, trogocytosis might represent a conserved strategy for eukaryotic intercellular exchange that is exaggerated and exploited for cell killing by microbial pathogens. Our work is therefore broadly relevant to conserved mechanisms for eukaryotic cell-cell interaction. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Graduate Group in Immunology Integrative Genetics and Genomics Graduate Group Integrative Pathobiology Microbiology Graduate Group Education and Degree(s) 2001 B.S. in Genetics, University of California, Davis 2009 Ph.D. in Microbiology, University of California, Los Angeles Publications Miller, HW, Tam, TSY, and Ralston, KS. (2022). Entamoeba histolytica develops resistance to complement deposition and lysis after acquisition of human complement regulatory proteins through trogocytosis. mBio. 13(2):e0316321. Suleiman, RL, and Ralston, KS. (2022). Growth and genetic manipulation of Entamoeba histolytica. Invited article. Current Protocols. 2(1):e327. Bettadapur, A, Hunter, SS*, Suleiman, RL*, Ruyechan, MC, Huang, W, Barbieri, CG, Miller, HW, Tam, TSY, Settles, ML, and Ralston, KS. (2021). Establishment of quantitative RNAi-based forward genetics in Entamoeba histolytica and identification of genes required for growth. PLOS Pathogens. 17(11):e1010088. *equal authorship Bettadapur, A, and Ralston, KS. (2020). Direct and high-throughput assays for human cell killing through trogocytosis by Entamoeba histolytica. Molecular and Biochemical Parasitology. 239:111301. Bettadapur, A*, Miller, HW*, and Ralston, KS. (2020). Biting off what can be chewed: Trogocytosis in health, infection and disease. Infection and Immunity. 88:e00930-19. Journal Cover. Part of the Collection: Early-Career Scientists Shaping the New Microbiology. Infection and Immunity. 88:e00129-20. *equal authorship Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Katherine Ralston Equipped to Fight in 2020: College of Biological Sciences Launches Capstone COVID-19 Virtual Lab Course April 02, 2020 Taking a Bite Out of Research: BMCDB Ph.D. Student Natalie Sahabandu Reflects on Her Journey as an Aggie January 27, 2020 Disease-Causing Nibbling Amoeba Hides by Displaying Proteins From Host Cells April 30, 2019 Assistant Professor Katherine Ralston Wins Innovation Award for Amoeba 'Cell Nibbling' April 17, 2019 Prestigious Pew Scholarship for Amoeba ‘Cell Nibbling’ June 09, 2016 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Priya S. Shah Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Priya S. Shah Breadcrumb Home Faculty Priya S. Shah Position Title Associate Professor Microbiology and Molecular Genetics Chemical Engineering she/her/hers 530-752-7843 prsshah@ucdavis.edu Lab website Google Scholar ORCID (0000-0001-7518-2839) 247 Briggs Hall Bio Research Interests The Shah Lab uses systems and synthetic biology to study virus-host interactions and understand how viruses turn cells into microscopic virus factories. Flavivirus-host interactions Mosquito-borne flaviviruses such as dengue virus and Zika virus are a source of emerging and re-emerging infectious diseases. We study how these viruses hijack host machinery through virus-host protein interactions to better understand their replication and develop therapeutics. We have two active areas of research on flavivirus-host interactions: Antiviral Gene Expression Program Cells respond to viral infections by activating the expression of antiviral genes such as interferon stimulated genes (ISGs), and viruses are continually evolving ways to evade this antiviral response. We study how flaviviruses including dengue and Zika virus hijack host gene expression machinery to inhibit the antiviral innate immune response. Zika virus associated microcephaly Viruses have long been known to cause birth defects when fetuses are infected in utero. For example, rubella virus, and cytomegalovirus cause a range of birth defects including microcephaly, in which brain and head size is severely reduced. Viral microcephaly has received renewed attention since Zika virus emerged on a global scale in 2015. We are integrating comparative proteomic approaches with high-throughput animal models to build an experimental pipeline. This will enable the rapid delineation of how Zika virus-host protein interactions lead to dysfunction of host proteins and inhibition of brain development. Capturing cellular responses with live-cell imaging Viruses perturb cells in a variety of ways. We build live-cell imaging systems to track how viruses and other environmental perturbations alter cellular behavior. We couple this with simple mechanistic models of cellular pathways or large-scale feature extraction to model and predict cellular responses. Biomolecular Engineering for Improved Viral Protein Production We produce viral proteins for research purposes, but some viral proteins are incredibly challenging to produce and are important inputs for various applications like vaccines and diagnostics. We use biomolecular engineering and biomanufacturing approaches to improve SARS-CoV-2 protein production. Synthetic Control of Gene Expression Just as viruses can control gene expression, we develop orthogonal methods to control gene expression using light and nutrients. These technologies have applications in tissue engineering and cultivated meat. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Microbiology Graduate Group Chemical Engineering Graduate Group Education and Degree(s) 2005 B.S. in Chemical Engineering, Massachusetts Institute of Technology 2011 Ph.D. in Chemical Engineering, University of California, Berkeley 2017 Postdoc in Systems Virology, University of California, San Francisco Publications Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Priya S. Shah NIH Awards Priya Shah $2.8 Million to Research How Zika Virus Causes Brain-Related Birth Defects August 31, 2023 An Engineering Approach to Solving Zika Virus June 01, 2023 Priya Shah Recognized for Exceptional Innovation December 15, 2022 College of Biological Sciences Virologists Talk Coronavirus March 09, 2020 Taking a Bite Out of Research: BMCDB Ph.D. Student Natalie Sahabandu Reflects on Her Journey as an Aggie January 27, 2020 Pagination Page 1 Next page Next Priya S. Shah (0000-0001-7518-2839) ORCID record for Priya S. Shah. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 3, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Mitchell H. Singer Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Mitchell H. Singer Breadcrumb Home Faculty Mitchell H. Singer Position Title Professor Microbiology and Molecular Genetics 530-752-9005 mhsinger@ucdavis.edu Lab website 268 Briggs Hall Bio Research Interests My lab primarily focuses on two aspects of development in the Gram negative social soil bacterium Myococcus xanthus :  1) identifying the hierarchical regulatory network that initiates and drives the developmental program and 2) determining the developmental link between DNA replication and the developmental program.  In both instances we rely on the transcriptional analysis to monitor progression through development.  My lab is also interested in the evolution of bacterial development in these ubiquitous bacteria and identifying core genes in the developmental process. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Education and Degree(s) 1982 B.S. in Microbiology, University of Illinois 1990 Ph.D. in Bacteriology, University of Wisconsin, Madison Publications Suen, G., J.S. Jakobsen, B.S. Goldman, M. Singer, A. G. Garza, and R.D. Welch. Bacterial Postgenomics: the Promise and Peril of Systems Biology. 2006 J. Bacteriol. 188:7999-8004 Pham, V.D., C.W. Shebelut, I.R. Jose, D.A. Hodgson, D.E. Whitworth and M. Singer. PhoP4 is Required for Proper Sporulation and Development-Specific Phosphatase Activities in Myxococcus xanthus. 2006. Microbiology. 152:1609-20 Viswanathan, P., M. Singer, and L. Kroos. Role of ?D in regulating genes and signals during Myxococcus xanthus development. 2006. J. Bacteriol. 188:3246-3256 Tzeng, L., T. N. Ellis, and M. Singer. DNA replication during aggregation phase is essential for Myxococcus xanthus fruiting body development. 2006. J. Bactiol. 188:2774-79 Diodati, M. E. , F. Ossa, N. B. Caberoy, I. R. Jose, W. Hiraiwa, M.M. Igo, M. Singer*, and A.G. Garza*. Nla18, a key regulatory protein required for normal growth and development in Myxococcus xanthus. 2006. J. Bacteriol 188:1733-43. Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Mitchell H. Singer Equipped to Fight in 2020: College of Biological Sciences Launches Capstone COVID-19 Virtual Lab Course April 02, 2020 Biology on the Emerald Isle: Study Abroad Program Provides Transformative Experiences October 08, 2018 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Mariel Vázquez Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Mariel Vázquez Breadcrumb Home Faculty Mariel Vázquez Position Title Professor Microbiology and Molecular Genetics Mathematics (530) 754-0383 mrlvazquez@ucdavis.edu Lab website Google Scholar ORCID (0000-0001-8328-6806) 09 Briggs Hall Bio Research Interests I am a mathematical/computational biologist. My research lies at the interface of molecular biology, mathematics, computer science and polymer physics. I specialize in the application of topological tools and discrete methods to study DNA, RNA and their interactions with proteins. My work is currently focused on the following lines of inquiry: (1) DNA Topology: the packing of chromosomes in human cells and viral capsids, and the mechanism of site-specific recombinases and topoisomerases as it relates to knotting and interlinking of DNA; (2) Evolution and dynamics of coronaviruses: we use bioinformatics, biophysical models, and topological data analysis to study viral evolution, with an emphasis on identifying complex chromosomal rearrangements; (3) Structure and formation of R-loops: using a combination of experimental and quantitative methods to study the formation and the 3-dimensional structure of R-loops and other triple helices. Graduate Program Affiliations Integrative Genetics and Genomics Graduate Group Education and Degree(s) 1994 B.Sc. in Mathematics, National Autonomous University of Mexico 2000 Ph.D. in Mathematical Biology, Florida State University Publications Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Mariel Vázquez 10 Elected as AAAS Fellows, 2 from CBS April 18, 2024 Using Machine Learning to Detect Coronavirus Threats August 01, 2023 National Science Foundation Grant to Help UC Davis Researchers Track Evolution of Novel Coronavirus May 13, 2020 Discovering Curiosity: The Tangled Fate of Math and Biology with Professor Mariel Vazquez October 28, 2019 Professor Mariel Vazquez Named Faculty Director  of the Center for the Advancement of Multicultural Perspectives on Science October 08, 2019 Pagination Page 1 Next page Next Mariel Vázquez (0000-0001-8328-6806) ORCID record for Mariel Vázquez. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Lifeng Xu Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Lifeng Xu Breadcrumb Home Faculty Lifeng Xu Position Title Associate Professor Microbiology and Molecular Genetics 530-752-3660 lfxu@ucdavis.edu Google Scholar ORCID (0000-0002-7887-5451) 341A Briggs Hall Bio Research Interests Telomeres are the protective nucleoprotein structures at the ends of linear eukaryotic chromosomes. Telomere dysfunction contributes to cancer progression and aging. Our laboratory employs molecular and cytological approaches to study telomere maintenance in human normal cells and cancer cells. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Education and Degree(s) 1993 B.S. in Biology, Fudan University 2000 Ph.D. in Molecular Biology, Princeton University Publications Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Lifeng Xu Interrupting the Development of Cancer Cells August 05, 2021 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 17, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Erin E. Easlon | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Erin E. Easlon Breadcrumb Home Faculty Erin E. Easlon Position Title Academic Coordinator Microbiology and Molecular Genetics she/her/hers eeaslon@ucdavis.edu 2033D Katherine Esau Science Hall Bio Research Interests I am the Academic Coordinator and an Instructor for Introductory Biology BIS2A. I am responsible for all aspects of the course discussion section development, coordination, administration, instructional training, delivery and TA hiring, training, and supervision. In my research, I am working on implementing online learning tools in BIS2A designed to foster growth of an online student community. These tools allow students to read the text, comment, ask questions, answer each other questions and pull in personal experiences in an online space where students are rewarded for participating. I also work with graduate student TAs and have developed a practice-based training program designed to teach TAs how to lead an active learning classroom. Several TAs who have completed this training have gone on to education-based employment at other universities. Education and Degree(s) 2003 B.S. in Genetics, University of California, Davis 2008 Ph.D. in Biochemistry and Molecular Biology, University of California, Davis 2008-2010 Postdoctoral Research for the USDA, California Publications Bin Li, Craig Skinner, Pablo R. Castello, Michiko Kato, Erin Easlon, Li Xie, Tianlin Li, SHu-Ping Lu, Chen Wang, Felicia Tsang, Robert Poyton, Su-Ju Lin, “Identification of Potential Calorie Restriction-Mimicking Yeast Mutants with Increased Mitochondrial Respiratory Chain and Nitric Oxide Levels,” Journal of Aging Research, vol. 2011, Article ID 673185, 16 pages, 2011. doi:10.4061/2011/673185 Wang C, Skinner C, Easlon E, Lin SJ (2009) Deleting the 14-3-3 protein Bmh1 extends life span in Saccharomyces cerevisiae by increasing stress response. Genetics, 183(4):1373-84. Chen, A. D. Steele, G. Hutter, J. Bruno, A. Govindarajan, Erin Easlon, S. Lin, A. Aguzzi, S. Lindquist, L. Guarente (2008) The role of calorie restriction and SIRT1 in prion-mediated neurodegeneration. Exp Gerontol, 43(12):1086-93. Chen D, Bruno J, Easlon E, Lin SJ, Cheng HL, Alt FW, Guarente L (2008) Tissue- specific regulation of SIRT1 by calorie restriction. Genes Dev, 22(13):1753-7. Easlon, F. Tsang, C. Skinner and S. Lin (2008) The malate-aspartate NADH shuttle components are novel metabolic longevity regulators required for calorie  restriction mediated life  span extension. Genes Dev, 22(7):931-44. Tags Department of Microbiology and Molecular Genetics Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: May 7, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Eric Mann | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Eric Mann Breadcrumb Home Faculty Eric Mann Position Title Lecturer Microbiology and Molecular Genetics erimann@ucdavis.edu 2094 Katherine Esau Science Hall Tags Department of Microbiology and Molecular Genetics Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 22, 2023 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Hannah N. Starcevich | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Hannah N. Starcevich Breadcrumb Home Faculty Hannah N. Starcevich Position Title Academic Coordinator Microbiology and Molecular Genetics she/her/hers 530-754-7360 hnstarcevich@ucdavis.edu 3033C Katherine Esau Science Hall Bio Research Interests I am responsible for all of the background work that keeps the MIC classes and laboratories running smoothly (including course administration, adapting instructional materials, SDC accommodations, and all things TA-related). Beyond administrative spreadsheets, my favorite topics in microbiology are parasitology and history of disease. Courses MIC102: Introductory Microbiology MIC103L: Introductory Microbiology Lab MIC104L: General Microbiology Lab MIC105/MIC105L: Microbial Diversity and Lab BIS10: Everyday Biology Education and Degree(s) 2009 B.S. in Biochemistry, Walla Walla University 2014 M.S. in Biology, Walla Walla University 2023 Ph.D. in Microbiology, UC Davis Tags Department of Microbiology and Molecular Genetics Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 7, 2023 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Stanley W. Artz Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Stanley W. Artz Breadcrumb Home Faculty Stanley W. Artz Position Title Professor Emeritus Microbiology and Molecular Genetics swartz@ucdavis.edu Bio Research Interests Amino acid deprivation and the interaction of guanosine tetraphosphate at the molecular level to regulate gene expression in bacteria. Education and Degree(s) 1967 B.S. in Microbiology, Cornell University 1972 Ph.D. in Biochemistry, Purdue University Publications DaCosta XJ and SW Artz. 1997. Mutations that render the promoter of the histidineoperon of Salmonella typhimurium insensitive to nutrient-rich medium repression and amino acid downshift. Journal of Bacteriology. 179:5211-5217 Thorner LK, JP Fandl, and SW Artz. 1990. Analysis of sequence elements important for expression and regulation of the adenylate cyclase gene (cya) of Salmonella typhimurium. Genetics. 125:709-717 Fandl JP, LK Thorner, and SW Artz. 1990. Mutations that affect transcription and cyclic AMP-CRP regulation of the adenylate cyclase gene (cya) of Salmonella typhimurium. Genetics. 125:719-727 Tags Department of Microbiology and Molecular Genetics Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Paul Baumann Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Paul Baumann Breadcrumb Home Faculty Paul Baumann Position Title Professor Emeritus Microbiology and Molecular Genetics pabaumann@ucdavis.edu Bio Research Interests As a microbiologist, my research focuses on endosymbiotic associations between bacteria and plant sap-sucking insects, exploring their molecular interactions. I study the mosquitocidal toxin of Bacillus sphericus to understand its molecular biology and potential applications in mosquito control. Additionally, I characterize marine bacteria, particularly those in the genera Vibrio, Photobacterium, Alteromonas, and Pseudomonas, investigating their roles in marine ecosystems. Through my work, I aim to contribute to our understanding of microbial interactions and develop innovative approaches to pest control and marine microbiology. Education and Degree(s) 1961 B.A. in Bacteriology, University of California, Berkeley 1966 Ph.D. in Bacteriology, University of California, Berkeley Publications Baumann P. 2005. Biology of bacteriocyte-associated endosymbionts of plant sap-sucking insects. Annual Review of Microbiology 59:155-189 Baumann P, Baumann L, Lai C-L, Rouhbakhsh D, Moran NA, Clark MA 1995. Genetics, physiology, and evolutionary relationships of the genus Buchnera: intracellular symbionts of aphids. Annual Review of Microbiology 49:55-94 Baumann P, Clark MA, Baumann L, Broadwell AH. 1991. Bacillus sphaericus as a mosquito pathogen: properties of the organism and its toxins. Microbiological Reviews. 55:425-436 Baumann P, Baumann L, Woolkalis MJ, Bang SS. 1983. Evolutionary relationships in Vibrio and Photobacterium: a basis for a natural classification. . Annual Review of Microbiology 37:369-398 Baumann P, Baumann L. 1975 Catabolism of D-fructose and D-ribose by Pseudomonas doudoroffii. I. Physiological studies and mutant analysis. Archives of Microbiology. 105:225-240 Tags Department of Microbiology and Molecular Genetics Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - John L. Ingraham Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team John L. Ingraham Breadcrumb Home Faculty John L. Ingraham Position Title Professor Emeritus Microbiology and Molecular Genetics Bio Research Interests Metabolism and nutrition of the water mold, Allomyces; enzymology of degradation of cis, cis muconic acid by Pseudomonas fluorescens; studies on the malolactic fermentation including initiating the first winery malolactic fermentation; determining the pathways of formation of fusel oil components including n-butanol and n-propanol, determining the effect of growth temperature on the composition of bacterial membrane fatty acids: determining effect of growth temperature on the growth rate of psychrophilic and mesophilic bacteria; isolating cold-sensitive mutants and determining the molecular basis for their defects, determining the pathways of utilization of pyrimidine nucleosides by Salmonella typhimurium; discovering the existence of natural transformation among species of Pseudomonas and the active role played by donor cells; characterizing patterns of denitrification of Pseudomonas spp. characterizing nitrous oxide reduction of Pseudomonas stutzeri and the mechanism of insertion of copper. Education and Degree(s) 1947 B.S. in Chemistry, University of California, Berkeley 1951, Ph.D. in Microbiology, University of California, Berkeley Tags Department of Microbiology and Molecular Genetics Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - JaRue S. Manning Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team JaRue S. Manning Breadcrumb Home Faculty JaRue S. Manning Position Title Professor Emeritus Microbiology and Molecular Genetics jsmanning@ucdavis.edu Bio Research Interests Molecular mechanisms by which enveloped viruses enter, replicate in, and are released from cells. Education and Degree(s) 1963 B.S. in Physics, San Francisco State University 1969 Ph.D. in Biophysics, University of California, Berkeley Publications Weiss SA, BF Dunlop, R Georgis, DW Thomas, PV Vail, DF Hoffman, and JS Manning. 1994. Production of baculovirus on industrial scale. Proceedings of the Sixth International Colloquium on Invertebrate Pathology and Microbial Control. 1:440-446 Vail PV, DF Hoffman, DA Street, JS Manning, and JS Tebbets. 1993. Infectivity of a nuclear polyhedrosis virus located from Anagrapha falcifera (Lepidoptera: Noctuidae) against production and postharvest pests and homologous cell lines. Environment Roberts SR and JS Manning. 1993. The major envelope glycoprotein of the extracellular virion of Autographa californica nuclear polyhedrosis virus possesses at least three distinct neutralizing epitopes. Virus Research. 28:285-297 Tags Academic Departments Department of Microbiology and Molecular Genetics Content by JaRue S. Manning JaRue Manning Honored as ‘Double’ Distinguished Emeritus March 14, 2017 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - John C. Meeks Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team John C. Meeks Breadcrumb Home Faculty John C. Meeks Position Title Professor Emeritus Microbiology and Molecular Genetics jcmeeks@ucdavis.edu Bio Research Interests Physiological, biochemical, genetic and genomic analysis of cellular differentiation in filamentous cyanobacteria - Symbiotic interactions. Our experimetnal system is the filamentous cyanobacterium Nostoc punctiforme. N. punctiforme is unique in that, depending on environmental signals, its vegetative cells can differentiate into three distinct and mutually exclusive cell types: nitrogen-fixing heterocysts (when limited for combined nitrogen), spore-like akinetes (when energy stressed), and motile by gliding hormogonium filaments (under conditions both positive and negative for growth). Moreover, N. punctiforme can fix nitrogen in free-living and plant-associated symbiotic growth states. The plant partners span the phylogenetic spectrum from Bryophyte hornworts and liverworts, to Gymnosperm cycads, and the Angiosperm family Gunneraceae. When in symbiotic association, the plant partners control the differentiation and physiological behavior of hormogonia (the infective units) and heterocysts (the functional units). The genome of N. punctiforme, at 9.059 Mbp, is large for a bacterium and is distributed between an 8.23 Mbp circular chromosome and five plasmids ranging from 26 to 354 kbp. We apply biochemical, genetic and genomic (proteomic and transcriptomic) approaches to identify and manipulate the regulatory pathways of free-living and symbiotic cellular differentiation of N. punctiforme. Education and Degree(s) 1966 B.S. in Biology, Central Washington University 1967 M.S. in Biology, Central Washington University 1972 Ph.D. in Biology, University of Oregon Publications Tags Academic Departments Department of Microbiology and Molecular Genetics Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Douglas C. Nelson Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Douglas C. Nelson Breadcrumb Home Faculty Douglas C. Nelson Position Title Professor Emeritus Microbiology and Molecular Genetics dcnelson@ucdavis.edu Bio Research Interests Ecology, physiology, and genetics of chemoautotrophic sulfur bacteria including impact of high in situ pressure. Microbial production of methyl mercury in marine and freshwater sediments. Stimulation and augmentation promoting bacterial production of calcite for improvement of soil mechanical properties. Education and Degree(s) 1970 B.S. in Chemistry/Biology, Harvey Mudd College 1979 Ph.D. in Biology, University of Oregon Publications Tags Academic Departments Department of Microbiology and Molecular Genetics Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Rebecca Parales Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Rebecca Parales Breadcrumb Home Faculty Rebecca Parales Position Title Professor Emerita Microbiology and Molecular Genetics 530-754-5233 reparales@ucdavis.edu 226 Briggs Hall Bio Research Interests Bacterial degradation of aromatic hydrocarbons and man-made environmental pollutants. Bacterial chemotaxis to pollutants and man-made chemicals. Education and Degree(s) 1981 B.S. in Chemistry, University of Connecticut 1993 Ph.D. in Microbiology, Cornell University Publications M.A. Valderrama-Gómez, R.A. Schomer, M.A. Savageau, and R.E. Parales. 2020. TaxisPy: A Python-based Software for the quantitative analysis of bacterial chemotaxis. J. Microbiol. Methods. 175:105918. R.E. Parales, G. Sharma, X. Zhang, M.E. Wright, J.T. Langner, G.A. Subuyuj, J.L. Ditty and S.C. Dawson. 2019. Draft genome sequence of the caffeine-degrading methylotroph Methylorubrum populi Pinkel. Microbiol. Resource Announc. 8:e01300-19. R.A. Luu, R.A. Schomer, C.N. Brunton, R. Truong, A.P. Ta, W.A. Tan, J.V. Parales, Y.-J. Wang, Y.-W. Huo, S.-J. Liu, J.L. Ditty, V. Stewart and R.E. Parales. 2019. Hybrid 2-component sensor for identification of bacterial chemoreceptor function. Appl. Environ. Microbiol. 85:e01626-19. X. Zhang, J.G. Hughes, G.A. Subuyuj, J.L. Ditty and R.E. Parales. 2019. Chemotaxis to alcohols by Pseudomonas putida F1. Appl. Environ. Microbiol. 85:e01625-19. R.E. Parales and J.L. Ditty. 2018. Chemotaxis to atypical attractants by soil bacteria. Methods Mol. Biol. 1729:255-280. Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Rebecca Parales Buzz Killer: Caffeine Pollutes. Can Bacteria Help? January 26, 2023 Alumni Profile: Fascinating Fungi with Dr. Fun Guy February 13, 2020 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - David Pratt Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team David Pratt Breadcrumb Home Faculty David Pratt Position Title Professor Emeritus Microbiology and Molecular Genetics dpratt@ucdavis.edu Bio Tags Department of Microbiology and Molecular Genetics Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Chester W. Price Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Chester W. Price Breadcrumb Home Faculty Chester W. Price Position Title Professor Emeritus Microbiology and Molecular Genetics cwprice@ucdavis.edu Bio Research Interests My work as a microbiologist focuses on the mechanisms regulating stress responses in bacteria. These are basic for survival in the natural environment, food systems, and pathogenic interactions. I aim to understand these responses beginning with the sensors that detect each stress, extending through the signal transduction pathways that convey this information to key transcription factors, and culminating with the role of the genes these factors control. Such response networks comprise modular components that are reshuffled for different signaling tasks. Uncovering their molecular underpinnings is therefore of wide biological interest, with practical relevance to agriculture, food safety, and infectious disease. Education and Degree(s) 1968 B.A. in Microbiology, University of California, Riverside 1976 Ph.D. in Microbiology, University of California, Davis Publications Tags Academic Departments Department of Microbiology and Molecular Genetics Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - John R. Roth Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team John R. Roth Breadcrumb Home Faculty John R. Roth Position Title Distinguished Professor Emeritus Microbiology and Molecular Genetics jrroth@ucdavis.edu Lab website Bio Research Interests Origin of Mutations Under Selection While natural selection is simple to define, it is difficult to follow in natural settings since small-effect mutations often dictate the sequence of events. The high rate at which small-effect mutations arise seems to underlie a controversy that has continued about whether or not the stress of selective growth conditions induces an increase in mutation rate. We propose that growth limitation seems mutagenic because small-effect mutations are more common than generally appreciated and make an unexpectedly large contribution to selective adaptation. We are trying to dissect in detail one system that is often cited as evidence for stress-induced mutagenesis (adaptive mutation). We think we can convince you that it's all about growth under selection and has nothing to do with mutagenesis.  Surprisingly, this system involves mating between bacterial cells and localized over-replication of mutational target. A lifestyle that may define a bacterial species All Salmonellae dedicate 1% of their genome to synthesis of cobalamin (vitamin B12) and another 1% of their genome to use this cofactor for anaerobic growth on two non-fermentable carbon sources -- ethanolamine and propanediol. This constellation of functions must contribute heavily to Salmonella's fitness in a natural setting. Laboratory studies have had difficultly suggesting how these several functions might contribute to success of natural populations. Recently an solution has been suggested by our colleage Andreas Baumler at the UC Davis Medical School. Baumler's lab has shown that these functions contribute together to enhance Salmonella proliferation in an inflammed mouse gut. Salmonella induces gut inflammation and thereby causes the mouse to provide both of the two carbon sources and an repiratory electron acceptor. The inflammed host gut releases ethanolamine and propanediol and oxidizes hydrogen sulfide to tetrathionate which Salmonella can use as electron acceptor. This give Salmonella a source of nutrients that are not availbable to other gut inhabitants. The functions described above (B12 synthesis, ethanolamine and propanediol degradation, tetrathionate oxidation) have been used individually by taxonomists to identify Salmonella. Since essentially all Salmonella isolates show all of the properties, we suggest that these functions may be central to defining the lifestyle that characterizes Salmonellae and selective holds them together as a taxonomic group. Enzymes for catabolizing ethanolamine and propanediol are held within a protein cage or microcompartment that resembles the carboxysome of photosynthetic bacteria. We are trying to determine how this compartment works and how it benefits Salmonella in the wild. We think that understanding this compartment in Salmonella, may help us understand why similar compartments contain enzymes of CO2 fixation in bacteria that perform 30% of the global carbon fixation. Recombination as an Inside Job While DNA recombination is generally studied by perfoming genetic crosses in the laboratory, the process of recombination is used internally in bacteria, primarily for DNA repair and replication fork restarting. Sexual recombination is very rare in natural populations. We use chromosome rearrangments in Salmonella to learn about recombination mechanisms. Most recently we've found (to our surprise) that gene duplications arise at an extremely high rate and form by a mechanism that does not require recombination. This is despite the general belief that they form by unequal recombination. Many duplications are not simple tandem repeats but contain direct repeats that flank a central third copy positioned in inverse order (a tandem inversion duplication or TID). We're testing a model in which TIDs form by a series of events initiated by short palindromic sequences in the normal genome. These are then converted by remodeling deletions into the several types of duplications that are commonly studied. Domesticated transposable elements may dictate species-specific patterns of gene amplification The chromosomes of enteric bacteria harbor several sets of dispersed repeated sequences that are thought to be derived from ancient transposable elements.  These include REP, BoxC, RSA and ERIC elements.  Despite the inability of these elements to transposose, their sequences and positions appear to be maintained by purifying selection, suggesting that they play a valuable role in cell function.  Two properties are shared by all of these elements --- they are palindromic and are usually found within transcribed regions of the genome.   Recently we've noticed recombination-independent duplications that form between copies of these palindromic elements,  We've also noticed that although these elements are found in many enteric species, particular forms appear to be species specific.  For example, the AelRep and LasRep elements consist of an RSA or Eric element with an inserted central palindromic element.   The resulting composite elements are found in virtually all isolates of Salmonella but in no isolate of its closest relative, E. coli.   Conversely, the BoxC related BOCE elements are found in E. coli, but ever in Salmonella.   We suggest that palindromic elements dictate endpoints of duplications that are of frequent selective value in the lifestyles of various bacteria.  Their palindromic nature allows them to initiate TID duplications as described above.  Duplication formation can be regulated when transcription of the element generates an R-loop, in which the element appears in the excluded sense strand of DNA.  When made single-stranded, palindromes can form hairpins or more complex secondary structures that are subject to cutting and initiation of the duplicaiton formation.   Similar functionality may be associated with ancient transpoable elements in metazoan genomes. Education and Degree(s) 1961 B.A. in Biochemical Sciences, Harvard College 1965 Ph.D. in Biology/Genetics, Johns Hopkins University 1997 Ph.D. (Honoris Causa) Umeå University, Umeå, Sweden Publications Tags Academic Departments Department of Microbiology and Molecular Genetics Content by John R. Roth Roth Receives ASM Lifetime Achievement Award March 26, 2015 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Michael A. Savageau Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Michael A. Savageau Breadcrumb Home Faculty Michael A. Savageau Position Title Distinguished Professor Emeritus Microbiology and Molecular Genetics masavageau@ucdavis.edu Lab website Bio Research Interests Savageau’s research aimed to elucidate function, design and evolution of natural and synthetic molecular systems. His Group focused on development of general mathematical and computational methods, and on their application to specific molecular systems. His work included d eveloping mathematical systems biology, identifying design principles in molecular biology, developing a computationally assisted \"system design space methodology\" for relating genotype and environment to the phenotype of complex biochemical systems. Education and Degree(s) 1962 B.S. in Engineering Science, University of Minnesota 1963 M.S. in Physiology and Systems Engineering, University of Iowa 1967 Ph.D. in Cell Physiology and Systems Engineering, Stanford University 2011 Ph.D. Science Honoris Causa, Universitat de Lleida, Spain Publications Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Michael A. Savageau Michael Savageau Receives 2021 Akira Okubo Prize March 16, 2021 Michael Savageau Elected Fellow of the American Academy of Microbiology June 24, 2017 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Valley Stewart Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Valley Stewart Breadcrumb Home Faculty Valley Stewart Position Title Professor Emeritus Microbiology and Molecular Genetics vjstewart@ucdavis.edu Bio Research Interests Anaerobic respiration and nitrogen metabolism in Escherichia coli and Klebsiella grimontii. Physiology and genetics of plant-pathogenic Xanthomonas spp. Education and Degree(s) 1977 B.A. in Biology, University of Colorado 1982 Ph.D. in Microbiology, University of Virginia 1985 Postdoc in Molecular Genetics, Stanford University Publications Stewart, V., and P. C. Ronald.  2022.  Sulfotyrosine residues: interaction specificity determinants for extracellular protein-protein interactions.  J. Biol. Chem. 298: in press.  PMID:35798140 Stewart, V., and P. C. Ronald.  2021.  The Xanthomonas RaxH-RaxR two-component regulatory system is orthologous to the zinc-responsive Pseudomonas ColS-ColR system.  Microorganisms 9: 1458. PMCID: PMC8306577 Joe, A., V. Stewart, and P. C. Ronald.  2021.  The HrpX protein activates synthesis of the RaxX sulfopeptide, required for activation of XA21-mediated immunity to Xanthomonas oryzae pv. oryzae .  Mol. Plant Microbe Interact. 34: 1307-1315. PMID: 34731589 Liu, F., M. McDonald, B. Schwessinger, A. Joe, R. Pruitt, T. Erickson, X. Zhao, V. Stewart, and P. C. Ronald.  2019.  Variation and inheritance of the Xanthomonas raxX-raxSTAB gene cluster required for activation of XA21-mediated immunity.  Mol. Plant Pathol. 20: 656-672.  PMID: 30773771 Huynh, T. N., and V. Stewart.  2011.  Negative control in two-component signal transduction by transmitter phosphatase activity.  Mol. Microbiol. 82: 275-286.  PMCID: PMC3192241 Tags Academic Departments Department of Microbiology and Molecular Genetics Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Merna R. Villarejo Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Merna R. Villarejo Breadcrumb Home Faculty Merna R. Villarejo Position Title Professor Emeritus Microbiology and Molecular Genetics mrvillarejo@ucdavis.edu Bio Research Interests Mechanism of bacterial adaptation to osmotic stress. Education and Degree(s) 1959 B.S. in Biochemistry, University of Chicago 1963 Ph.D. in Biochemistry, University of Chicago Publications Wise A, R Brems, V Ramakrishnan, and M Villarejo. 1996. Sequences in the 35 region of Escherichia coli rpoS-dependent genes promote transcription by Esigmas. Journal of Bacteriology. 178:2785-2793 Ding Q, S Kusano, M Villarejo, and A Ishihama. 1995. Promoter selectivity control of E. coli RNA polymerase: Differential recognition of osmoregulated promoters by Esigmas and Esigma70 holoenzymes. Molecular Microbiology. 16:6 Mellies J, A Wise, and M Villarejo. 1995. Two different E. Coli proP promoters respond to osmotic and growth phase signals. Journal of Bacteriology. 177:144-151 Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Merna R. Villarejo Biology Undergraduate Scholars Program Celebrates 30 Years of Inspiring Change in the Life Sciences April 19, 2019 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Mark L. Wheelis Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Mark L. Wheelis Breadcrumb Home Faculty Mark L. Wheelis Position Title Professor Emeritus Microbiology and Molecular Genetics mlwheelis@ucdavis.edu Bio Research Interests History of biological warfare. Biological weapons control. Phylogeny of microorganisms. Wheelis co-wrote the important paper Towards a natural system of organisms: proposal for the domains Archaea, Bacteria, and Eucarya that proposed a change from the Two-empire system of Prokaryotes and Eukaryotes to the Three-domain system of the domains Eukaryota, Bacteria and Archaea. The paper was significant in establishing Three-domain system as current scientific consensus. Education and Degree(s) 1965 B.A. in Biological Sciences, University of California, Berkeley 1967 M.A. in Microbiology, University of California, Berkeley 1969 Ph.D. in Bacteriology, University of California, Berkeley Tags Department of Microbiology and Molecular Genetics Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Wiltraud Pfeiffer Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Wiltraud Pfeiffer Breadcrumb Home Faculty Wiltraud Pfeiffer Position Title Lecturer (In Memoriam) Microbiology and Molecular Genetics Obituary Education and Degree(s) M.S. 1959 Ph.D. 1962 Tags Academic Departments Department of Microbiology and Molecular Genetics Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: July 18, 2022 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Martin L. Privalsky Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Martin L. Privalsky Breadcrumb Home Faculty Martin L. Privalsky Position Title Distinguished Professor (In Memoriam) Microbiology and Molecular Genetics Obituary Memorial fund Education and Degree(s) 1974 B.S. in Biochemistry, State University of New York, Stony Brook 1979 Ph.D. in Biochemistry, University of California, Berkeley 1979-1983 Postdoctoral Research, University of California, San Francisco Tags Academic Departments Department of Microbiology and Molecular Genetics Content by Martin L. Privalsky Gateway to Cancer Research: Popular Undergraduate Course Inspires Future Scientists July 10, 2018 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: March 20, 2023 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm ."
]