[
    "Alice Accorsi | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Alice  Accorsi Breadcrumb Home Faculty Alice  Accorsi Position Title Assistant Professor Molecular and Cellular Biology she/they aaccorsi@ucdavis.edu Lab website Google Scholar ORCID (0000-0003-0606-2977) 102G Briggs Hall Bio Research Interests We are interested in the cellular and molecular mechanisms that control the development and regeneration of sensory organs, such as eyes. Vertebrate eyes are complex sensory organs, defined as camera-type eyes. In the lab, we take full advantage of a newly established system, the golden apple snail Pomacea canaliculata , where - for the first time - full regeneration of adult camera-type eyes can be systematically explored at the molecular, cellular and genetic level. We use sequencing techniques, light microscopy and CRISPR/Cas9 mutagenesis to expand our understanding of adult regeneration and stem cell biology. Our main goals are: identifying the cells that allow for regeneration, discover the gene regulatory network (GRN) that controls the regeneration of an adult eye and discriminate which components of this GRN are regeneration-specific and which one are shared with developmental programs. P. canaliculata is a great new platform to discover novel concepts in regeneration, plasticity and evolutionary conservation of the visual system. Education and Degree(s) 2009 B.S. in Biological Sciences, University of Modena and Reggio Emilia (Italy) 2011 M.S. in Biology, University of Modena and Reggio Emilia (Italy) 2015 Ph.D. in Cell Biology and Evolution, University of Modena and Reggio Emilia (Italy) 2015-2024 Postdoctoral Fellow in Developmental Biology, Stowers Institute for Medical Research Publications Tags Department of Molecular and Cellular Biology Content by Alice  Accorsi CBS Welcomes 5 New Faculty in the 2023-24 Year August 07, 2024 Alice  Accorsi (0000-0003-0606-2977) ORCID record for Alice  Accorsi. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Jawdat Al-Bassam Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Jawdat Al-Bassam Breadcrumb Home Faculty Jawdat Al-Bassam Position Title Associate Professor Molecular and Cellular Biology 530-752-3521 jawdat@ucdavis.edu Lab website Google Scholar ORCID (0000-0001-6625-2102) 3220 Green Hall Bio Research Interests Microtubules are dynamic protein polymers that generate forces inside eukaryotic cells that lead to transformations to divide, develop, or crawl. Microtubules assemble from basic building blocks, known as alpha beta (αβ) tubulin dimers, which polymerize head-to-tail to form protofilaments, using the energy of Guanosine 3,5 Triphosphate (GTP) binding and hydrolysis; These protofilaments associate laterally enclosing a tube-like structure-- a microtubule. Tubulin polymerization is driven by its high concentration inside the cytoplasm and activates GTP hydrolysis upon its incorporation into microtubule lattices at their ends.  However, during stochastic reversals, called catastrophes, tubulin protofilaments stop polymerizing and peel-out to rapidly dissemble microtubules. The Al-Bassam laboratory studies conserved multi-subunit molecular machines drive soluble αβ-tubulin heterodimers biogenesis inside cells, and how αβ-tubulins are polymerized or depolymerized at microtubule ends.  These molecular machines are found in all eukaryotic organisms and act as αβ-tubulin “factories”, microtubule “polymerases” or “depolymerases” to accelerate specific aspects of microtubule dynamics inside cells.  We also study the mechanism and regulation of kinesin motor proteins involved in organizing microtubules during bipolar spindle assembly during mitosis.  We are focused on deciphering mechanisms of molecular machines and how they cooperate during cell division and development. We combine biochemistry with structural biology approaches such as cryo-electron microscopy (cryo-EM) and X-ray crystallography, and high-resolution single molecule total internal reflection microscopy reconstitution studies to gain a full mechanistic view of structure in relation to function.  Combining these powerful approaches bridges a large resolution range between the αβ-tubulin structure and its polymerization into  microtubules, which span from micro-meter to the sub-nano-meter scales.   These approaches allow us to link  atomic organization and architectures of these molecular machines with αβ-tubulin and their conformational changes with their unique functional states at microtubule ends. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Biophysics Graduate Group Education and Degree(s) 1998 B.S. in Biochemistry, California State University, Long Beach 2004 Ph.D. in Biochemistry and Biophysics, Scripps Research Institute 2011 Post Doctoral Fellow, Harvard Medical School Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by Jawdat Al-Bassam New Cryo-Electron Microscope Powers Biological Sciences Discovery February 18, 2020 CRYO EM: Unleashing the Future of Biology at UC Davis February 04, 2020 Visualizing “Unfurling” Microtubule Growth November 13, 2018 Molecular Machine, Not Assembly Line, Assembles Microtubules August 19, 2015 Jawdat Al-Bassam (0000-0001-6625-2102) ORCID record for Jawdat Al-Bassam. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 3, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - John Albeck Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team John Albeck Breadcrumb Home Faculty John Albeck Position Title Professor Molecular and Cellular Biology 530-752-0646 jgalbeck@ucdavis.edu Lab website Google Scholar 243 Briggs Hall Bio Research Interests Research in my lab is focused on understanding the mechanisms of information flow in signal transduction networks controlling cell growth, survival, and metabolism. While traditional studies of signaling have focused on the identity of the proteins involved in such cascades and the nature of the interactions between them, we are studying how the activation dynamics of these pathways encode specific information for the cell. Our goal is to address the question of how specificity is achieved when the same small group of pathways (including ERK, Akt, AMPK, and mTOR) controls a diverse set of cellular behaviors (proliferation, growth, migration, apoptosis, autophagy, and differentiation). To decipher this signaling “code”, we combine computational models with live cell data from genetically encoded fluorescent biosensors for phosphorylation or transcription events. By tracking signaling events in many individual cells and associating them with corresponding cellular phenotypes and the activation of specific genes, we aim to identify temporal signaling programs that drive cell behaviors. This knowledge can then be used to improve the results of therapeutic interventions in cancer and other diseases, by predicting the cellular responses to signaling inhibitors. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Education and Degree(s) 2000 B.A. in Biological Sciences, Cornell University 2007 Ph.D. in Computational and Systems Biology, Massachusetts Institute of Technology Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by John Albeck Donors Support 12 New Chancellor’s Fellows, 1 from CBS February 03, 2022 Helping the Socially Disadvantaged July 22, 2021 Outstanding Student Research Earns Undergraduate Bita Shahrvini Multiple Awards May 08, 2018 Didem Sarikaya Awarded UC President’s Postdoctoral Fellowship February 23, 2018 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 3, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - F. Javier Arsuaga Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team F. Javier Arsuaga Breadcrumb Home Faculty F. Javier Arsuaga Position Title Professor Molecular and Cellular Biology Mathematics He/him/his 530-754-0416 jarsuaga@ucdavis.edu Lab website Google Scholar ORCID (0000-0002-4979-8215) 0009 Briggs Hall Bio Research Interests I develop mathematical and computational methods to address questions that arise in the study of the 3D structure of chromosomes. The three dimensional (3D) structure of the genome plays a key role in the dynamics of the living cell tightly regulating essential biological processes such as transcription, replication and repair. In humans, disruption of the 3D structure of the genome, in the form of large-scale rearrangements and copy number changes, is the signature of DNA-damaging agents and has been associated with a wide range of diseases, including cancer. In parasitic organisms, the 3D structure of the genome is a frequent drug target. Descriptions of the 3D structure genomes however have remained elusive even for the simplest organism. (1) We are developing new mathematical methods to characterize the packing of DNA in: dsDNA bacteriophages, mitochondrial DNA in trypanosomes (kDNA) and yeast. (2) We are developing Topological Data Analysis methods for the molecular characterization of breast cancer. (3) Our response to COVID-19 : In our most recent research we are investigating the mutation landscape of COVID-19. As of March 2020 COVID-19 has mutated and expanded across the human population; a total of 214 haplotypes (i.e. sequence variations) and 344 different strains have been identified. Most of these variations, gained through mutation, recombination, and natural selection, have been found in the Spike (S) protein. W e are developing a computational pipeline that estimates the mutation landscape of the COVID 19 ’s S protein, and simultaneously  are measuring binding of the S protein to the human receptor ACE2 using cryo-electron microscopy. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Education and Degree(s) 1993 B.S. in Mathematics, Universidad de Zaragoza, Spain 2000 Ph.D. in Mathematics, Florida State University Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by F. Javier Arsuaga How Mathematics Informs Molecular Biology April 04, 2024 Using Machine Learning to Detect Coronavirus Threats August 01, 2023 2023 Chancellor's Fellowship For Diversity, Equity and Inclusion June 22, 2023 National Science Foundation Grant to Help UC Davis Researchers Track Evolution of Novel Coronavirus May 13, 2020 Discovering Curiosity: The Tangled Fate of Math and Biology with Professor Mariel Vazquez October 28, 2019 F. Javier Arsuaga (0000-0002-4979-8215) ORCID record for F. Javier Arsuaga. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Enoch P. Baldwin Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Enoch P. Baldwin Breadcrumb Home Faculty Enoch P. Baldwin Position Title Associate Professor Molecular and Cellular Biology 530-752-1108 epbaldwin@ucdavis.edu Lab website ORCID (0000-0002-1472-0944) 4B Briggs Hall Bio Research Interests As a researcher, my work focuses on the structural biochemistry, enzymology, regulation, and cellular biology of protein-nucleic acid interactions. Utilizing biochemical and structural methods, I study protein/nucleic acids structure and function with a particular emphasis on enzymology and molecular recognition. My model systems include nucleotide-biosynthetic enzymes, with specific research targets on the mechanism and regulation of E. coli Cytidine Triphosphate (CTP) Synthetase and the regulation and dynamic localization of human CTP synthetases. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Biophysics Graduate Group Education and Degree(s) 1982 B.A. in Chemistry, State University of New York, Purchase 1989 Ph.D. in Chemistry, University of California, Berkeley 1997 Post-doctoral X-ray Crystallography IMB, University of Oregon Publications Lynch EM, Hicks DR, Shepherd M, Endrizzi JA, Maker A, Hansen JM, Barry RM, Gitai Z, Baldwin EP, Kollman JM. (2017) Human CTP synthase filament structure reveals the active enzyme conformation. Nature structural & molecular biology 24(6):507-514. Habrian, C, Chandrasekhara, A, Shahrvini, B, Hua, BH, Lee, J, Jessinghaus, R, Barry, R, Gitai, Z, Kollman, J, and Baldwin, EP.  2016. Inhibition of E. coli CTP synthetase by NADH and other nicotinamides, and their mutual interactions with CTP and GTP.  Biochemistry 55, 5554-65. Barry RM, Bitbol A-F, Lorestani A, Charles EJ, Habrian CH, Hansen JM, Li H-J, Baldwin EP, Wingreen NS, Kollman JM, and Gitai Z. 2014. Large-scale filament formation inhibits the activity of CTP synthetase. eLIFE 3, e03638. Ozes, A, Feoktistova, K, Avanzino, B, Baldwin, E and Fraser C. 2014. Real-time fluorescence assays to monitor duplex unwinding and ATPase activities of helicase proteins. Nature Protocols 9, 1645-61. Meckler JF, Bhakta MS, Kim M-S, Ovadia R, Habrian CH, Zykovich A, Yu A, Lockwood SH, Morbitzer R, Elsäesser J, Lahaye T, Segal DJ, and Baldwin EP. 2013. Quantitative Analysis of TALE-DNA Interactions Suggests Polarity Effects. Nucleic Acids Res. 41, 4118-28. Tags Academic Departments Department of Molecular and Cellular Biology Content by Enoch P. Baldwin New Cryo-Electron Microscope Powers Biological Sciences Discovery February 18, 2020 CRYO EM: Unleashing the Future of Biology at UC Davis February 04, 2020 Outstanding Student Research Earns Undergraduate Bita Shahrvini Multiple Awards May 08, 2018 Enoch P. Baldwin (0000-0002-1472-0944) ORCID record for Enoch P. Baldwin. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Sean M. Burgess Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Sean M. Burgess Breadcrumb Home Faculty Sean M. Burgess Position Title Professor Molecular and Cellular Biology 530-754-5177 smburgess@ucdavis.edu Lab website Google Scholar ORCID (0000-0003-0511-0084) 139 Briggs Hall Bio Research Interests Work in my laboratory explores the dynamic chromosome events that occur during the process of meiosis and how they are integrated to achieve accurate chromosome segregation. Chromosome missegregation is one of the leading causes of birth defects and pregnancy loss in humans. We combine the use of a wide array of tools, including genetics, molecular biology, and live-cell imaging using budding yeast Saccharomyces cerevisiae and zebrafish Danio rerio as a model system. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Education and Degree(s) 1987 B.A. in Molecular Cellular and Developmental Biology, University of Colorado, Boulder 1993 Ph.D. in Genetics, University of California, San Francisco 1999 Post-doc in Molecular and Cellular Biology, Harvard University Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by Sean M. Burgess Using Glowing Fish to Detect Harmful Pesticides August 15, 2023 Tenuous Tethers: Study Provides Live View into Interchromosomal Dynamics During Meiosis March 22, 2022 Biology Year in Review: Our 10 Most Popular Stories from 2019 December 11, 2019 A Menagerie of Model Organisms May 14, 2019 Sharing Life Sciences with the World April 03, 2019 Pagination Page 1 Next page Next Sean M. Burgess (0000-0003-0511-0084) ORCID record for Sean M. Burgess. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Silvia Carrasco Garcia Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Silvia Carrasco Garcia Breadcrumb Home Faculty Silvia Carrasco Garcia Position Title Assistant Professor of Teaching Molecular and Cellular Biology 530-752-9884 scarr@ucdavis.edu 156 Briggs Hall Bio Research Interests Scientific writing is an essential tool for our students, both for reaching a deeper understanding of the material they learn while in college, and for their future professional career. Creating as many opportunities as possible for them to practice in a context where they receive good support and feedback is a challenge when having big enrollment classes. How can we overcome this challenge? Education and Degree(s) 1998 B.S. in Biology, Autonoma University, Madrid, Spain 2000 M.S. in Biochemistry, Autonoma University, Madrid, Spain 2002 M.S. in Molecular Biology, Autonoma University, Madrid, Spain 2006 Ph.D. in Molecular Biology/Biochemistry, Autonoma University, Madrid, Spain Publications High-sensitivity measurements of multiple kinase activities in live single cells. S. Regot, J. Hughey, B. Bajar, S. Carrasco, MW. Covert. Cell 2014; 157(7):1724-34 A polarized Ca(2+), diacylglycerol and STIM1 signaling system regulates directed cell migration FC. Tsai, A. Seki, HW. Yang, A. Hayer, S. Carrasco, S. Malmersjö, T. Meyer. Nat Cell Biol 2014; 16(2):133-44 Whole-cell model quantitatively predicts experimental outcomes at the cellular and molecular scale. JC. Sanghvi, S. Regot, S. Carrasco, JR. Karr, MV. Gutschow, B. Bolival Jr., MW. Covert. Nat Methods 2013; 10(12):1192-5 STIM proteins and endoplasmic reticulum-plasma membrane junctions. S.Carrasco, T. Meyer. Ann Rev Biochem 2011; 80:973-1000 Cracking CRAC. S.Carrasco, T.Meyer. Nat Cell Biol 2010; 12(5):416-8. Comment on: Nat Cell Biol 2010; 12(5):436-46 Tags Academic Departments Department of Molecular and Cellular Biology Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Jennifer Cash | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Jennifer Cash Breadcrumb Home Faculty Jennifer Cash Position Title Assistant Professor Molecular and Cellular Biology 530-754-2412 jcash@ucdavis.edu Lab website NIH publication listing Briggs 102C Bio Research Interests Our research focuses on understanding the molecular mechanisms that regulate RhoGEFs, which are enzymes that activate GTPases, key signaling proteins involved in various cellular processes such as cytoskeleton dynamics, cell migration, and cell growth. My lab employs a combination of biochemical, structural, and cellular approaches, including methods in cryo-electron microscopy, to investigate the function and regulation of RhoGEFs. By exploring how these proteins interact with their regulators and effectors, we aim to provide insights into their roles in health and disease, particularly in cancer progression and metastasis. Our ultimate goal is to uncover potential therapeutic targets for diseases related to RhoGEF dysregulation. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Education and Degree(s) B.S. in Zoology, Kent State University Ph.D. in Structural Biology, University of Cincinnati Postdoc in Structural biology, University of Michigan Publications Cash, Jennifer, Chandan, N., Sharma, P., Smrcka, A., and Tesmer, J. (2020) Discovery of Small Molecules that Target the P-Rex1 PIP3-binding Site and Inhibit P-Rex1-dependent Functions in Human Neutrophils. Molecular Pharmacology, 97, 226-236. DOI: 10.1124/mol.119.117556 Cash, Jennifer, Urata, S., Li, S., Ravala, S., Avramova, L., Shost, M., Gutkind, J., Tesmer, J., and Cianfrocco, M. (2019) Cryo-electron Microscopy Structure and Analysis of the P-Rex1–Gbg signaling scaffold. Science Advances 5, eaax8855. DOI:  10.1126/sciadv.aax8855 Cash, Jennifer, Sharma, P., and Tesmer, J. (2019) Structural and Biochemical Characterization of the Pleckstrin Homology Domain of the RhoGEF P-Rex2 and Its Regulation by PIP3. Journal of Structural Biology:  X 1, 100001. DOI:  10.1016/j.yjsbx.2018.100001 Cash, Jennifer, Davis, E., and Tesmer, J. (2016) Structural and Biochemical Characterization of the Catalytic Core of the Metastatic Factor P-Rex1 and Its Regulation by PtdIns(3,4,5)P3. Structure 24, 730-740. DOI: 10.1016/j.str.2016.02.022 Cash JN, Angerman EB, Kirby RJ, Merck L, Seibel WL, Wortman MD, Papoian R, Nelson S, Thompson TB. Development of a small-molecule screening method for inhibitors of cellular response to myostatin and activin A. J Biomol Screen. 2013 Aug;18(7):837-44. doi: 10.1177/1087057113482585. Epub 2013 Mar 29. PubMed PMID: 23543431. Tags Department of Molecular and Cellular Biology Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Frédéric Chédin Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Frédéric Chédin Breadcrumb Home Faculty Frédéric Chédin Position Title Professor and Chair Molecular and Cellular Biology 530-752-1800 flchedin@ucdavis.edu Lab website Google Scholar ORCID (0000-0002-1306-5335) 102E Briggs Hall Bio Research Interests We are focused on understanding the formation, function, and resolution of R-loop structures, a class of non-B DNA structures that form during transcription upon re-annealing of the nascent RNA transcript to one strand of the DNA duplex. Genome-wide mapping data from my laboratory established that R-loop structures are the most abundant non-B DNA structures in mammalian genomes and suggests that they represent a novel type of cis-acting DNA element. Our main research themes are: Developing and improving genomics technologies to map R-loop formation. Understanding the mechanisms by which R-loops are formed, sensed, and dynamically resolved. Analyzing the relationship between R-loop structures and genome stability. Elucidating how dysfunctions in R-loop metabolism are linked to human diseases. To address these topics, my group makes use of innovative (epi)genomics tools, mammalian cell culture and imaging assays, biochemical assays, proteomic methods, and computational approaches. Center Affiliations Genome Center Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Education and Degree(s) 1991 M.S. in DNA Repair and Recombination, University of Paris, France 1995 Ph.D. in DNA Recombination in Bacteria, University of Paris, France Publications Tags Academic Departments Department of Molecular and Cellular Biology Frédéric Chédin (0000-0002-1306-5335) ORCID record for Frédéric Chédin. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - R. Holland Cheng Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team R. Holland Cheng Breadcrumb Home Faculty R. Holland Cheng Position Title Professor Molecular and Cellular Biology 530-9888 659 rhch@ucdavis.edu Lab website Google Scholar 007 Briggs Hall Bio Research Interests Our research aims to understand the structure and function of macromolecular interactions by selected model macromolecular systems. Viral structural proteins have the capacity to function both in assembly and in disassembly, which is made possible through a built-in flexibility triggered by cellular events. We observe conformational changes of viral particles at various states of their life cycle to analyze their assembly intermediates as well as the mature forms. Similarly, infectious virions can be treated with numerous conditions, e.g. receptor-mediated genome release or acid-activated membrane fusion, to observe the key steps of viral re-entry into host cells. Using electron microscopy, we apply a rapid-frozen and low-dose imaging procedure to best preserve the biological specimen in its native form. Computer image processing is developed to retrieve most of the useful signal from the low-contrast micrographs. Technical implementation of cryo-EM, cellular tomography, and computational modeling schemes also enables us to address interactions involved in complex biological molecules and/or nanoscale machines. Editor-in-Chief: Developmental Microbiology and Molecular Biology Graduate Program Affiliations Biophysics Graduate Group Education and Degree(s) 1992 Ph.D. in Structural Biology, Purdue University Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by R. Holland Cheng Developing and Testing Genome Editing Technology for Human Health April 27, 2021 Equipped to Fight in 2020: College of Biological Sciences Launches Capstone COVID-19 Virtual Lab Course April 02, 2020 UC Davis Awarded New CRISPR Grant to Test Novel Approach to Cancer Treatment October 01, 2019 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Bruce W. Draper Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Bruce W. Draper Breadcrumb Home Faculty Bruce W. Draper Position Title Professor Molecular and Cellular Biology 530-752-0833 bwdraper@ucdavis.edu Lab website ORCID (0000-0002-4397-7749) 102D Briggs Hall Bio Research Interests We study mechanisms that regulate the development and function of germline stem cell in zebrafish, with a main focus on female germline stem cells. We study factors that function within the stem cells, as well as those that are required for the development of the somatic gonad, the germ cell niche. While zebrafish do not switch sex as adults, our lab has recently discovered that maintenance of the adult female sexual phenotype is an active process that requires continuous input from germ cells, as the reduction of germ cell numbers in an adult female results in female-to-male sex reversal. Our current research is focused on determining what signal is produced by the germ cells and how it influences the developmental state of the somatic gonad. The mechanisms mediating the development of the somatic gonad in vertebrates during the transition from the sexually bipotential state to the sex-specified state are well defined. In contrast, far less is known about the genes acting earlier during formation of the undifferentiated gonad primordium. We recently discovered that a mutation in a zebrafish Fgf ligand, fgf24 , results in the rapid loss of germ cells during early larval development, at a time prior to gonad differentiation. Our results suggest that the primary function of fgf24 is to promote the development of early somatic gonad cells and that the loss of germ cells in fgf24 mutants is secondary to this defect. We are currently investigating the role of fgf24 in regulating the development of the early somatic gonad. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Education and Degree(s) 1988 B.A. in Biochemistry and Cellular Biology, University of California, San Diego 1995 Ph.D. in Zoology, University of Washington Publications Yulong Liu, Michelle E Kossack, Matthew E McFaul, Lana N Christensen, Stefan Siebert, Sydney R Wyatt, Caramai N Kamei, Samuel Horst, Nayeli Arroyo, Iain A Drummond, Celina E Juliano, Bruce W Draper (2022) Single-cell transcriptome reveals insights into the development and function of the zebrafish ovary eLife 11:e76014. Yan YL, Batzel P, Titus T, Sydes J, Desvignes T, BreMiller R, Draper B, Postlethwait JH. A Hormone That Lost Its Receptor: Anti-Müllerian Hormone (AMH) in Zebrafish Gonad Development and Sex Determination. Genetics. 2019 Oct;213(2):529-553. doi: 10.1534/genetics.119.302365. Epub 2019 Aug 9. PMID: 31399485; PMCID: PMC6781894. Leerberg, D.M., Hopton, R.L. and Draper, B.W. (2019) Fibroblast growth factor receptors function redundantly during zebrafish embryonic development. Genetics 212, 1301-1319. PMID: 31175226 Kossack, M.E., High, S.K., Hopton, R.E., Yan, Y., Postlethwait, J.H. and Draper, B.W. (2018) Female sex development and reproductive duct formation depend on Wnt4a in zebrafish. Genetics 211, 219-233. PMID: 30446521 Blokhina, Y.P., Nguyen, A.D., Draper, B.W. and and  Burgess, S.M. (2018) The telomere bouquet is a hub where meiotic double-strand breaks, synapsis, and stable hololog juxtaposition are coordinated in the zebrafish Danio rerio. PLOS Genetics 15(1): e1007730. PMID: 30653507 Yan, Y.L., Desvignes, R/. BreMiller, R., Wilson, C., Dillon, D., High, S., Draper, B., Buck, C.L. and Postlethwait, J. (2017) The gonadal soma controls ovarian follicle proliferation through Gsdf in zebrafish. Dev. Dyn. 246(11), 925-945. PMID: 28856758 Tags Academic Departments Department of Molecular and Cellular Biology Content by Bruce W. Draper Immune Cells Drive Sex Reversal in Zebrafish – and Perhaps Fertility Loss in Women December 12, 2023 Using Glowing Fish to Detect Harmful Pesticides August 15, 2023 CBS Annual Faculty Awards Recognize Excellence in Teaching, Research June 15, 2023 BMCDB Graduate Student Yulong Liu Wins UC Davis Dissertation Year Fellowship for Single-Cell Atlas of Zebrafish Ovary May 11, 2020 The Aggie Tutorial Farm Is Open April 13, 2020 Pagination Page 1 Next page Next Bruce W. Draper (0000-0002-4397-7749) ORCID record for Bruce W. Draper. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Marina Ellefson Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Marina Ellefson Breadcrumb Home Faculty Marina Ellefson Position Title Associate Professor of Teaching Molecular and Cellular Biology 530-752-9664 mlellefson@ucdavis.edu Biology Education Research website Google Scholar 156 Briggs Hall Bio Research Interests My research interests lie at the intersection of biology and how people teach and learn about science. I practice and promote evidence-based effective teaching strategies and conduct research to understand and improve undergraduate biology education through a data-driven approach. High-impact teaching and learning practices in large-enrollment courses As undergraduate enrollment continues to grow nationwide, class sizes in both lower- and upper-division courses are increasing. How can high-enrollment biology classes be taught to maximize student engagement, interaction, inclusion, and learning? I collect classroom data to investigate the impact that different teaching practices have on learning and students experience in high-enrollment courses. Promoting science skills and scientific literacy for the 21st century student Given the recent revolutionary changes in science, technology, and medicine, how can we reform undergraduate biology curricula to best prepare students for the scientific challenges they will encounter in their careers and lives? I am interested in developing curriculum development that (1) integrates research skills and experiences, critical thinking, and problem-solving in biology and (2) use examples that situate learning about biology in the context of societal and personal issues of interest to provide access points for learning biology and developing strong scientific literacy. Developing and evaluating best practices for teaching and learning in Genetics Genetics is a fundamental component of undergraduate biology curricula. Most genetics courses cover content spanning classic Mendelian genetics and central dogma to cloning and genomics. I am interested in modernizing genetics courses to reflect current knowledge and practices that are essential for a 21st century learner as well as investigating effective approaches for learning genetics and mitigating commonly formed misconceptions. Fostering evidence-based teaching practices among faculty and future faculty Due to recent national calls, there is an ongoing national effort towards transforming science education that necessitates support and training in evidence-based effective teaching practices. In collaboration with the Center for Educational Effectiveness, I am active in providing resources and leading pedagogical training for faculty. I am also co-leading an effort to develop a program for graduate students in undergraduate scientific teaching with the goal of providing pedagogical training and authentic teaching experience opportunities to graduate students in the biological sciences. Education and Degree(s) 2007 B.S. in Genetics, University of California, Davis 2012 Ph.D. in Biochemistry, Molecular, Cellular, and Developmental Biology, University of California, Davis 2015 Postdoctoral Appointment, Heald Lab, University of California, Berkeley Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by Marina Ellefson Annual Faculty Awards Celebrate Excellence in Education and Innovation July 18, 2024 Discovering Curiosity: The Cycle of Mentorship with Assistant Professor of Teaching Marina Crowder June 25, 2019 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Oliver Fiehn Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Oliver Fiehn Breadcrumb Home Faculty Oliver Fiehn Position Title Professor Molecular and Cellular Biology 530-754-8258 ofiehn@ucdavis.edu Lab website West Coast Metabolomics Center Google Scholar ORCID (0000-0002-6261-8928) 1315 Genome and Biomedical Sciences Facility Bio Research Interests The Fiehn research laboratory develops improved methods in analytical chemistry and cheminformatics to capture and utilize metabolomic data, specifically in cancer metabolism, and other health-related projects. Metabolomics is used both as a discovery tool (including for biomarker research) and to discern mechanism in cellular regulations in health and disease.  We validate metabolic hypotheses using multiple other tools, including proteomics and genomics data sets as well as a variety of biological models on organismal, tissue or cellular levels. For examples of our research, please follow our most recent papers on https://scholar.google.com/citations?user=6BXzO88AAAAJ&hl=en&oi=ao Center Affiliations Genome Center Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrated Genetics and Genomics Graduate Group Education and Degree(s) 1993 Diplom ~M.Sc. in Chemistry, Free University Berlin, Germany 1997 Ph.D. in Analytical Chemistry, Technical University of Berlin, Germany Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by Oliver Fiehn Capsule Captures First Look Inside Digestion in Healthy People May 16, 2023 A Map of Mouse Brain Metabolism in Aging October 26, 2021 Professor Oliver Fiehn Awarded Paul K. and Ruth R. Stumpf Professorship in Plant Biochemistry October 17, 2017 Thompson Reuters Lists Professors Eisen and Fiehn Among World's Most Influential Scientists September 15, 2015 Finding Biomarkers for Early Lung Cancer Diagnosis August 17, 2015 Oliver Fiehn (0000-0002-6261-8928) ORCID record for Oliver Fiehn. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Andrew J. Fisher Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Andrew J. Fisher Breadcrumb Home Faculty Andrew J. Fisher Position Title Professor Molecular and Cellular Biology 530-754-6180 ajfisher@ucdavis.edu Faculty profile Lab website Google Scholar ORCID (0000-0003-3488-6594) 4A Briggs Hall Bio Research Interests My research focuses on key biochemical processes essential for life. One main focus in the lab is to investigate how organisms post-transcriptionally edit their RNA. Specifically, my team is understanding the structural basis of selectivity and catalysis of Adenosine Deaminase acting on RNA (ADAR). This knowledge has advanced the application of using ADAR to treat genetic disorders at the RNA level. Additionally, the lab is investigating the structural basis of activity of key enzymes in glycobiology. These studies aim to uncover fundamental mechanisms that can lead to advancements in both agriculture and medicine. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Biophysics Graduate Group Chemistry and Chemical Biology Education and Degree(s) 1987 B.S. in Biochemistry, Purdue University 1992 Ph.D. in Biophysics, Purdue University 1996 Postdoc, Biochemistry, University of Wisconsin-Madison Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by Andrew J. Fisher Investigating the Molecular Defense Tactics of Plants April 11, 2018 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Christopher S. Fraser Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Christopher S. Fraser Breadcrumb Home Faculty Christopher S. Fraser Position Title Professor Molecular and Cellular Biology 530-752-1716 csfraser@ucdavis.edu Lab website 204 Briggs Hall Bio Research Summary My research focuses on the molecular mechanisms of protein synthesis and RNA biology, aiming to understand the fundamental processes of cellular and viral gene expression and regulation. I delve into the intricate details of how ribosomes, the molecular machines responsible for protein synthesis, are regulated and how various factors influence their function. Through biochemical and structural approaches, I explore how messenger RNA is selected for translation into protein, seeking to uncover new insights into the control of gene expression. My research has significant implications for understanding diseases caused by errors in protein synthesis and RNA regulation. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Education and Degree(s) 1995 B.S. in Biology, University of Sussex 1999 Ph.D. in Biochemistry, University of Sussex Publications Querido, J. B., Sokabe, M., Kraatz, S., Gordiyenko, Y., Skehel, J. M., Fraser, C. S., and Ramakrishnan, V. Structure of a human 48S translational initiation complex. Science. 2020 Sep 4;369(6508):1220-1227. Sokabe, M, and Fraser, C. S. Toward a Kinetic Understanding of Eukaryotic Translation. Cold Spring Harb. Perspect. Biol. 2019 Feb 1;11(2). Avanzino, B. C., Fuchs, G., and Fraser, C. S. Cellular cap-binding protein, eIF4E, promotes picornavirus genome restructuring and translation. Proc Natl Acad Sci U S A. 2017 Sep 5;114(36):9611-9616. Sokabe, M., and Fraser, C. S. ATP-dependent restructuring of the 40S subunit decoding site during mRNA recruitment. Proc Natl Acad Sci U S A. 2017 Jun 13;114(24):6304-6309. García-García, C., Frieda, K. L., Feoktistova, K., Fraser, C. S., and Block, S. M. Factor-Dependent Processivity in the Human eIF4A DEAD-box Helicase. Science. 2015 Jun 26;348(6242):1486-8. Tags Academic Departments Department of Molecular and Cellular Biology Content by Christopher S. Fraser One CBS Student’s Mission to Inspire and Uplift the Next Generation of Scientists May 09, 2024 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Celina Juliano Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Celina Juliano Breadcrumb Home Faculty Celina Juliano Position Title Associate Professor Molecular and Cellular Biology 530-752-8882 cejuliano@ucdavis.edu Lab website Google Scholar 102A Briggs Hall Bio Research Interests Hydra is in a constant state of development, with all cells being replaced every 20 days by active stem cell populations. We are using single cell RNA sequencing to uncover the developmental trajectories and shed light on the regulatory control of development. Hydra has remarkable regenerative ability, including the ability to regenerate from a small piece of tissue or even reassemble from dissociated single cells. We are interested in understanding how injury signals trigger developmental pathways during regeneration. We are interested in understanding the molecular mechanisms that allow Hydra stem cells to continually replace cells in an essentially “immortal” animal. We study the function of the PIWI-piRNA pathway in Hydra stem cells, which we hypothesize is required to maintain genomic integrity. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Education and Degree(s) 1997 B.S., University of Miami 2010 Ph.D., Brown University 2015 Post-doctoral Fellow, Yale University Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by Celina Juliano Postdoctoral Researcher Explores Regeneration in the \"Reemerging\" Hydra February 15, 2024 Celina Juliano Named 2023-24 Chancellor's Fellow February 13, 2024 Postdoctoral Researchers Awarded Hartwell Fellowships to Probe Tissue Regeneration and Molecular Roots of Dystonia January 16, 2024 Using Hydra to Understand Tissue Regeneration March 09, 2023 $1 Million Keck Foundation Grant Backs Research to \"Build a Brain\" July 13, 2021 Pagination Page 1 Next page Next Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Ken Kaplan Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Ken Kaplan Breadcrumb Home Faculty Ken Kaplan Position Title Professor Molecular and Cellular Biology 530-754-5044 kbkaplan@ucdavis.edu Lab website Google Scholar 3133 Green Hall Bio Research Interests To better understand the mechanisms and pathways underlying chromosome maintenance, we are focused on pathways that ensure the integrity of chromosomes during anaphase and how changes that lead to chromosome instability contribute to disease states (e.g, cancer).  We currently are focused on two main projects: Anaphase \"Surveillance\": This project examines the network of regulatory pathways and mechanisms that coordinate the faithful replication of chromosomes, their segregation in mitosis and the resolution of sister chromatids in anaphase. Our recent work suggests that a series of feedback loops help to ensure the damage-free resolution of sister chromatids. In particular, we are interested in the intersection between checkpoints and chromosome passenger proteins and how they combine to regulate a divers array of cellular activities in response to DNA replication stress, including spindle forces as well as membrane dynamics involved in nucleophagy. Chromosome instability in cancer: These set of questions originated with our efforts to understand how cancer cells gain a chromosome instability (CIN) phenotype (one path to aneuploidy). We focused our early work on colorectal cancer as cells isolated from these cancers exhibit a high rate of mitotic errors. Our work demonstrated that one major contributor to chromosome instability comes from the initiating mutation in the tumor suppressor, adenomatous polyposis coli (APC).  Though we remain interested in mechanisms that contribute to chromosome instability in cancers, our initial studies led us to focus on a paradox described by a number of labs studying cells with extra chromosomes, or aneuploidy. Namely, aneuploidy has been shown to lead to cell stress (e.g., proteotoxic and replication stress) that are generally not favorable for cell divisions, yet cancer cells divide and expand in the presence of these stresses. The answer to this paradox may lie in the ability of pre-cancer cells to be \"reprogrammed\" so that they adapt to tolerate the aneuploid state (as well as other cancer-associated changes). We term this reprogramming as cancer cell \"adaption\" and we propose that it involves a specific set of molecular changes that increase the likelihood that normal cells with sustain cancer-associated changes (i.e., a cancer \"permissive\" state). Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Education and Degree(s) 1986 B.S. in Biology, Haverford College 1994 Ph.D., University of California, San Francisco 1994-1999 Post-doctoral studies, Massachusetts Institute of Technology Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by Ken Kaplan Student-Led Research Reveals “Off-Switch” for Autophagy March 21, 2024 Equipped to Fight in 2020: College of Biological Sciences Launches Capstone COVID-19 Virtual Lab Course April 02, 2020 Biology Year in Review: Our 10 Most Popular Stories from 2019 December 11, 2019 Finding a Research Lab: Undergraduate Mackenzie Noon Bridges Biology and Computer Science January 02, 2019 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: October 18, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Ian F. Korf Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Ian F. Korf Breadcrumb Home Faculty Ian F. Korf Position Title Professor Molecular and Cellular Biology 530-754-4989 ifkorf@ucdavis.edu Lab website 4333 Genome and Biomedical Sciences Facility Bio Research Interests High-throughput technologies are transforming biology, medicine, agriculture, and related fields. Biology is now incredibly data-rich and requires computers to organize and analyze the data. My research program mixes -omic technologies and information technology to make new discoveries in genome structure and function. My lab is highly collaborative, and we always welcome potential research partners. My students can all do lab work and program, and many are co-mentored. Current interests include milk biology, gene prediction, genome assembly, sequence alignment, DNA-protein interactions, intron function, epigenetics, and more. Center Affiliations Genome Center Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Education and Degree(s) 1989 B.A. in Genetics, Cornell University 1996 Ph.D. in Molecular, Cellular, and Developmental Biology, Indiana University Bloomington Publications Laufer BI, Hwang H, Jianu JM, Mordaunt CE, Korf IF, Hertz-Picciotto I, LaSalle JM. Low-pass whole genome bisulfite sequencing of neonatal dried blood spots identifies a role for RUNX1 in Down syndrome DNA methylation profiles. Hum Mol Genet. 2021 Jan 6;29(21):3465-3476. doi: 10.1093/hmg/ddaa218. PubMed PMID: 33001180; PubMed Central PMCID: PMC7788293. Halstead MM, Kern C, Saelao P, Wang Y, Chanthavixay G, Medrano JF, Van Eenennaam AL, Korf I, Tuggle CK, Ernst CW, Zhou H, Ross PJ. A comparative analysis of chromatin accessibility in cattle, pig, and mouse tissues. BMC Genomics. 2020 Oct 7;21(1):698. doi: 10.1186/s12864-020-07078-9. PubMed PMID: 33028202; PubMed Central PMCID: PMC7541309. Westreich ST, Salcedo J, Durbin-Johnson B, Smilowitz JT, Korf I, Mills DA, Barile D, Lemay DG. Fecal metatranscriptomics and glycomics suggest that bovine milk oligosaccharides are fully utilized by healthy adults. J Nutr Biochem. 2020 May;79:108340. doi: 10.1016/j.jnutbio.2020.108340. Epub 2020 Jan 17. PubMed PMID: 32028108; PubMed Central PMCID: PMC72 Treiber ML, Taft DH, Korf I, Mills DA, Lemay DG. Pre- and post-sequencing recommendations for functional annotation of human fecal metagenomes. BMC Bioinformatics. 2020 Feb 24;21(1):74. doi: 10.1186/s12859-020-3416-y. PubMed PMID: 32093654; PubMed Central PMCID: PMC7041091. Chin EL, Huang L, Bouzid YY, Kirschke CP, Durbin-Johnson B, Baldiviez LM, Bonnel EL, Keim NL, Korf I, Stephensen CB, Lemay DG. Association of Lactase Persistence Genotypes (rs4988235) and Ethnicity with Dairy Intake in a Healthy U.S. Population. Nutrients. 2019 Aug 10;11(8). doi: 10.3390/nu11081860. PubMed PMID: 31405126; PubMed Central PMCID: PMC672395 Tags Academic Departments Department of Molecular and Cellular Biology Content by Ian F. Korf The Language of Biology: How the Heck Do Scientists Assemble a Genome? March 14, 2019 Ian F. Korf (0000-0001-5259-6182) ORCID record for Ian F. Korf. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Walter S. Leal Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Walter S. Leal Breadcrumb Home Faculty Walter S. Leal Position Title Distinguished Professor Molecular and Cellular Biology 530-752-7755 wsleal@ucdavis.edu Lab website Google Scholar ORCID (0000-0002-6800-1240) Wikipedia 1107 The Grove (Surge III) Bio Research Interests Insect prominence among other animals is primarily due to a sophisticated olfactory system, which can selectively detect minute amounts of odorants. We aim to unravel the molecular mechanisms underpinning this remarkable selectivity and sensitivity of the insect’s olfactory system (e.g., BioRxiv 485336; PMID: 35430419; PMID: 31760135; PMID: 31349189 ). One main applied objective of our research is to “identify approaches that will help control or prevent the transmission of vector-borne pathogens to humans.” This goal is in line with the mission of the National Institute of Allergy and Infectious Diseases (NIAID) – the primary sponsor of our research program. We apply a reverse chemical ecology approach (e.g., PMID: 29311316; PMID: 30401626) that leads to developing novel mosquito oviposition attractants and repellents. This multi-disciplinary approach identifies olfactory proteins, such as odorant receptors (e.g., PMID: 24167245; PMID: 25349401; PMID: 35364281; PMID: 31442487), and small molecules (putative attractants and repellents) that interact with them. Lastly, we test these lead compounds using sensory physiology methods, measuring behavior, and performing field tests. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Plant Biology Graduate Group Education and Degree(s) 1982 B. Eng. (Chemical Engineering), Federal University of Pernambuco, Brazil 1987 M.S. in Agricultural Chemistry, Mie University, Tsu-Mie, Japan 1990, Ph.D. in Applied Biochemistry, University of Tsukuba, Japan 1991 Postdoc in Entomology, National Institute of Sericultural and Entomological Science, Japan Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by Walter S. Leal Plant Researchers and Molecular Biologist Elected to National Academy of Sciences May 07, 2024 Distinguished Professor Walter Leal Receives Academic Senate's 2024 Faculty Research Award March 05, 2024 For This Beetle, ‘Date Night’ Comes Every Other Day January 18, 2024 Citrus Greening Bacteria Affects Pest's Sense of Smell December 14, 2023 A Distinguished Legacy: Recognizing Barbara Horwitz June 06, 2023 Pagination Page 1 Next page Next Walter S. Leal (0000-0002-6800-1240) ORCID record for Walter S. Leal. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "James A. Letts | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team James A. Letts Breadcrumb Home Faculty James A. Letts Position Title Associate Professor Molecular and Cellular Biology 530-752-3193 jaletts@ucdavis.edu Lab website Google Scholar ORCID (0000-0002-9864-3586) Briggs Hall 25A Bio Research Interests My research program focuses on how organisms use electron transport membrane proteins to convert energy from the food that we eat into a form that can be used by cells across many essential processes, as well as in cellular defense and signaling. I seek to characterize the structures and functions of these important membrane protein complexes in order to learn about how they work and how their dysfunction results in disease. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Biophysics Graduate Group Education and Degree(s) 2007 B.S. in Biochemistry and Microbiology, University of Victoria 2013, Ph. D., The Rockefeller University Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by James A. Letts CBS DACA Students Awarded American Heart Association Fellowship November 03, 2023 First Complete Structures of Plant Respiratory Proteins January 12, 2023 New Technology Solves Mystery of Respiration in Tetrahymena May 03, 2022 Assistant Professor James Letts Wins Department of Energy Early Career Award June 03, 2021 Mitochondrial Chitter-Chatter: Unveiling the Molecular Structures of Cellular Respiration September 03, 2019 Pagination Page 1 Next page Next James A. Letts (0000-0002-9864-3586) ORCID record for James A. Letts. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Richard J. McKenney Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Richard J. McKenney Breadcrumb Home Faculty Richard J. McKenney Position Title Associate Professor Molecular and Cellular Biology rjmckenney@ucdavis.edu 3225 Green Hall Bio Research Interests I have a long-standing research interest in the cytoskeleton, and in particular the motor proteins that utilize the cytoskeleton as tracks for intracellular transport. I was fortunate to have an opportunity at basic research beginning early in my undergraduate career, where I worked on signaling pathways related to cancer. This work afforded me valuable, early experience in the lab, and confirmed to me that I wanted to pursue research as a career. I pursued graduate research focused on the mechanochemical regulation of the microtubule motor cytoplasmic dynein. At Columbia University, I joined the lab of Dr. Richard Vallee, who discovered the motor protein cytoplasmic dynein. My work was the first to describe how two regulatory proteins, LIS1 and NudE, are able to modulate dynein’s motor output, transforming it from a weak to a persistent motor. This work combined biochemistry and biophysical approaches to provide insights into long-standing questions in the dynein and brain development fields, as LIS1 is the causative gene of the neurodevelopmental disease lissencephaly. I then moved to the lab of Dr. Ron Vale at UCSF to continue my studies on dynein using advanced single molecule microscopy. In Ron's lab I have made several contributions to the dynein field, including how dynein organizes microtubule networks, how it is activated and linked to cargo through the dynactin complex and adapter proteins, and how its motor activity is directly influenced by post-translational modification of the microtubule track itself. My lab is interested in the fascinating world of molecular movement. We study how cells internally organize using molecular motor proteins. In particular, we focus on the microtubule cytoskeleton and the motor proteins that use this filament system for transport (kinesins and dyneins). We are interested in allosteric regulation of motor protein movement, how motor activity is balanced and coordinated, and how dysfunction in motor activity leads to human diseases such as cancer and neurodegeneration. The lab combines advanced molecular biology, biochemistry and single-molecule TIRF microscopy to address these problems. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Biophysics Graduate Group Education and Degree(s) 2002 B.S. in Biology, Xavier University 2010 Ph.D. in Pathology and Cell Biology, Columbia University Publications Chiba K, Ori-McKenney KM, Niwa S, McKenney RJ. Synergistic autoinhibition and activation mechanisms control kinesin-1 motor activity. Cell Rep. 2022 May 31;39(9):110900. doi: 10.1016/j.celrep.2022.110900. PubMed PMID: 35649356; NIHMSID:NIHMS1812260. Lam AJ, Rao L, Anazawa Y, Okada K, Chiba K, Dacy M, Niwa S, Gennerich A, Nowakowski DW, McKenney RJ. A highly conserved 310 helix within the kinesin motor domain is critical for kinesin function and human health. Science Advances. 2021 Apr 30;7(18):eabf1002. doi: 10.1126/sciadv.abf1002. PMID: 33931448. Sharma A, Preece B, Swann H, Fan X, McKenney RJ, Ori-McKenney KM, Saffarian S, Vershinin MD. Structural stability of SARS-CoV-2 virus like particles degrades with temperature. Biochem Biophys Res Commun. 2021 Jan 1;534:343-346. doi: 10.1016/j.bbrc.2020.11.080. Epub 2020 Nov 28. PMID: 33272571; PMCID: PMC7699159. Markus SM, Marzo MG, McKenney RJ. New insights into the mechanism of dynein motor regulation by lissencephaly-1. Elife. 2020 Jul 21;9:e59737. doi: 10.7554/eLife.59737. PMID: 32692650; PMCID: PMC7373426. Wormser O, Levy Y, Bakhrat A, Bonaccorsi S, Graziadio L, Gatti M, AbuMadighem A, McKenney RJ, Okada K, El Riati S, Har-Vardi I, Huleihel M, Levitas E, Birk OS, Abdu U. Absence of SCAPER causes male infertility in humans and Drosophila by modulating microtubule dynamics during meiosis. J Med Genet. 2021 Apr;58(4):254-263. doi: 10.1136/jmedgenet-2020-1069 Doval F, Chiba K, McKenney RJ, Ori-McKenney KM, Vershinin MD. Temperature-dependent activity of kinesins is regulable. Biochem Biophys Res Commun. 2020 Jul 30;528(3):528-530. doi: 10.1016/j.bbrc.2020.05.157. Epub 2020 Jun 4. PMID: 32507595; PMCID: PMC7366363. Tags Academic Departments Department of Molecular and Cellular Biology Content by Richard J. McKenney Understanding Healthy Function of Tau, Protein Associated with Dementia August 26, 2022 UC Davis Receives Philanthropic Support to Examine Under-Studied Pediatric Neurodegenerative Disorder May 06, 2021 Taking a Bite Out of Research: BMCDB Ph.D. Student Natalie Sahabandu Reflects on Her Journey as an Aggie January 27, 2020 Gatekeeper of the Cellular Highway: Study Reveals Novel Behaviors of the Alzheimer’s Disease Protein Tau September 02, 2019 Finding a Voice in Science: iBioseminars in Cellular and Molecular Biology Encourages Student Engagement July 09, 2019 Pagination Page 1 Next page Next Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Francis J. McNally Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Francis J. McNally Breadcrumb Home Faculty Francis J. McNally Position Title Professor Molecular and Cellular Biology 530-754-8018 fjmcnally@ucdavis.edu Lab website 3167 Green Hall Bio Research Interests Meiosis is a process by which animals, plants and fungi reduce chromosome number four-fold to produce haploid gametes. In females of both plants and animals, only one of four sets of chromosomes segregated during meiosis is inherited by a gamete. In animals, this asymmetric inheritance is mediated by asymmetric meiotic spindle positioning and highly asymmetric cell divisions that yield a large haploid egg. We are interested in the mechanisms that mediate these asymmetric divisions and utilize C. elegans because both meiotic divisions can be filmed in utero using fluorescent protein fusions and time-lapse imaging. We use a combination of classical genetics, RNAi and biochemistry to elucidate the roles of proteins that regulate microtubule-based motility, microtubule organization and microtubule dynamics in meiotic cell division. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Education and Degree(s) 1984 B.A. in Biochemical Sciences,  Princeton University 1990 Ph.D. in Biochemistry, University of California, Berkeley Publications Juanico IY, Meyer CM, McCarthy JE, Gong T, McNally FJ. 2021. Paternal mitochondria from an rmd-2, rmd-3, rmd-6 triple mutant are properly positioned in the C. elegans zygote.  MicroPubl Biol. 2021 Jul 19;2021:10.17912/micropub.biology.000422. doi: 10.17912/micropub.biology.000422. eCollection 2021. Danlasky, B.M., Panzica, M.P., McNally, K.P., Vargas, E., Bailey, C., Li, W., Gong, T., Fishman, E.S., Jiang, X. and McNally, F.J.  2020. Evidence for anaphase pulling forces during C. elegans meiosis.  Journal of Cell Biology  219 (12): e202005179. Vargas E, McNally KP, Cortes DB, Panzica MT, Danlasky BM, Li Q, Maddox AS, McNally FJ.  2019.  Spherical spindle shape promotes perpendicular cortical orientation by preventing isometric cortical pulling on both spindle poles during C. elegans female meiosis.  Development. 146(20). pii: dev178863. McNally FJ, Roll-Mecak A. 2018.  Microtubule-severing enzymes: From cellular functions to molecular mechanism.  J Cell Biol.  217(12):4057-4069. Nithianantham S, McNally FJ, Al-Bassam J.  2018.  Structural basis for disassembly of katanin heterododecamers.  J Biol Chem. 293(27):10590-10605. Tags Academic Departments Department of Molecular and Cellular Biology Content by Francis J. McNally Discovering Curiosity: The Cycle of Mentorship with Assistant Professor of Teaching Marina Crowder June 25, 2019 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Mona M. Monfared Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Mona M. Monfared Breadcrumb Home Faculty Mona M. Monfared Position Title Associate Professor of Teaching Molecular and Cellular Biology she/her/hers 530-752-5817 mmmonfared@ucdavis.edu Google Scholar ORCID (0000-0002-8057-8288) 109 Briggs Hall Bio Research Interests My research interests overlap with my teaching goal of creating a student centered classroom that is inclusive and promotes critical thinking. I have used my classroom as a laboratory to test ideas and learn more about student perspectives and experiences. Promoting writing in a large STEM class Most people would agree that being able to communicate in writing is an essential part of any career. However, students rarely have the opportunity to write in upper division lecture based courses in biology. Writing apprehension on behalf of students and logistical difficulties on behalf of the instructor are two large barriers to creating fulfilling and productive writing assignments in a large STEM course. I have always used writing assignments to explore student interests and create context in small lecture based courses and I wanted to see how I could scale up these successful assignments to work in a large upper division biochemistry course. I have worked for many quarters to design and optimize writing assignments in BIS102, a large upper division biochemistry course (200-400 students), using student feedback and other metrics to assess efficacy. In this project, I have explored peer feedback, peer grading, expert-led peer feedback, and many aspects of assignment design and seen positive changes in student perspectives on writing as well exam grades. Promoting conceptual thinking and raising awareness of algorithmic thinking in problem solving After teaching biochemistry for several quarters, I noticed that some students approached problem solving in memorizable steps, but did not have conceptual understanding of what those steps accomplished. This approach, often described as algorithmic thinking, is necessary in some contexts but can impede understanding if conceptual understanding is not also sought. I am interested in 1) devising ways to detect when students use algorithmic rather than conceptual approaches to problem solving in biochemistry and 2) create assignments that promote conceptual understanding and raise awareness of when a student is using algorithmic thinking in biochemistry. Part of this project has involved qualitatively coding student answers on written response exams to understand the depth of understanding and how the rubric can be better aligned to the learning objectives. Education and Degree(s) 1998 B.A. in Molecular, Cellular, and Developmental Biology, University of California, Santa Cruz 2009 Ph.D. in Biochemistry and Molecular Biology, University of California, Davis 2009-2013 Postdoc in Molecular Genetics, Plant Gene Expression Center/University of California, Berkeley Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by Mona M. Monfared CBS Faculty Honored by Academic Senate for Undergraduate Teaching March 07, 2023 Mona M. Monfared (0000-0002-8057-8288) ORCID record for Mona M. Monfared. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Kassandra Ori-McKenney Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Kassandra Ori-McKenney Breadcrumb Home Faculty Kassandra Ori-McKenney Position Title Associate Professor Molecular and Cellular Biology kmorimckenney@ucdavis.edu Lab website Google Scholar 3224 Green Hall Bio Research Interests Become enchanted with the neuronal cytoskeleton! The goal of my lab is to understand the complex interplay between microtubule-associated proteins (MAPs) that regulate a number of cytoskeleton-based processes during neuronal development and maintenance. Microtubules are dynamic polymers that not only provide structural support, but also serve as intracellular tracks for dynein and kinesin motors that must efficiently transport cargoes for the establishment and maintenance of cellular organization and function. However, these motors encounter numerous non-enzymatic MAPs on the lattice that can dictate when and where motor progression can occur within a cell. We are only beginning to understand how MAPs in their unaltered states control microtubule dynamics and microtubule-based transport, but MAPs themselves are heavily modified by a handful of kinases whose regulatory effects remain unclear. Our lab seeks to dissect the multiple layers of regulation of microtubule-based processes by studying the biochemical and genetic relationships between kinases, MAPs, and motors both in vivo and in vitro. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Neuroscience Graduate Group Molecular, Cellular, and Integrative Physiology Graduate Group Education and Degree(s) 2005 B.A. in Neuroscience and Behavior, Vassar College 2011 Ph.D. in Biological Sciences, Columbia University Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by Kassandra Ori-McKenney Understanding Healthy Function of Tau, Protein Associated with Dementia August 26, 2022 Gatekeeper of the Cellular Highway: Study Reveals Novel Behaviors of the Alzheimer’s Disease Protein Tau September 02, 2019 Finding a Voice in Science: iBioseminars in Cellular and Molecular Biology Encourages Student Engagement July 09, 2019 Nara Institute of Science and Technology Mini-Symposium to Connect UC Davis and International Scientists February 13, 2019 Pew Scholarship Will Investigate Molecular and Cellular Effects of Traumatic Brain Injury June 14, 2018 Pagination Page 1 Next page Next Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Ted Powers Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Ted Powers Breadcrumb Home Faculty Ted Powers Position Title Executive Associate Dean of Academic Affairs Professor Molecular and Cellular Biology he/him/his 530-752-6778 (executive assistant) tpowers@ucdavis.edu Lab Website Google Scholar ORCID (0000-0002-2007-3819) 210 Green Hall Bio Research Interests Mechanisms that regulate cell growth in the model eukaryote, the budding yeast S. cerevisiae, with emphasis on the TOR (target of rapamycin) signal transduction network. We are particularly interested in how this network regulates the flow of genetic information and cellular behavior in response to intracellular as well as environmental cues. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Education and Degree(s) 1985 B.A. in Biochemistry and Molecular Biology, University of California, Santa Cruz 1992 Ph.D. in Biology, University of California, Santa Cruz Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by Ted Powers Professor Mark Goldman Appointed to the Joel Keizer Endowed Chair in Theoretical and Computational Biology April 24, 2019 Nara Institute of Science and Technology Mini-Symposium to Connect UC Davis and International Scientists February 13, 2019 Ted Powers (0000-0002-2007-3819) ORCID record for Ted Powers. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Gerald Quon Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Gerald Quon Breadcrumb Home Faculty Gerald Quon Position Title Associate Professor Molecular and Cellular Biology 530-752-8263 gquon@ucdavis.edu Lab website Google Scholar ORCID (0000-0002-1716-0153) 4331 Genome and Biomedical Sciences Facility Bio Research Interests We are broadly interested in applying quantitative, computational approaches towards problems in the following areas: Genetics of human disease Models of cell population dynamics Neurogenomics Several projects in the lab focus on building models to predict how genetic variation ultimately impacts disease risk through different layers of biological complexity, including molecules (e.g. gene regulation, gene expression, chromatin accessibility) and cell- and organ-level phenotypes measurable through live-cell imaging or MRIs. Our goals are two-fold: to understand the mechanism of action through which genetic variation modulates our risk of different diseases and traits, as well as to identify actionable therapeutic targets. We have published a number of papers on characterizing the genetics of obesity and Alzheimer's disease, and have more recently focused on psychiatric and other mental disorders. We are developing neural network-based models of population-level behavior of single cells. Sequencing technologies are routinely used to generate high resolution, high dimensional snapshots of individual cells. However, they historically are poor at capturing cell population-level behavior as well as time-varying behavior, because cells are sacrificed before sequencing. On the other hand, imaging-based technologies can be used to observe e.g. transcriptional behavior over time of a limited number of genes. Here we combine imaging-based and sequencing-based methodologies to model how cells interact and influence each other's transcriptome. Shown in the figure above is an illustration of one such project, where we used single cell genomics data on non-malignant cells cultured either alone (S1) or co-cultured with malignant cells (S1 co-cultured with T4-2), to predict that S1 gene regulation of the ERK pathway is disrupted by proximity to T4-2 cells. This is evident both at the gene regulatory network level, as well as through reporter assays of individual genes. Our understanding of the dynamics of molecular events in the cell has been rapidly increasing, thanks to the many ways in which DNA sequencing has been repurposed to study different aspects of gene regulation. The relationship of gene regulation to cellular-level phenotypes and events, however, is poorly understood, in large part because they are hard to jointly measure experimentally. Several projects in the lab aim to bridge this gap by building quantitative neural network-based models to characterize how gene expression and electrophysiological/morphological properties of neurons co-vary, in order to then understand how changes in gene regulation caused by disease also change properties of neurons. Center Affiliations Genome Center Graduate Program Affiliations Integrative Genetics and Genomics Graduate Group Neuroscience Graduate Group Computer Science Graduate Group Graduate Group in Biostatistics Biomedical Engineering Graduate Group Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by Gerald Quon Assistant Professor Gerald Quon Receives NIH New Innovator Award October 05, 2021 High-Definition Biology: NSF Funds Development of Next Generation Computational Tools for Single-Cell Analysis August 28, 2019 Gerald Quon (0000-0002-1716-0153) ORCID record for Gerald Quon. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Lesilee S. Rose Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Lesilee S. Rose Breadcrumb Home Faculty Lesilee S. Rose Position Title Professor Molecular and Cellular Biology she/her/hers 530 754-9884 lsrose@ucdavis.edu Lab website ORCID (0000-0003-4611-9704) 3165 Green Hall Bio Research Interests The main focus of the lab's research is to understand how the orientation of cell division is controlled. In animal cells, the division furrow typically bisects the mitotic spindle. Thus, the cell division plane is determined by the position of the mitotic spindle. Proper division orientation is essential for a number of developmental and homeostatic processes. These include intrinsically specified asymmetric divisions in which a cell divides to produce daughters with different fates at birth. During such divisions the parent cell is polarized for particular cortical or cytoplasmic components; the spindle must align with this axis for division to result in the differential segregation of such components to the daughter cells, which gives them different developmental fates. During extrinsically asymmetric divisions, although the parent cell is not polarized the spindle/division orientation places daughters in different positions and thus different environments, which results in different fates. Both types of asymmetric division are important for generating cell diversity during development, as well as for the ability of adult stem cells to produce a self-renewing stem cell and a daughter that differentiates; asymmetric division also affects the proliferative capacity of some cell types and defects in spindle positioning and polarity have been implicated in cancer. We utilize the model system C. elegans for the majority of our studies, and employ a variety of genetic, molecular and cell biological techniques. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Education and Degree(s) 1986 B.S. in Biology, College of William and Mary 1991 Ph.D. in Molecular Biology, Princeton University Publications Tags Academic Departments Department of Molecular and Cellular Biology Lesilee S. Rose (0000-0003-4611-9704) ORCID record for Lesilee S. Rose. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Daniel A. Starr Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Daniel A. Starr Breadcrumb Home Faculty Daniel A. Starr Position Title Associate Dean of Research Professor Molecular and Cellular Biology 530-754-6083 dastarr@ucdavis.edu Lab website Google Scholar ORCID (0000-0001-7339-6606) Briggs Hall 139 Bio Research Interests There are many examples throughout development where nuclei or other organelles migrate to a new position in the cell. We are recently examining a nuclear migration event where the nucleus must deform to squeeze through a narrow opening. Once the nucleus has migrated to the correct location, there are mechanisms to anchor the nucleus there. Defects in nuclear positioning can lead to developmental defects and diseases such as Lisencephaly and Muscular Dystrophy. However, very little is known about the mechanisms of nuclear positioning. We are using the Nematode Caenorhabditis elegans as a model organism to study how nuclei and other organelles are positioned within a cell. We use imaging, genetic, biochemical, and molecular approaches to study this basic problem in cell biology. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Biophysics Graduate Group Education and Degree(s) 1992 B.A. in Biology, Colby College 1998 Ph.D. in Genetics, Cornell University Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by Daniel A. Starr Meet the 2023-24 Cohort of UC Davis PREP Scholars April 23, 2024 Postdoctoral Researchers Awarded Hartwell Fellowships to Probe Tissue Regeneration and Molecular Roots of Dystonia January 16, 2024 Dan Starr Named New CBS Associate Dean of Research September 29, 2023 UC Davis Researchers Among Successful PREP Scholars Admitted to Campus Graduate Programs September 28, 2021 A Menagerie of Model Organisms May 14, 2019 Pagination Page 1 Next page Next Daniel A. Starr (0000-0001-7339-6606) ORCID record for Daniel A. Starr. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Martine Therrien | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Martine Therrien Breadcrumb Home Faculty Martine Therrien Position Title Assistant Professor Molecular and Cellular Biology she/her 857-300-8277 mtherrien@ucdavis.edu Lab Website Google Scholar ORCID (0000-0003-3150-4052) Center for Neuroscience Bio Research Interests Microglia are the immune cells of the brain parenchyma. They are constantly sensing and responding to the brain environment. Several microglia states have been detected in neurodegenerative diseases, such as Alzheimer’s disease and Amyotrophic Lateral Sclerosis, each with a specific transcriptomic and proteomic signature suggesting essential roles in diseases. Using human stem cell models and single-cell omics, we aim to identify, track and manipulate microglia states to determine how they become awry in disease and their impact on patients’ symptoms. Center Affiliations Center for Neuroscience Education and Degree(s) 2010 B.Sc. in Microbiology and Immunology, McGill University, Montreal, Canada 2012 M.Sc. in Pathology and Cell Biology, University of Montreal, Montreal, Canada 2016 Ph.D. in Pathology and Cell Biology, University of Montreal, Montreal, Canada 2016-2024 Postdoctoral fellow, Broad Institute, Cambridge, MA USA Publications Tags Department of Molecular and Cellular Biology Content by Martine Therrien CBS Welcomes 5 New Faculty in the 2023-24 Year August 07, 2024 Martine Therrien (0000-0003-3150-4052) ORCID record for Martine Therrien. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: October 21, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - David K. Wilson Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team David K. Wilson Breadcrumb Home Faculty David K. Wilson Position Title Professor Molecular and Cellular Biology 530-752-1136 dkwilson@ucdavis.edu 03 Briggs Hall Bio Research Interests Structural biology of enzymes and protein-protein interactions. Projects include 1) protein engineering of enzymes involved in a xylose assimilation (XXX) pathway 2) structure- and combinatorial-based drug design targetting apicomplexan parasitic infection and 3) characterizing the structure and function of WD-repeat domains in protein-protein interaction. Our primary research tool is x-ray crystallography but we usually complement this with biochemical and genetic experiments. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Biophysics Graduate Group Education and Degree(s) 1991 B.A. in Biochemistry, Rice University 1996 Ph.D. in Biochemistry, Baylor College of Medicine Publications Mak WS, Wang XK, Arenas R, Cui Y, Bertolani S, Deng WQ, Tagkopoulos I, Wilson DK, Siegel JB (2020) Discovery, Design, and Structural Characterization of Alkane-Producing Enzymes across the Ferritin-like Superfamily. Biochemistry 59:3834-3843. Tabares-da Rosa S, Wogulis LA, Wogulis MD, Gonzalez-Sapienza G, Wilson, DK. Structure and specificity of several triclocarban-binding single domain camelid antibody fragments (2018) J. Mol. Recognit. e2755 Stoisser T, Brunsteiner M, Wilson DK, Nidetzky B (2016) Conformational flexibility related to enzyme activity: evidence for a dynamic active-site gatekeeper function of Tyr215 in Aerococcus viridans lactate oxidase. Sci. Rep. 6:27892. Stoisser T, Klimacek M, Wilson DK, Nidetzky B (2015) Speeding up product release: a second-sphere contribution from Tyr191 to the reactivity of L-lactate oxidase revealed in crystallographic and kinetic studies of site-directed mutants FEBS J 282:4130-4140. Stoisser T, Rainer D, Leitgeb S, Wilson DK, Nidetzky B. (2014). The Ala95-to-Gly substitution in Aerococcus viridans L-lactate oxidase revisited - structural consequences at the catalytic site and effect on reactivity with O2 and other electron acceptors. FEBS J. 282:562-578. Tags Academic Departments Department of Molecular and Cellular Biology Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Mark Winey | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Mark Winey Breadcrumb Home Faculty Mark Winey Position Title Dean Distinguished Professor Molecular and Cellular Biology 530-752-6778 (executive assistant) mwiney@ucdavis.edu Lab Website Google Scholar ORCID 207 Green Hall Bio Mark Winey became dean of the UC Davis College of Biological Sciences on August 1, 2016. He came to UC Davis following 25 years of teaching, research and leadership at the University of Colorado, Boulder. He is a distinguished biologist, an experienced administrator and a strong advocate of biology education at every level. Dean Winey graduated from Syracuse University with a B.S. in Biology with honors and earned a Ph.D. in Molecular and Cellular Biology at the University of Wisconsin, Madison. Following graduate school, he served as an NIH Postdoctoral Fellow in the Department of Genetics at the University of Washington. In 1991, he joined the faculty at the University of Colorado, Boulder where he eventually attained tenure. From 2012 to 2016, Winey served as the chair of the Department of Molecular, Cellular and Developmental Biology. Winey's research explores the genetics and molecular biology of microtubule organizing centers, which include the cellular structures called centrosomes that are critical for organizing the spindles needed to ensure accurate movement of chromosomes during cell division. Centrosome defects can result in genomic instability that may contribute to the development of cancer as well as to chromosome mis-segregation that can lead to miscarriages. Winey’s academic honors include the distinction of Guggenheim Fellow and Pew Scholar, and he was elected a Fellow of the American Association for the Advancement of Science in 2014. In 2019, Mark was named a Fellow of the American Society for Cell Biology. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Education and Degree(s) 1983 B.S. in Biology, Syracuse University 1988 Ph.D. in Molecular and Cellular Biology, University of Wisconsin, Madison Publications Tags Academic Departments Department of Molecular and Cellular Biology Content by Mark Winey From the Dean: New Faces, Major Milestones October 10, 2024 Donor-Supported Research Brings Experiential Learning to Summer Quarters October 03, 2024 From the Dean: A Year of Celebration June 14, 2024 From the Dean: Bright, Sunny and Full of Life May 08, 2024 From the Dean: Spring Has Sprung April 03, 2024 Pagination Page 1 Next page Next Mark Winey (0000-0002-9028-9033) ORCID record for Mark Winey. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 27, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Yale E. Goldman | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Yale E. Goldman Breadcrumb Home Faculty Yale E. Goldman Position Title Adjunct Professor Molecular and Cellular Biology Pharmacology 610-529-8931 yegoldman@ucdavis.edu 3253 Green Hall Bio Research Interests My lab studies molecular motors, protein synthesis on the ribosome and RNA helicases using novel biophysical techniques. We develop new methods particularly in single molecule biophysics, such as fluorescent particle tracking, high-speed optical traps, and polarized total internal reflection fluorescence (polTIRF) microscopy to quantify the structural dynamics of rotational motions of the target proteins and to delineate the mechanisms of enzymatic and energy transformation reactions. Education and Degree(s) 1969 B.S. in Electrical Engineering, Northwestern University 1975 M.D., University of Pennsylvania 1975 Ph.D. in Physiology, University of Pennsylvania 1975 - 1979, Postdoctoral Fellow with Andrew F. Huxley and Robert M. Simmons, University College London Publications Tags Department of Molecular and Cellular Biology Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 2, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "G.W. Gant Luxton | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team G.W. Gant Luxton Breadcrumb Home Faculty G.W. Gant Luxton Position Title Associate Adjunct Professor Molecular and Cellular Biology he/him/his 530-754-6083 ggluxton@ucdavis.edu Lab website Google Scholar 102H Briggs Hall Bio Research Interests My research aims to unravel the mechanisms and functions of the physical coupling between the nucleus and the cytoskeleton, with a particular focus on the linker of nucleoskeleton and cytoskeleton (LINC) complex. This critical nuclear envelope-spanning structure integrates the nucleus with the cytoskeleton and the extracellular environment, impacting various fundamental cellular processes. I investigate how LINC complexes are assembled, how they mediate nuclear migrations, enable mechanotransduction, and control chromatin organization. I employ advanced biochemical, biophysical, and cell biological methods as well as model systems such as Caenorhabditis elegans, mammalian organoids, and Dictyostelium discoideum. My goal is to understand the molecular mechanisms underlying human diseases associated with LINC complex dysfunction, including accelerated aging, dystonia, pancreatic cancer, and neurodegeneration. Graduate Group Affiliations Biophysics Graduate Group Education and Degree(s) 2001 B.A. in Biology, Grinnell College 2005 Ph.D. in Microbiology and Immunology, Northwestern University 2006-2011 Postdoctoral Fellow in Cellular Biology, Columbia University Publications Tags Department of Molecular and Cellular Biology G.W. Gant Luxton (0000-0002-6180-8906) ORCID record for G.W. Gant Luxton. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 2, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm ."
]