[
    "Trish Berger, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Trish Berger, Ph.D. Breadcrumb Home People Faculty Trish Berger, Ph.D. Position Title Distinguished Professor 530-752-1267 tberger@ucdavis.edu 2147 Meyer Hall Bio Education B.A., Biochemistry, University of Kansas (Year Abroad) Physiology and Biochemistry of Farm Animals, University of Reading, England M.S., Animal Science, Purdue University Ph.D., Animal Science, Purdue University Research Interests A long-term focus in our laboratory is mammalian fertilization and the molecules involved in the fertilization process. Research is centered on interactions between sperm and oocyte plasma membrane molecules after sperm have undergone the acrosome reaction since our earlier work demonstrated that this was frequently the limiting step in vivo in subfertile animals. Details of these interactions including receptor/ligand pairings are still largely unknown. Environmental stresses such as elevated ambient temperature affect both the sperm’s ability and the oocyte’s ability to interact with each other at the plasma membrane level. We hypothesize that this is due to decreased/defective synthesis of interacting molecules. A second focus in our laboratory is the regulation of Sertoli cell proliferation. Sertoli cell numbers are a major determinant of postpuberal testis size and sperm production. The number of Sertoli cells is generally believed to be determined prepuberally. We have found that reducing endogenous estrogen in the boars postnatally leads to increased proliferation of Sertoli cells and larger postpuberal testes in the pig. This occurs without altered pituitary hormones in boars and strongly suggests a locally mediated mechanism. The pig is the primary species studied due in part to its importance to US and world food production as well as the availability of large numbers of gametes and comparatively short gestation and prepuberal intervals. In vitro oocyte maturation and fertilization, in vitro bioassays, gene expression (qPCR), immunohistochemistry, gel electrophoresis and western blotting, heterospermic insemination and other in vivo animal trials, CRISPR editing and embryo transfer are techniques used to advance our laboratory research goals. Graduate Groups Animal Biology Courses Taught Physiology of Reproduction (NPB 121/121L) Mammalian Gametogenesis and Fertilization (MCP 222) Stress and Reproduction (ANS 160A&B) People Research Staff Barbara Jean S. Nitta Recent Graduate Students Tana Almand, M.S. Jennifer Jankovitz, M.S. Kimberley Miller, M.S. Simin Tang, M.S. Javier Morales, Ph.D. Kelly Zacanti, Ph.D. Maria Carolina Zimara M.S. Selected Publications Berger T, Guerrero V, Boeldt R, Legacki E, Roberts M, and Conley AJ. 2024. Development of porcine accessory sex glands. Animals, 14(3): 462. Park I, Navarro-Serna S, Pinho R, Berger T, Maga EA, Gadea J, Kim SK, Ross PJ. 2024. Electroporation of CRISPR/Cas9 targeting neurogenin 3 (NGN3) in porcine embryos and its effects on mosaicism and off-target effects by next generation sequencing (NGS). Re: GEN Open, 4: 9-20. Noto V, Nitta-Oda BJ, Berger T. 2024. Gene expression in porcine bulbourethral glands. Animals, 14(7): 1115. Zacanti K, Park I, McNabb BR, Urbano TM, Maga EA, Rowe JD, Hennig SL, Ross P, and Berger T. 2023. Gender disparity in survival of early porcine fetuses due to altered androgen receptor or associated U2 spliceosome component. Scientific Reports, 13: 15072. Kang S and Berger T. 2023. Macrophages in juvenile pig testis: Link with increase in Sertoli cells induced by estradiol suppression. Reproduction in Domestic Animals, 58: 564-568. Berger T, Vanselow J, Conley A, Almand TJ, and Nitta-Oda BS. 2022. Multifaceted Epigenetic Regulation of Porcine Testicular Aromatase. Molecular and Cellular Endocrinology, 541: 111526. Conley AJ, Berger T, Arias del Razo R, Cotterman RF, Sahagún E, Goetze LR, Jacob S, Weinstein TAR, Dufek ME,Mendoza SP, and Bales KL. 2022.The Onset of Puberty in Colony- housed Male and Female Titi Monkeys (Plecturocebus cupreus): Possible Effects of Oxytocin Treatment during Peri-adolescent Development. Hormones and Behavior, 142(105157). Katleba K, Legacki E, and Berger T. 2022. Expression of CSF1, AR, and SRD5A2 during postnatal development of the boar reproductive tract. Animals, 12: 2167. Berger, T., Tang, S., Tu, L., Soto, D.A., Conley, A.J. and Nitta-Oda, B., 2021. Changes in testicular gene expression following reduced estradiol synthesis: A complex pathway to increased porcine Sertoli cell proliferation, Mol Cell Endocrinol. 523, 111099. Vanselow, J., Conley, A.J. and Berger, T., 2021. Aromatase and the three little paralogs, Biol Reprod. https://academic.oup.com/biolreprod/advance-article-abstract/doi/10.1093/biolre/ioab112/6294498 Vanselow, J., Conley, A.J., Corbin, C.J. and Berger, T., 2021. Genomic Structure of the Porcine CYP19 Locus and Expression of the CYP19A3 Paralog, Genes (Basel). 12. https://www.mdpi.com/2073-4425/12/4/533 Berger T, Nitta-Oda BJ. 2020. Sertoli cell proliferation in juvenile boars and microRNA. Livestock Science 233:103954. Berger, T, Sidhu P, Tang S, Kucera H. 2019. Are testicular cortisol and WISP2 involved in estrogen-regulated Sertoli cell proliferation? Anim Reprod Sci. 207: 44-51. doi: 10.1016/j.anireprosci.2019.05.014 Kucera H, Puschner B, Conley A, Berger T. 2019. Tissue steroid levels in response to reduced testicular estrogen synthesis in the male pig, Sus scrofa. PLOS One 14(4):e3900215. doi: 10.1371/journal.pone.0215390 Berger T. 2019. Testicular estradiol and the pattern of Sertoli cell proliferation in prepuberalbulls. Theriogenology 136:60-65. doi:10.1016/j.theriogenology.2019.06.031 Hughes JR, Berger T. Regulation of apical blebbing in the porcine epididymis. J Anat. 2018; 232:515-522. Berger T, Nitta-Oda BJ. 2018. Increased testicular estradiol during the neonatal interval reduces Sertoli cell numbers. Anim Reprod Sci. 189:146-151. Legacki E, Conley AJ, Nitta-Oda BJ, Berger T. Porcine Sertoli Cell Proliferation after Androgen Receptor Inactivation. Biology of Reproduction 2015; 92:93. Katleba K, Legacki EL, Conley AJ, Berger T. Steroid regulation of early postnatal development in the corpus epididymidis of pigs. Journal of Endocrinology 2015; http://dx.doi.org/10.1530/JOE-15-0001. Tanphaichitr N, Kongmanas K, Kruevaisayawan H, Saewu A, Sugeng C, Fernandes J, Souda P, Angel JB, Faull KF, Aitken RJ, Whitelegge J, Hardy D, Berger T, Baker M. Remodeling of the plasma membrane in preparation for sperm-egg recognition: roles of acrosomal proteins. Asian Journal of Andrology 2015; 17(4): 1-9. Hughes JR, Berger T. Development of apical blebbing in the boar epididymis. PLOS One 2015; 10(5):e0126848, 2015. Berger T, Conley AJ. Reduced endogenous estrogen and hemicastration interact synergistically to increase porcine Sertoli cell proliferation. Biology of Reproduction 2014. Berger T, Conley AJ. Reducing endogenous estrogen during prepuberal life does not affect boar libido or sperm fertilizing potential. Theriogenology 2014, 82: 627-35. Zamaratskaia G, Berger T. Skatole metabolism in the pigs with reduced testicular oestrogen synthesis. Reproduction in Domestic Animals 2014; 49(2): 302-305. Berger T, Conley AJ, Van Klompenberg M, Roser JF, Hovey RC. Increased testicular Sertoli cell population induced by an estrogen receptor antagonist. Molecular and Cellular Endocrinology 2013; 366: 53-58. Kao E, Villalon R, Ribeiro S, Berger T. Role for endogenous estrogen in prepubertal Sertoli cell maturation. Anim Reprod Sci 2012; 135:106-112. Berger T, Kentfield L, Roser JF, Conley A. Stimulation of Sertoli cell proliferation: defining the response interval to an inhibitor of estrogen synthesis in the boar. Reproduction 2012; 143: 523-529. Conley AJ, Corbin CJ, Thomas JL, Gee NA, Lasley BL, Moeller BC, Stanley SD, Berger T. Costs and consequences of cellular compartmentalization and substrate competition among human enzymes involved in androgen and estrogen synthesis. Biology of Reproduction 2012; 86: (1) 1-8. Berger T, McCarthy M, Pearl CA, At-Taras E, Roser JF, Conley A. Reducing endogenous estrogens during the neonatal and juvenile periods affects reproductive tract development and sperm production in postpuberal boars. Anim Reprod Sci 2007. At-Taras EE, Berger T, McCarthy MJ, Conley AJ, Nitta-Oda BJ, Roser JF. Reducing estrogen synthesis in developing boars increases testis size and total sperm production. J Androl 2006; 27: 552-559. Berger T, McCarthy M, Pearl CA, At-Taras E, Roser JF, Conley A. Reducing endogenous estrogens during the neonatal and juvenile periods affects reproductive tract development and sperm production in postpuberal boars. Anim Reprod Sci 2007 Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: June 18, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Richard Blatchford, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Richard Blatchford, Ph.D. Breadcrumb Home People Faculty Richard Blatchford, Ph.D. Position Title Associate Specialist in Cooperative Extension: Small to Industry Scale Poultry 530-752-8763 rablatchford@ucdavis.edu 2121 Meyer Hall Bio Education B.S., Hiram College, (Psychobiology) M.A., University of California Davis, (Avian Science) Ph.D., University of California Davis, (Animal Behavior) Research Interests My research focus is on the husbandry, behavior, and welfare of small to large scale poultry production. I am particularly interested in understanding the challenges facing small scale and backyard poultry flocks as well as the impacts of housing systems on poultry health and welfare on large scale facilities. I am also interested in developing on farm assessment tools for producers to monitor the health and welfare of their own flocks. Graduate Groups Animal Biology Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: July 6, 2022 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Hao Cheng, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Hao Cheng, Ph.D. Breadcrumb Home People Faculty Hao Cheng, Ph.D. Position Title Associate Professor 530-752-8163 qtlcheng@ucdavis.edu Lab Website 2239 Meyer Hall Bio Education B.S., China Agricultural University, 2011 (Genetics) Ph.D., Iowa State University, 2017 (Genetics and Statistics (co-major)) Research Interests My research interests are broadly involved in the development of statistical and computational methods for the (genetic) improvement of populations through more accurate, efficient, and biologically meaningful analysis. I have focused on the use of phenomics, genomics, pedigree and other sources of big data in various species to better predict desired traits. These endeavours include theoretical aspects of quantitative genetics including statistical models and computational algorithms (e.g., genomic prediction; genome-wide association studies), the development of software tools to apply these methods to real-life large phenomic and genomic data, and the application of the software to data sets in routine analysis for a wide range of traits in various species. Graduate Groups Biostatistics Integrative Genetics and Genomics Animal Biology Courses Taught Genetics and Animal Breeding (ANG 107) Applied Statistics in Agricultural Science (PLS 120) Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: July 6, 2023 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Mark Cooper, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Mark Cooper, Ph.D. Breadcrumb Home People Faculty Mark Cooper, Ph.D. Position Title Assistant Professor Department of Human Ecology 530-752-3580 mhcooper@ucdavis.edu 1221 Meyer Hall, 1335 Hart Hall Bio Research Interests: I am a geographer and interdisciplinary social scientist focused on climate change, agriculture, and the environment.  My research draws on and engages political ecology, geographical political economy and economic geography, science and technology studies, applied ethics, critical policy studies, cultural economy, environmental sociology, and animal studies. I employ a variety of methods and approaches in my research. including participant observation, interviews, survey research, and document analysis.  My work consciously engages social theory and aims to advance and refine its use in empirical and theoretical practice. My current research interests are concentrated around the following four issues: - The political economy of decarbonization and climate risk. - Policy, politics, and programs for greenhouse gas mitigation and climate change adaptation in agriculture. - The geography of field-based scientific research and the role of space, site, and scale in scientific research. - Metrics and measurement in the valuation of animals and the governance of animal welfare. Current Research Projects: California Climate Action Research Initiative, Climate Action 2023 Seed Awards. \"A fusion outlook product for predicting climate-water variation toward efficient decision making.\" Lead Investigator: Isabella Velicogna (UC Irvine). Robert Wood Johnson Foundation, Policies to Build and Sustain Economic Security and Wealth for Families and Communities of Color. \"Can California and Federal Racial Equity Policies Affect Disparities in Rural Land Ownership? A Participatory Evaluation of Reparations and Investment.\" Lead Investigators: Mark H. Cooper and Bettina Ng'weno (African American & African Studies). UC Davis Global Affairs, UC Chile–UC Davis Seed Grant. \"COVID-19 and food system resilience in Polynesia: Lessons from Rapa Nui.\" Lead Investigators: Mark H. Cooper and Jonathan Barton (Pontificia Universidad Católica de Chile). US Department of Agriculture, NIFA Agriculture and Food Research Initiative. \"Multifaceted pathways to climate-smart agriculture through integrated participatory program development and delivery.\" Lead Investigator: Tapan Pathak (UC Merced). Professional Biography: Before coming to UC Davis I was a Postdoctoral Researcher in Political Science at Lund University, and a Mellon Postdoctoral Fellow in Environmental Science and Policy at the College of William & Mary.  I completed my Ph.D. in Geography at the University of Wisconsin-Madison.  I also have a M.S. in Sociology from the University of Wisconsin-Madison, a Postgraduate Diploma in History from the University of Otago, and a Bachelor of Arts (with Distinction) in History (Honors) and Political Science from the University of Kansas. Graduate Program Affiliations: - Geography Graduate Group (M.S. / Ph.D.) - Community Development Graduate Group (M.S.) - Animal Biology Graduate Group (M.S. / Ph.D.) - International Agricultural Development Graduate Group (M.S) - Science and Technology Studies Graduate Program (Ph.D. designated emphasis) Graduate Students: I am not currently accepting new graduate students. Selected Publications: Bulkeley, H., Cooper, M.H., and Stripple, J. 2018. Climate’s New Governance. In A Research Agenda for Global Environmental Politics, 137-148, Dauvergne, P. and Alger, J. eds. Edward Elgar. Cooper, M.H. 2017. Open up and say “baa”: examining the stomachs of ruminant livestock and the real subsumption of nature. Society & Natural Resources 30: 812-828. Cooper, M.H. 2015. Measure for measure? Commensuration, commodification, and metrology in emissions trading markets. Environment and Planning A 47: 1787-1804. Rosin, C. and Cooper, M.H. 2015. Mitigating greenhouse gas emissions from livestock: complications, implications, and new political ecologies. In Political Ecologies of Meat, 315-328, Emel, J. and Neo, H. eds. Routledge. Cooper, M.H. and Rosin, C. 2014. Absolving the sins of emission: The politics of regulating agricultural greenhouse gas emissions in New Zealand. Journal of Rural Studies 36: 391-400. Cooper, M.H., Boston, J., and Bright, J. 2013. Policy challenges for livestock emissions abatement: Lessons from the New Zealand experience. Climate Policy 13: 110-133. Burton, R.J.F., Peoples, S., and Cooper, M.H. 2012. Building ‘cowshed cultures’: A cultural perspective on the promotion of animal welfare in dairy farms. Journal of Rural Studies 28: 174-187. Cooper, M.H. 2011. Markets and myopia beyond finance: Emissions trading and the promise of market-based environmental governance. Dialogues in Human Geography 1 (1): 38-41. Campbell, H., Burton, R., Cooper, M., Henry, M., Le Heron, E., Le Heron, R., Lewis, N., Pawson, E., Perkins, H., Roche, M., Rosin, C., and White, T. 2009. From Agricultural science to ‘biological economies’? New Zealand Journal of Agricultural Research 52: 91-97. Cooper, M.H. 2009. Commercialization of the university and problem choice by academic biological scientists. Science, Technology, and Human Values 34: 629-653. Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: March 1, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Anna Denicol, D.V.M., M.P.V.M., Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Anna Denicol, D.V.M., M.P.V.M., Ph.D. Breadcrumb Home People Faculty Anna Denicol, D.V.M., M.P.V.M., Ph.D. Position Title Associate Professor 352-665-1909 acdenicol@ucdavis.edu Google Scholar Lab Website 2201 Meyer Hall Bio Education D.V.M., Federal University of Rio Grande do Sul, Brazil, 2003 M.P.V.M., University of California, Davis, 2009 (Master of Preventive Veterinary Medicine) Ph.D., University of Florida, 2014 (Animal Molecular and Cellular Biology) Research Interests Female gametes, or oocytes, develop during fetal life and must remain viable for a long period of time to ensure proper reproduction during a female’s lifespan. However, the precise mechanisms regulating fetal oogenesis and development of early stage follicles (i.e., preantral follicles) in the ovary remain largely elusive in most mammalian species. The recent derivation of bovine embryonic stem cells (bESC) presents a unique opportunity to recreate bovine oogenesis and folliculogenesis in vitro, allowing the study of events that have otherwise been difficult to unravel. Our research focuses on ovarian biology and regulation of follicle development. We combine culture of bESCs, preantral follicles isolated or in situ within the ovarian cortex, and granulosa cells to encompass the different stages of oocyte and follicle development and help unravel local, systemic and environmental mechanisms that regulate fertility. As heat stress is recognized as one of the main causes of infertility in cattle, a second and equally important focus of the Denicol Lab has been the investigation of genetic selection of dairy cows for heat tolerance via introduction of the SLICK1 mutation. As reproductive health is a central component of overall health, the ultimate goal of our research is to improve reproductive success and assisted reproductive technologies to benefit animal agriculture, wildlife conservation, and human health. Graduate Groups Animal Biology (ABGG) Molecular, Cellular and Integrative Physiology (MCIP) Selected Publications Google Scholar Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: July 6, 2023 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Edward DePeters, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Edward DePeters, Ph.D. Breadcrumb Home People Faculty Edward DePeters, Ph.D. Position Title Distinguished Professor 530-752-1263 ejdepeters@ucdavis.edu 2149 Meyer Hall Bio Spotlight Why Milk? Research Interests Ruminant nutrition of dairy cattle; mammary gland synthesis of milk protein and fat; nutrient digestion, absorption, and metabolism; evaluation of by-product feedstuffs and forage quality. Graduate Groups Animal Biology Nutritional Biology Courses Taught Domestic Animal Production (ANS 041) Domestic Animal Production Laboratory (ANS 041L) Dairy Cattle Production (ANS 146) Animal Feeds and Nutrition (NUT 115) Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: May 8, 2023 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Jackson Gross, M.S.P.H., Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Jackson Gross, M.S.P.H., Ph.D. Breadcrumb UC Davis Department of Animal Science Extension Jackson Gross, M.S.P.H., Ph.D. Position Title Cooperative Extension Aquaculture Specialist 530-752-2978 jagross@ucdavis.edu Lab Website 2117 Meyer Hall Bio Education B.S., San Diego State University 1999 (Biology, Zoology Emphasis) M.S., San Diego State University 2004 (Public Health, Toxicology Emphasis) PhD., University of Wisconsin-Madison 2006 (Animal Sciences, Endocrine and Reproductive Physiology Minor) Research Interests The driving force in my current research program is to be at the forefront of environmental and production sustainability and ecological integrity. To achieve this vision my research is focused into three distinct, yet overlapping applied research themes; (1) Aquaculture, (2) Invasion Biology and (3) Environmental/Ecological Toxicology. This research usually addresses data gaps and provides scientific solutions, determined through rigorous experimentation, meeting the immediate biological and engineering needs of the aquaculture industry and natural resource community. My research is historically a mix of laboratory and field experimentation. However, there are many times where the research is not exclusively one or the other, but instead, a blend where controlled laboratory experimentation is brought into the field. Other areas of interest include aquaponic production systems. More specific examples include: Conducting reproductive and developmental biology studies to improve fish and bivalve culture, humane harvest of fish, habitat utilization, and water quality. Future research will also focus on recirculating aquaculture and aquaponics systems for finfish and vegetable production. Developing technologies and strategies for the control of aquatic invasive and nuisance species, with the goal of conserving biodiversity in aquatic ecosystems. Research explores traditional and novel physical, biological, and chemical approaches, addressing susceptible life history stages of target species and examining unintended effects on non-target species. Evaluating environmental stressors as factors that compromise ecological integrity and animal health. One of the areas I have significant interest in is the effects of anthropogenic sound on aquatic resources. Selected Publications Arthur N. Popper*; Jackson A. Gross*; Thomas J. Carlson; John Skalski; John V. Young; Anthony D. Hawkins; David Zeddies. (2016), Effects of Exposure to the Sound from Seismic Airguns on Pallid Sturgeon and Paddlefish PLoS ONE 11(8): e0159486. doi:10.1371/journal.pone.0159486 Alecia Stewart-Malone, Michael Misamore, Siri Wilmoth, Alejandro Reyes, Wai Hing Wong, Jackson Gross. (2015), The effect of UV-C exposure on larval survival of the dreissenid quagga mussel. PLOS one doi: 10.1371/journal.pone.0133039 Jackson Gross*, Bahram Farokhkish, Mathew Cornacione, Steven Shaw, Phong Nguyen, and Theodore B. Henry (2015), Potential use of direct current electric fields to eradicate Rainbow Trout Oncorhynchus mykiss embryos from freshwater ecosystems, North American Journal of Fisheries Management Volume 35, Issue 5: 871-879 doi:10.1080/02755947.2015.1059910 Tristany L. Wagner, Cynthia D. Cooper, Jackson A. Gross, Allison B. Coffin (2015), The effect of seismic waterguns on the inner ears of round goby. Journal of Great Lakes Research. doi:10.1016/j.jglr.2015.08.012 Joe M. Caffrey, Jan-Robert Baars, Jenny H. Barbour, Pieter Boets, Philip Boon, Keith Davenport, Jaimie T.A. Dick, John Early, Lennart Edsman, Cathal Gallagher, Jackson Gross, et al. (2014), Tackling Invasive Alien Species in Europe: the top 20 issues, Management of Biological Invasions Volume 5, Issue 1: 1–20. doi: http://dx.doi.org/10.3391/mbi.2014.5.1.01 Mark Abbey-Lambertz, Andrew Ray, Megan Layhee, Christine Densmore, Adam Sepulveda, Jackson Gross, and Barnaby Watten (2014), Suppressing Bullfrog Larvae with Carbon Dioxide. Journal of Herpetology Vol. 48, Issue 1, 59-66 doi: 10.1670/12-126 Layhee M, Yoshioka M, Farokhkish B, Gross JA, Sepulveda AJ. (2014), Toxicity of a traditional molluscicide to Asian clam veligers. Journal of Fish and Wildlife Management 5(1):141–145; e1944-687X. doi: 10.3996/042013-JFWM-032 Jackson A. Gross*, Kathryn M. Irvine, Siri Wilmoth, Tristany L. Wagner, Patrick A. Shields, and Jeffrey R. Fox, (2013), The Effects of Pulse Pressure from Seismic Water Gun Technology on Northern Pike Transactions of the American Fisheries Society 142:1335–1346 Sepulveda, Adam, Andrew Ray, Robert Al-Chokhachy, Clint Muhlfeld, Robert Gresswell, Jackson Gross and Jeff Kershner. (2012), Aquatic Invasive Species: Lessons from Cancer Research . American Scientist. 100 (234-242) Gross, J. A.*, Johnson, P.T.J., Prahl, L. K., and Karasov, W.H. (2009), Critical period for effects of chronic cadmium exposure on growth and development in northern leopard frog (Rana pipiens) tadpoles. Environmental Toxicology and Chemistry. 28:1227-1232 Johnson, P. T. J., Chase, J. M., Dosch, K. L., Hartson, R. B, Gross, J. A.,Larson, D., Sutherland, D. R. and S. R. Carpenter. (2007), Aquatic eutrophication promotes pathogenic disease in amphibians. Proceedings of the National Academy of Science 104 (40):15781-15786 Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: March 24, 2021 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Timothy Hackmann, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Timothy Hackmann, Ph.D. Breadcrumb Home People Faculty Timothy Hackmann, Ph.D. Position Title Associate Professor, Ruminant Nutrition tjhackmann@ucdavis.edu Hackmann Lab 2207 Meyer Hall Bio Education B.S., Biological Sciences, University of Missouri, Columbia, MO, 2006 M.S., Animal Science, University of Missouri, Columbia, MO, 2008 Ph.D., Nutrition, The Ohio State University, Columbus, OH , 2013 Research Interests Improving nutrition of ruminants through study of the microbes of the rumen; increasing supply of microbial protein available to animal digestion; discovering biochemical pathways that microbes use to ferment carbohydrates in feed. Graduate Groups Animal Biology For more information about research, courses, publications, and people, please visit Hackmann Lab at https://hackmannlab.faculty.ucdavis.edu/ . Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 12, 2023 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Matthias Hess, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Matthias Hess, Ph.D. Breadcrumb Home People Faculty Matthias Hess, Ph.D. Position Title Associate Professor Hellman Fellow 530-752-8809 mhess@ucdavis.edu Lab Website 2123 Meyer Hall Bio Education B.A., Microbial Ecology & Botany, University of Konstanz, Konstanz, Germany – 1999. M.S., Microbiology & Limnology, University of Konstanz, Konstanz, Germany – 2004. Ph.D., Microbiology & Biotechnology, Hamburg University of Technology, Hamburg, Germany – 2007. Previous Employments 2014 – 2021: Assistant Professor; University of California, Davis, CA 2011 – 2018: Adjunct Scientist; DOE Joint Genome Institute, Walnut Creek, CA 2011 – 2014: Assistant Professor; Washington State University, Richland, WA 2011 – 2014: Senior Scientist; DOE Pacific Northwest National Laboratory, Richland, WA 2007 – 2010: Postdoctoral Fellow; DOE Lawrence Berkeley National Laboratory Research Interests Research Area 1 - Animal Health/Animal Microbiology: Microbes play a key part in the health and productivity of animals. The long-term goal of our research is to enhance our understanding of microbe-microbe and microbe-host interaction to ensure the well-being of the host organisms. Our current main focus is the microbiome of ruminants. Research Area 2 - Climate Change/Carbon and Nitrogen Cycling: Microbial communities associated with agricultural systems are major sources of greenhouse gases such as N₂O and CO₂. The Hess Lab studies how microbial communities in these systems can be manipulated to reduce greenhouse gas emission. Currently we are developing strategies to mitigate greenhouse gas emission from ruminants, manure, and agricultural soils. Research Area 3 - Natural Products: Microorganisms are a potent source of fine and bulk chemicals. In the past, discovery and reconstruction of the genes and pathways involved in the synthesis of the final product was hindered by the recalcitrance of most microbes (~95-99% of all microbes) to isolation and cultivation. In our Lab we utilize a combination of different cultivation-independent approaches (e.g. single-cell technologies, phylogenomics, metagenomics, metatranscriptomics, metaproteomics and metametabolomics) to overcome this recalcitrance to cultivation. Recently we have been screening microbial communities from diverse ecosystems for carbohydrate and hydrocarbon active enzymes and for microbial products that have antimicrobial activity. For a full description of the work conducted in the Hess lab, please visit the Hess Lab website Selected Publications Oyama L, Olleik H, Teixeira AC, Guidini M, Pickup J, Hui B, Vidal N, Cookson A, Vallin H, Wilkinson T, Bazzolli D, Richards J, Wootton M, Mikut R, Hilpert K,  Maresca M, Perrier J, Hess M , Mantovani H, Fernandez-Fuentes N, Creevey C, and Huws S. In silico identification of two peptides with antibacterial activity against multidrug-resistant Staphylococcus aureus . npj Biofilms and Microbiomes. 2022. doi: 10.1038/s41522-022-00320-0. Nalla K, Kumar N, Dhillon HS, Kanade SR, Rokana N, Hess M , and Puniya AK. Impact of Probiotics on Dairy Production Efficiency . Frontiers in Systems Microbiology . 2022. doi:10.3389/fmicb.2022.805963 Hess M , Paul SS, Puniya AK, van der Giezen M, Shaw C, Edwards JE, Fliegerova KO. Anaerobic fungi: past, present and future . Frontiers in Microbiology . 2020. doi:10.3389/fmicb.2020.584893. Hagen LH, Brooke CG, Shaw C, Norbeck AD, Piao H, Arntzen MØ, Brewer H, Copeland A, Isern N, Shukla A, Roux S, Lombard V, Henrissat B, O’Malley MA, Grigoriev IV, Tringe S, Mackie R, Pasa-Tolic L, Pope PB, Hess M . Proteome specialization of anaerobic fungi during ruminal degradation of recalcitrant plant fiber. ISMEJ . 2020. doi:10.1038/s41396-020-00769-x. Brooke C, Roque BM, Shaw C, Najafi N, Gonzalez M, Pfefferlen A, DeAnda V, Ginsburg DW, Harden MC, Nuzhdin SV, Salwen J, Kebreab E & Hess M . Methane Reduction Potential of Two Pacific Coast Macroalgae During in-vitro Ruminant Fermentation . Frontiers in Marine Science . 2020. doi: 10.3389/fmars.2020.00561. Hess M , Sczyrba S, Egan R, Kim TW, Chokhawala H, Schroth G, Luo S, Clark DS, Chen F, Zhang T, Mackie RI, Pennacchio LA, Tringe SG, Visel A, Woyke T, Wang Z, and Rubin EM., Massive-Scale Metagenomic Discovery of Biomass-Degrading Genes and Genomes from Cow Rumen. Science . 2011; 331(6016):463-7. For the the full list of all publications from the Hess Lab, please visit the Lab website Awards & Honors 2021: Faculty Award for Outstanding Mentorship; University Honors Program; University of California, Davis, CA 2016: Hellman Fellowship; University of California, Davis, CA 2012-2017: Wiley Research Fellowship; Department of Energy Environmental Molecular Sciences Laboratory, Richland, WA Graduate Groups Animal Biology Biological Systems Engineering Microbiology People For a list of current and previous members of the Hess Lab, please visit the Lab website Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: October 16, 2023 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Kristina Horback, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Kristina Horback, Ph.D. Breadcrumb Home People Faculty Kristina Horback, Ph.D. Spotlight on Research Research by Kristina Horback takes a closer look at the role personality plays in animal welfare. More Position Title Associate Professor 530-752-7018 kmhorback@ucdavis.edu Lab Website 2143 Meyer Hall Bio Education B.A., University of California San Diego, 2007 (Psychology) M.A., University of Southern Mississippi, 2011 (Experimental Psychology) Ph.D., University of Southern Mississippi, 2012 (Experimental Psychology) Research Interests My ongoing research plan is to investigate whether species-specific personality traits influence how an animal not only copes with stress but also how the animal expresses its internal state, such as pleasure or fear, in order to enhance animal-based measurements of welfare. Knowledge of individual differences in personality may allow animal caretakers to gauge social compatibility, customize environmental enrichment, and identify individuals more susceptible or resilient to environment/social stress. Graduate Groups Animal Biology Animal Behavior Selected Publications Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: July 1, 2022 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Russ Hovey, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Russ Hovey, Ph.D. Breadcrumb Home People Faculty Russ Hovey, Ph.D. Position Title Professor 530-752-1682 rchovey@ucdavis.edu Lab Website Facebook 2145 Meyer Hall Bio Education B.A., Bachelor of Agricultural Science (Hons), The University of Queensland, Australia 1992. Ph.D., Massey University, New Zealand, 1997. Research Interests Our lab is interested in the molecular and endocrine regulation of mammary gland growth and function as it relates to processes ranging from normal development and lactation to abnormal states such as breast cancer. We are particularly interested in the function of the pituitary and ovarian hormones in these processes and how they interactively regulate both mammary epithelial and stromal cells. We use a variety of approaches from cell systems to whole animal models to study these processes and to resolve the mechanisms underlying across-species differences. Graduate Groups Animal Biology Integrative Genetics and Genomics International Agricultural Development Courses Taught For latest information please visit the Lab Website People For latest information please visit the Lab Website Selected Publications For latest information please visit the Lab Website Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: March 24, 2021 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Elisha Hull, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Elisha  Hull, Ph.D. Breadcrumb Home People Faculty Elisha  Hull, Ph.D. Position Title Associate Adjunct Professor 916-414-6742 jmhull@ucdavis.edu Lab Website 2131A Meyer Hall Bio Education B.S., Biology, Dominican University of California, 1998. M.A., Biology, Sonoma State University, 2002. Ph.D., Ecology, University of California, Davis, 2007. Research Interests My research interests include conservation genetics, avian ecology and migration, and the conservation of rare and endangered species. Using a combination of field research and molecular genetic techniques I have studied numerous species of raptors (red-tailed hawks, red-shouldered hawks, Swainson’s hawks, Galápagos hawks, sharp-shinned hawks, Cooper’s hawks, great gray owls, merlins) primarily at study sites across North America in collaboration with the Golden Gate Raptor Observatory (http://www.ggro.org). In collaboration with the US Fish and Wildlife Service (http://www.fws.gov/sacramento) I am also studying several species of conservation concern including California clapper rails, vernal pool fairy shrimp, callippe silverspot butterflies, Shasta crayfish, and great gray owls. Current research projects include a population genetic analysis of North American subspecies of merlin, demographic monitoring of great gray owls using passive genetic techniques, and acoustic monitoring of California clapper rails Graduate Groups Ecology People Current Graduate Students Emily Abernathy, MS Program, Ecology Graduate Group. Expected Graduation Date: Fall 2017. Ryan Bourbour, MS Program, Avian Sciences Graduate Group. Expected Graduation Date: Fall 2017. Breanna Martinico, MS Program, Avian Sciences Graduate Group. Expected Graduation Date: Fall 2017. Megan Mayo, PhD Program, Ecology Graduate Group. Expected Graduation Date: Fall 2017. Joe Medley, PhD Program, Ecology Graduate Group. Expected Graduation Date: Spring 2017. Shannon Skalos, PhD Program, Ecology Graduate Group. Expected Graduation Date: Spring 2020. Selected Publications Worthington T, J Van Houdt, J Hull, P Osborne, P Kemp. In press. Thermal Refugia and the Survival of Species in Changing Environments: New Evidence from a Nationally Extinct Freshwater Fish. Ecology of Freshwater Fish. M Meek, C Wells, K Tomalty, J Ashander, E Cole, D Gille, B Putman, J Rose, M Savoca, L Yamane, J Hull, D Rogers, E Rosenblum, J Shogren, R Swaisgood, B May. 2016. We should not be afraid to talk about the effects of the fear of failure on conservation. Biological Conservation, 194, 218-219. Casazza M, C Overton, T Bui, J Hull, J Albertson, V Bloom, S Bobzien, J McBroom, M Latta, P Olofson, T Rohmer, S Schwarzbach, D Strong, E Grijalva, J Wood, S Skalos, J Takekawa. 2016. Endangered species management and ecosystem restoration: finding the common ground. Ecology and Society, 21, 19. K Tomalty, A Hull, A Fish, C Briggs, J Hull. 2016. Differential migration and phenology of adult red-tailed hawk migration in California. Journal of Raptor Research, 50, 45-53. Lusardi R, M Stephens, P Moyle, C McGuire. J Hull. 2015. Threat evolution: negative feedbacks between management action and species recovery in threatened trout (Salmonidae). Reviews of Fish Biology and Fisheries DOI 10.1007/s11160-015-9394-x. Bui T, J Takekawa, C Overton, E Schultz, J Hull, M Casazza. 2015. Movement of radio-marked California Ridgeway’s rails and implications for monitoring surveys. Journal of Fish and Wildlife Management, 6, 227-237. Meek M, C Wells, K Tomalty, J Ashander, E Cole, D Gille, B Putnam, J Rose, M Savoca, L Yamane, J Hull, D Rogers, EB Rosenblum, J Shogren, R Swaisgood, B May. 2015. Fear of failure in conservation: the problem and potential solutions to aid conservation of extremely small populations. Biological Conservation, 184, 209-217. M Jasper, A Hull, J Hull, R Sehgal. 2014. Widespread lineage diversity of Leucocytozoon blood parasites in distinct populations of western red-tailed hawks with analysis of infection impact on migration timing. Journal of Ornithology, 155, 767-775. Hull J, A Engilis, J Medley, E Jepsen, H Ernest, J Keane. 2014. A description of a new subspecies of Great Gray Owl in the Sierra Nevada of California. Journal of Raptor Research, 48, 68-77. Hull J, A Fish, C Nikitas, A Hull. 2013. Development of a mechanical lure for use in trapping migrant raptors. Wildlife Society Bulletin. doi: 10.1002/wsb.317. Deiner K, J Hull, B May. 2013. Novel microsatellite loci for assessing the evolutionary genetics of the vernal pool fairy shrimp (Branchinecta lynchi) and other Branchinecta spp. Journal of Fish and Wildlife Management, 4, 134-138. Hull J, S Pitzer, A Fish, H Ernest, A Hull. 2012. Differential migration patterns for five raptor species in central Coastal California. Journal of Raptor Research, 46, 50-56. Bollmer J, J Hull, H Ernest, J Sarasola, P Parker. 2011. Reduced adaptive and neutral variation in the Galápagos Hawk, an island endemic. BMC Evolutionary Biology, 11, 143. doi:10.1186/1471-2148-11-143. Hull J, D Mindell, S Talbot, E Kay, H Hoekstra, H Ernest. 2010. Population structure and plumage polymorphism: The intraspecific evolutionary relationships of a polymorphic raptor, Buteo jamaicensis harlani. BMC Evolutionary Biology, 10, 224. doi:10.1186/1471-2148-10-224. Hull J, A Fish, J Keane, S Mori, B Sacks, A Hull. 2010. Estimation of species identification error: implications for raptor migration counts and trend estimation. Journal of Wildlife Management, 76, 1326-1334. doi: 10.2193/2009-255. Hull J, J Keane, W Savage, E Jepsen, S Godwin, J Shafer, R Gerhardt, C Stermer, H Ernest. 2010. Range-wide genetic differentiation among North American great gray owls (Strix nebulosa) reveals a distinct lineage restricted to the Sierra Nevada, California. Molecular Phylogenetics and Evolution, 56, 212-221. Hull J, J Keane, L Tell, H Ernest. 2010. West Nile virus antibody surveillance in three Sierra Nevada raptors: Spotted Owls, Great Gray Owls, and Northern Goshawks. The Condor, 112, 168-172. Whiteman N, V Dosanjh, R Palma, J Hull, R Kimball, PC Sánchez, P Parker. 2009. Molecular and morphological divergence in a pair of bird species and their ectoparasites. Journal of Parasitology, 95, 1372-1382. Brown S, J Hull, D Updike, S Fain, H Ernest. 2009. Black bear population genetics in California: Signatures of population structure, competitive release and historical translocation. Journal of Mammalogy, 90, 1066-1074. Hull J, H Ernest, J Harley, A Fish, A Hull. 2009. Differential migration between discrete populations of juvenile Red-tailed Hawks (Buteo jamaicensis). Auk, 126, 389-396. Hull J, B Stroble, C Boal, C Dykstra, A Hull, A Irish, A Fish, H Ernest. 2008. Comparative phylogeography and population genetics within Buteo lineatus reveals evidence of distinct evolutionary lineages. Molecular Phylogenetics and Evolution, 49, 988-996. Hull J, W Savage, J Bollmer, R Kimball, N Whiteman, P Parker, and H Ernest. 2008. On the origin of the Galápagos hawk: an examination of phenotypic differentiation and mitochondrial paraphyly. Biological Journal of the Linnean Society, 95, 779-789. Hull J, J Keane, L Tell, and H Ernest. 2008. Development of 37 microsatellite loci for Great Gray Owls (Strix nebulosa) with cross amplification in Spotted Owls (Strix occidentalis) and Barred Owls (Strix varia). Conservation Genetics, 9, 1357-1361. Hull J, R Anderson, M Bradbury, J Estep, and H Ernest. 2008. Population structure and genetic diversity in Swainson’s Hawks (Buteo swainsoni): implications for conservation. Conservation Genetics, 9, 305-316. Hull J, A Hull, B Sacks, J Smith, and H Ernest. 2008. Landscape characteristics influence morphological and genetic differentiation in a widespread raptor (Buteo jamaicensis). Molecular Ecology, 17, 810-824. Pitzer S, J Hull, H Ernest, and A Hull. 2008. Sex determination of three raptor species using morphology and molecular techniques. Journal of Field Ornithology, 79, 71-79. Hull J, W Savage, J Smith, N Murphy, L Cullen, A Hutchins and H Ernest. 2007. Further evidence of hybridization in Buteo: Swainson’s Hawks (Buteo swainsoni) × Red-tailed Hawks (B. jamaicensis) from Alberta and Utah. The Wilson Journal of Ornithology, 119, 579-584. Hull J, D Tufts, JR Topinka, B May, and HB Ernest. 2007. Development of 19 microsatellite loci for Swainson’s Hawks (Buteo swainsoni) and other Buteos. Molecular Ecology Notes, 7, 346-349. Hull J, A Hull, W Reisen, Y Fang, and HB Ernest. 2006. Variation of West Nile Virus antibody prevalence in migrating and wintering hawks in central California. The Condor, 108, 435-439. Hull J and DJ Girman. 2005. Effects of Holocene climate change on the historical demography of migrating Sharp-shinned Hawks (Accipiter striatus velox) in North America. Molecular Ecology, 14, 159-170. Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: February 1, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Ermias Kebreab, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Ermias Kebreab, Ph.D. Breadcrumb Home People Faculty Ermias Kebreab, Ph.D. Spotlight on Research Ermias Kebreab is conducting research with dairy cows to find out if seaweed will reduce methane emissions from cattle. More Position Title Professor and Sesnon Endowed Chair Associate Dean of Global Engagement, CA&ES Director, World Food Center 530-752-5907 ekebreab@ucdavis.edu Lab Website 2111 Meyer Hall Bio Education B.S., Biology, University of Asmara, Eritrea, 1987. M.S., Integrative biology, University of Reading, UK, 1991. Ph.D., Ecological modeling, University of Reading, UK, 1998. Research Interests My current research interests are: Whole system approach to quantifying greenhouse gas emissions in agriculture. Mathematical modeling and mitigation of emissions from animals, manure and soil. Development of energy and nutrient utilization/requirement models in cattle, swine and poultry Sustainable agriculture, in particular animal production in relation to environmental sustainability. Graduate Groups Animal Biology Ecology Courses Taught Mathematical Modeling in Biological Systems (ABG250) Sustainable Animal Agriculture (ANS 112) Enterprise Analysis in Animal Industries (ANS 148) People For current and past lab member bios, please visit the Animal Nutrition & Environment Modeling Applications Laboratory (ANEMAL) website via the links below. Graduate Students Post-Doctoral Research Fellows Visiting Scholars Employees Alumni Selected Publications 2016 Jayasundara, S., J. A. D. R. N. Appuhamy, E. Kebreab and C. Wagner-Riddle. 2016. Methane and nitrous oxide emissions from Canadian dairy farms and mitigation options: An updated review. Can. J. Anim. Sci., 96: 306–331. Caro, D., Kebreab, E. and F. Mitloehner. 2016. Mitigation of enteric methane emissions from global livestock systems through nutrition strategies. Climatic Change, 137:467-480. Yáñez-Ruiz D.R., A. Bannink, J. Dijkstra, E. Kebreab, D.P. Morgavi, P. O´Kiely, C. K. Reynolds, A. Schwarm, K.J. Shingfield, Z. Yu, and A.N. Hristov. 2016. Design, implementation and interpretation of in vitro batch culture experiments to assess enteric methane mitigation in ruminants – a review. Anim. Feed Sci. Technol., 216:1-18. Santiago-Juarez, B., L.E. Moraes, J.A.D.R.N. Appuhamy, W.F. Pellikaan, D.P. Casper, J. Tricarico and E. Kebreab. 2016. Prediction and evaluation of enteric methane emissions from lactating dairy cows using different levels of covariate information. Anim. Prod. Sci. 56: 557-564. Niu, M., J.A.D.R.N. Appuhamy, A. Leytem, R. Dungan and E. Kebreab. 2016. Effect of dietary crude protein and forage contents on enteric methane emissions and nitrogen excretion from dairy cows simultaneously. Anim. Prod. Sci. 56:312-321. Bougouin A, Leytem A, Dijkstra J, Dungan RS, Kebreab E. Nutritional and Environmental Effects on Ammonia Emissions from Dairy Cattle Housing: A Meta-Analysis. J Environ Qual. 2016 Jul;45(4):1123-32. Appuhamy JA, Judy JV, Kebreab E, Kononoff PJ. Prediction of drinking water intake by dairy cows. J Dairy Sci. 2016 Sep;99(9):7191-205. Johnson AC, Reed KF, Kebreab E. Short communication: Evaluation of nitrogen excretion equations from cattle. J Dairy Sci. 2016 Sep;99(9):7669-78. Kebreab E, Liedke A, Caro D, Deimling S, Binder M, Finkbeiner M. Environmental impact of using specialty feed ingredients in swine and poultry production: A life cycle assessment. J Anim Sci. 2016 Jun;94(6):2664-81. Reed KF, Arhonditsis GB, France J, Kebreab E. Technical note: Bayesian calibration of dynamic ruminant nutrition models. J Dairy Sci. 2016 Aug;99(8):6362-70. Appuhamy JA, France J, Kebreab E. Models for predicting enteric methane emissions from dairy cows in North America, Europe, and Australia and New Zealand. Glob Chang Biol. 2016 Sep;22(9):3039-56. Martineau R, Ouellet DR, Kebreab E, Lapierre H. Casein infusion rate influences feed intake differently depending on metabolizable protein balance in dairy cows: A multilevel meta-analysis. J Dairy Sci. 2016 Apr;99(4):2748-61. Lehmann JO, Fadel JG, Mogensen L, Kristensen T, Gaillard C, Kebreab E. Effect of calving interval and parity on milk yield per feeding day in Danish commercial dairy herds. J Dairy Sci. 2016 Jan;99(1):621-33. Alvarez-Fuentes G, Appuhamy JA, Kebreab E. Prediction of phosphorus output in manure and milk by lactating dairy cows. J Dairy Sci. 2016 Jan;99(1):771-82. 2015 Moraes LE, Fadel JG, Castillo AR, Casper DP, Tricarico JM, Kebreab E. Modeling the trade-off between diet costs and methane emissions: A goal programming approach. J Dairy Sci 2015 Aug;98(8):5557-71. Moraes LE, Kebreab E, Strathe AB, Dijkstra J, France J, Casper DP, Fadel JG. Multivariate and univariate analysis of energy balance data from lactating dairy cows. J Dairy Sci 2015;98(6):4012-29. Strathe AV, Strathe AB, Theil PK, Hansen CF, Kebreab E. Determination of protein and amino acid requirements of lactating sows using a population-based factorial approach. Animal 2015:1-10. Reed KF, Moraes LE, Casper DP, Kebreab E. Predicting nitrogen excretion from cattle. J Dairy Sci 2015;98(5):3025-35. Strathe AB, Danfaer A, Jorgensen H, Kebreab E. A dynamic growth model for prediction of nutrient partitioning and manure production in growing-finishing pigs: Model development and evaluation. J Anim Sci 2015;93(3):1061-73. Vaz PG, Kebreab E, Hung SS, Fadel JG, Lee S, Fangue NA. Impact of nutrition and salinity changes on biological performances of green and white sturgeon. PLoS One 2015;10(4):e0122029. Reed, K.F., D.P. Casper, J. France and E. Kebreab. 2015. Prediction of nitrogen efficiency in dairy cattle: a review. CAB Reviews , 10: No. 001, p. 1-12. Lopez S, France J, Odongo NE, McBride RA, Kebreab E, AlZahal O, McBride BW, Dijkstra J. On the analysis of Canadian Holstein dairy cow lactation curves using standard growth functions. J Dairy Sci 2015;98(4):2701-12. Arias, R. A., A. Catrileo, R. Larraín, R. Vera, A. Velásquez, M. Toneatti, J. France, J. Dijkstra and E. Kebreab. 2015. Estimating enteric methane emissions from Chilean beef fattening systems using a mechanistic model. J. Agric. Sci., 153:114–123. 2014 Jordan, N., J. Grossman, P. Lawrence, A. Harmon, W. Dyer, B. Maxwell, K.V. Cadieux, R. Galt, A. Rojas, C. Byker, S. Ahmed, T. Bass, E. Kebreab, V. Singh, T. Michaels, and C. Tzenis. 2014. New Curricula for Undergraduate Food-Systems Education: A Sustainable Agriculture Education Perspective . NACTA Journal, 302-310. Appuhamy JA, Kebreab E, Simon M, Yada R, Milligan LP, France J. Effects of diet and exercise interventions on diabetes risk factors in adults without diabetes: meta-analyses of controlled trials. Diabetol Metab Syndr 2014;6:127. Ellis, J. L., J. Dijkstra, A. Bannink, E. Kebreab, S. Archibeque, C. Benchaar, K. A. Beauchemin, J. D. Nkrumah and J. France. 2014. Improving the prediction of methane production and representation of rumen fermentation for finishing beef cattle within a mechanistic model. Can. J. Anim. Sci. 94: 509-524. Appuhamy, J.A.D.R.N., L.E. Moraes, C. Wagner-Riddle, D.P. Casper J. France, and E. Kebreab. 2014. Development of mathematical models to predict volume and nutrient composition of fresh manure from lactating Holstein cows. Animal Production Science, 54:1927-1938. Moraes, L.E., E. Kebreab, A. B. Strathe, J. France, J. Dijkstra, D.P. Casper, and J.G. Fadel. 2014. Bayesian analysis of energy balance data from growing cattle using parametric and non-parametric modelling. Animal Production Science, 54:2068-2081. Reed, K.F., L.E. Moraes, J.G. Fadel, D.P. Casper, J. Dijkstra, J. France and E. Kebreab. 2014. Prediction of nitrogen use in dairy cattle: a multivariate Bayesian approach. Animal Production Science, 54:1918-1926. Appuhamy JA, Wagner-Riddle C, Casper DP, France J, Kebreab E. Quantifying body water kinetics and fecal and urinary water output from lactating Holstein dairy cows. J Dairy Sci 2014;97(10):6177-95. Bougouin A, Appuhamy JA, Kebreab E, Dijkstra J, Kwakkel RP, France J. Effects of phytase supplementation on phosphorus retention in broilers and layers: a meta-analysis. Poult Sci 2014;93(8):1981-92. Moraes LE, Strathe AB, Fadel JG, Casper DP, Kebreab E. Prediction of enteric methane emissions from cattle. Glob Chang Biol 2014;20(7):2140-8. Hansen AV, Strathe AB, Theil PK, Kebreab E. Energy and nutrient deposition and excretion in the reproducing sow: model development and evaluation. J Anim Sci 2014;92(6):2458-72. Rendón-Huerta, J.A., J. M. Pinos-Rodríguez, J. C. García-López, L. G. Yáñez-Estrada and E. Kebreab. 2014. Trends of greenhouse gas emissions by dairy cattle in México between 1970 and 2010. Anim. Prod. Sci. 54: 292-298. Asgedom, H., M. Tenuta, D. N. Flaten, X. Gao, E. Kebreab. 2014. Nitrous oxide emissions from a clay soil receiving granular urea formulations and dairy manure. Agronomy J. 106:732-744. Hristov AN, Johnson KA, Kebreab E. Livestock methane emissions in the United States. Proc Natl Acad Sci U S A 2014;111(14):E1320. Kebreab, E. 2014. Framework of innovation for a sustainable future in animal agriculture - mini review. CAB Reviews 9(006):1-2. Steenwerth, K. L., A. K. Hodson, A. J. Bloom, M. R. Carter, A. Cattaneo, C. J. Chartres, J. L. Hatfield, K. Henry, J. W. Hopmans, W. R. Horwath, B. M. Jenkins, E. Kebreab, R. Leemans, L. Lipper, M. N. Lubell, S. Msangi, R. Prabhu, M. P. Reynolds, S. S. Solis, W. M. Sischo, M. Springborn, P. Tittonell, S. M. Wheeler, S. J. Vermeulen, E. K. Wollenberg, and L. S. Jarvis. 2014. Climate-smart agriculture global research agenda: scientific basis for action. Agriculture and Food Security 3(11). 2013 Hristov AN, Oh J, Firkins JL, Dijkstra J, Kebreab E, Waghorn G, Makkar HP, Adesogan AT, Yang W, Lee C, Gerber PJ, Henderson B, Tricarico JM. Mitigation of methane and nitrous oxide emissions from animal operations: I. A review of enteric methane mitigation options. J Anim Sci 2013;91(11):5045-69. Hristov AN, Ott T, Tricarico J, Rotz A, Waghorn G, Adesogan A, Dijkstra J, Montes F, Oh J, Kebreab E, Oosting SJ, Gerber PJ, Henderson B, Makkar HP, Firkins JL. Mitigation of methane and nitrous oxide emissions from animal operations: III. A review of animal management mitigation options. J Anim Sci 2013;91(11):5095-113. Kebreab, E., A.V. Hansen and A.B. Leytem. 2013. Feed management practices to reduce manure phosphorus excretion in dairy cattle. Adv. Anim. Biosci. 4 s1:37-41. von Keyserlingk MA, Martin NP, Kebreab E, Knowlton KF, Grant RJ, Stephenson M, Sniffen CJ, Harner JP, 3rd, Wright AD, Smith SI. Invited review: Sustainability of the US dairy industry . J Dairy Sci 2013;96(9):5405-25. France J, Lopez S, Kebreab E, Dijkstra J. Interpreting experimental data on egg production--applications of dynamic differential equations. Poult Sci 2013;92(9):2498-508. Appuhamy JA, Strathe AB, Jayasundara S, Wagner-Riddle C, Dijkstra J, France J, Kebreab E. Anti-methanogenic effects of monensin in dairy and beef cattle: a meta-analysis. J Dairy Sci 2013;96(8):5161-73. Appuhamy JA, Kebreab E, France J. A mathematical model for determining age-specific diabetes incidence and prevalence using body mass index. Ann Epidemiol 2013;23(5):248-54. Dias, R. S., S. López, R. M. Patiño, T. S. Silva, J. C. Silva Filho, D. M. S. S. Vitti, M. R. S. R. Peçanha, E. Kebreab and J. France. 2013. Calcium and phosphorus utilization in growing sheep supplemented with dicalcium phosphate . J. Agric Sci. 151:424-433. Gerber PJ, Hristov AN, Henderson B, Makkar H, Oh J, Lee C, Meinen R, Montes F, Ott T, Firkins J, Rotz A, Dell C, Adesogan AT, Yang WZ, Tricarico JM, Kebreab E, Waghorn G, Dijkstra J, Oosting S. Technical options for the mitigation of direct methane and nitrous oxide emissions from livestock: a review . Animal 2013;7 Suppl 2:220-34. Klop G, Ellis JL, Bannink A, Kebreab E, France J, Dijkstra J. Meta-analysis of factors that affect the utilization efficiency of phosphorus in lactating dairy cows . J Dairy Sci 2013;96(6):3936-49. 2012 Kebreab E, Hansen AV, Strathe AB. Animal production for efficient phosphate utilization: from optimized feed to high efficiency livestock. Curr Opin Biotechnol 2012;23(6):872-7. Strathe, A.B., H. Jørgensen, E. Kebreab and A. Danfær. 2012. Bayesian simultaneous equation models for the analysis of energy intake and partitioning in growing pigs . J. Agric. Sci. 150:764-774. Ellis JL, Dijkstra J, Bannink A, Kebreab E, Hook SE, Archibeque S, France J. Quantifying the effect of monensin dose on the rumen volatile fatty acid profile in high-grain-fed beef cattle. J Anim Sci 2012;90(8):2717-26. Darmani Kuhi, H., E. Kebreab and J. France. 2012. Application of law of diminishing returns to partitioning metabolizable energy and crude protein intake between maintenance and growth in egg type pullets. J. Appl. Poult. Res. 21:540-547. Hansen AV, Strathe AB, Kebreab E, France J, Theil PK. Predicting milk yield and composition in lactating sows: a Bayesian approach. J Anim Sci 2012;90(7):2285-98. Dumas, A., López, S., Kebreab, E., Gendron, M., Thornley, J.H.M. & France, J. (2012) Selection of growth functions for describing length-at-age relationships in fish species displaying different life history traits: unexpected alternatives to the von Bertalanffy equation and advantages of a pluralistic statistical approach . CAB Reviews 7, No 038:1-14. Legesse, G., J. A. Small, S. L. Scott, E. Kebreab, G.H. Crow, H.C. Block, C.D. Robins, and W.P. McCaughey. 2012. Effects of alternative summer-pasture and winter-feeding systems for beef cows on cow/calf productivity. Can. J. Anim. Sci. 92: 89-102. Ellis JL, Dijkstra J, France J, Parsons AJ, Edwards GR, Rasmussen S, Kebreab E, Bannink A. Effect of high-sugar grasses on methane emissions simulated using a dynamic model. J Dairy Sci 2012;95(1):272-85. Dijkstra, J., J.L. Ellis, E. Kebreab, A.B. Strathe, S. Lopez, J. France and A. Bannink 2012. Ruminal pH regulation and nutritional consequences of low pH. Anim. Feed Sci. Tech. 172:22-33. 2011 Dias RS, Lopez S, Patino RM, Silva TS, Silva Filho JC, Vitti DM, Pecanha MR, Kebreab E, France J. An extended model of phosphorus metabolism in growing ruminants. J Anim Sci 2011;89(12):4151-62. Tomich, T.P., S. Brodt, H. Ferris, R. Galt, W. R. Horwath, E. Kebreab, J.H.J. Leveau, D. Liptzin, M. Lubell, P. Merel, R.W. Michelmore, T. Rosenstock, K. Scow, J. Six, N. Williams and L. Yang. 2011. Agroecology: A Review from a Global-Change Perspective . Ann. Rev. Environ. Resources 36:193-222. Neijat M, House JD, Guenter W, Kebreab E. Calcium and phosphorus dynamics in commercial laying hens housed in conventional or enriched cage systems. Poult Sci 2011;90(10):2383-96. Kebreab E, Strathe AB, Yitbarek A, Nyachoti CM, Dijkstra J, Lopez S, France J. Modeling the efficiency of phosphorus utilization in growing pigs. J Anim Sci 2011;89(9):2774-81. Cooprider KL, Mitloehner FM, Famula TR, Kebreab E, Zhao Y, Van Eenennaam AL. Feedlot efficiency implications on greenhouse gas emissions and sustainability. J Anim Sci 2011;89(8):2643-56. Modaresi J, Fathi Nasri MH, Rashidi L, Dayani O, Kebreab E. Short communication: effects of supplementation with pomegranate seed pulp on concentrations of conjugated linoleic acid and punicic acid in goat milk. J Dairy Sci 2011;94(8):4075-80. Asgedom, H. and E. Kebreab. 2011. Beneficial management practices and mitigation of greenhouse gas emissions in the Canadian Prairie agriculture: a review. Agronomy Sust. Developm. 31:433–451. Alemu, A.W., K. Ominski and E. Kebreab. 2011. Estimation of enteric methane emissions trends (1990–2008) from Manitoba beef cattle using empirical and mechanistic models. Can. J. Anim. Sci., 91:305-321. Strathe, A.B. A. Lemme, J.K. Htoo and E. Kebreab. 2011. Estimating digestible methionine requirements for laying hens using multivariate nonlinear mixed effect models. Poult. Sci., 90:1496-1507. Legesse, G., J. A. Small, S. L. Scott, G. H. Crow, H. C. Block, A. W. Alemu, C. D. Robins and E. Kebreab. 2011. Predictions of enteric methane emissions for various summer pasture and winter feeding strategies for cow calf production . Anim. Feed Sci. Tech. 166-167:678-687. Alemu, A.W., J. Dijkstra, A. Bannink, J. France and E. Kebreab. 2011. Rumen stoichiometric models and their contribution and challenges in predicting enteric methane production . Anim. Feed Sci. Tech. 166-167:761-778. Darmani Kuhi, H., F. Rezaee, A. Faridi, J. France, M. Mottaghitalab and E. Kebreab. 2011. Application of the law of diminishing returns for partitioning metabolizable energy and crude protein intake between maintenance and growth in growing male and female broiler breeder pullets . J. Agric. Sci. 149, 385–394. Ellis JL, Dijkstra J, Bannink A, Parsons AJ, Rasmussen S, Edwards GR, Kebreab E, France J. The effect of high-sugar grass on predicted nitrogen excretion and milk yield simulated using a dynamic model. J Dairy Sci 2011;94(6):3105-18. Morvay Y, Bannink A, France J, Kebreab E, Dijkstra J. Evaluation of models to predict the stoichiometry of volatile fatty acid profiles in rumen fluid of lactating Holstein cows. J Dairy Sci 2011;94(6):3063-80. Strathe, A.B., J. Dijkstra, J. France, S. Lopez, T. Yan, and E. Kebreab. 2011. A Bayesian approach to analyzing energy balance data from lactating dairy cows . J. Dairy Sci., 94:2520-2531. Neijat M, House JD, Guenter W, Kebreab E. Production performance and nitrogen flow of Shaver White layers housed in enriched or conventional cage systems . Poult Sci 2011;90(3):543-54. Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: March 24, 2021 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Annie King, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Annie King, Ph.D. Breadcrumb Home People Faculty Annie King, Ph.D. Position Title Professor 530-752-3530 ajking@ucdavis.edu 1217 Meyer Hall Bio Education B.S., Food Science, North Carolina A&T University, Greensboro, North Carolina, May 1976. M.S., Food Science, North Carolina State University, Raleigh, North Carolina, May 1979. Ph.D., Food Science, North Carolina State University Raleigh, North Carolina, August 1983. Research Interests Retardation of lipid oxidation in poultry muscle, eggs and their products is the primary focus of my research. A series of antioxidants have been used, including polyphosphates and tocopherols, especially vitamine E. Presently, investigations center on the use of hydroxytyrosol, a by-product from olive oil processing, and α-tocopherol from tomato pomace, an agricultural by-product consisting of peels, cores, seeds, stems and green tomatoes from tomato processing. A secondary focus for research deals with the use of antioxidants to retard oxidation of cholesterol during processing of poultry and during the actual assay for cholesterol and its many oxidized derivatives. Thus, work continues to improve methodologies for determination of cholesterol and cholesterol oxidation products during analyses. In tangential research, tomato pomace is under investigation for it use in diets of laying hens. Additionally, research is underway to assess its usefulness in non feed removal molt diets for laying hens. Biography Annie J. King is a Professor in the Department of Animal Science at UC Davis. Her research, teaching and outreach concentrate on the nutritional quality of poultry meat, eggs and their products and use of agricultural by-products, containing antioxidants, in poultry feed. She served as the Associate Dean of Undergraduate Academic Programs in the College of Agricultural and Environmental Sciences for nearly 11 years (1994 -2005) and returned to Animal Science to continue her research program and as an instructor of avian and animal sciences courses in 2005. Presently, she serves as a faculty advisor for undergraduate students in the Department and as faculty advisor/instructor for the Contemporary Leadership Minor, part of the Science and Society Program and affiliated with the Center for Leadership Learning at UC Davis. Annie was a member of Class 30 of the California Agricultural Leadership Program and presently serves as the core faculty for the Program at Davis. As core faculty, she works with colleagues at three other California universities and the Director of Education at the California Agricultural Leadership Foundation to organize several leadership seminars per year for mid-career agriculturalists and others in closely related occupations. She received her B.S. degree in Foods and Nutrition from N.C. Agricultural and Technical State University in Greensboro, North Carolina. Her M.S. and Ph.D. degrees in Food Science (minor in nutrition) are from NC State University, Raleigh, North Carolina. As a grandmother, she is the author of a series of children’s books, the first of which (Granny Annie Lives at the Airport) was published in 2009. Graduate Groups Agricultural and Environmental Chemistry Food Sciences Courses Taught Seminar - Agricultural and Environmental Chemistry (AGC 290C) Pig and Poultry Care and Management (ANS 143) Birds, Humans and the Environment (AVS 13) Contemporary Leadership - Science and Society (SAS 130) Internship - Science and Society (SAS 192) Seminar - Science and Society (SAS 190X) People Current Graduate Students Kimberely Foster, MS Program, Avian Sciences Graduate Group. Expected Graduation Date: Fall 2016. Sadia Naseem, PhD Program, Agricultural and Environmental Chemistry Graduate Group. Expected Graduation Date: Fall 2016. Ketwee Saksrithai, PhD Program, Agricultural and Environmental Chemistry Graduate Group. Expected Graduation Date: Fall 2016. Linda Truong, MS Program, Avian Sciences Graduate Group. Expected Graduation Date: Fall 2019. Selected Publications Removal of Excess Cellulose and Associated Polysaccharides in Fruit and Vegetable By-Products – Implication for Use in Feed for Monogastric Farm Animals [ Article ] King, A. J. and Zeidler. 2004. Tomato pomace may be a good source of vitamin E in broiler diets. California Agriculture, In-Press for March – January, 2004. Bradley, F. A. and King, A. J. 2005. Egg Basics for the Consumer: Packaging, Storage, and Nutritional Information. University of California, DANR Publication 8154. Priesbe, T. J. and King, A. J. 2006. Letter to the Editor. Diabetes Research and Clinical Practice. 72:331-334. Assi, J. A. and. King, A. J. 2007. Assessment of selected antioxidants in tomato pomace subsequent to treatment with the edible oyster mushroom, Pleurotus ostreatus, under solid–state fermentation. J. Agric. Food Chem. 22:9095-9098. Assi, J. A. and King, A. J. 2008. Manganese amendment and Pleurotus ostreatus treatment to convert tomato pomace for inclusion in poultry feed. Poultry Sci. 87: 1889 – 1896. King, A. J. 2008. A review: Multi-disciplinary uses of eggs. 2008. Avian Bio.Res. In Press. Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: February 1, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Dietmar Kueltz, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Dietmar Kueltz, Ph.D. Breadcrumb Home People Faculty Dietmar Kueltz, Ph.D. Spotlight on Research Research led by Dietmar Kueltz sheds light on how some fish adapt to saltwater. More Position Title Professor 530-752-2991 dkueltz@ucdavis.edu Lab Website 2131C Meyer Hall Bio Education B.S./M.S. (Diploma), University of Rostock, Germany, 1989 Ph.D., Marine Animal Physiology, University of Rostock, Germany, 1992. Research Interests EcoPhysiological Proteomics of aquatic animals. Effects of climate change-related environmental stress (salinity, temperature) on aquatic organisms (euryhaline fish, invertebrates). Evolution of biochemical mechanisms that confer tolerance towards environmental stress (salinity, temperature, pollution) in aquatic animals. Mechanistic links between molecular (proteomic) and emergent higher-order (physiology, behaviors) phenotypes that are associated with environmental stress responses of aquatic animals. Graduate Groups Animal Biology Ecology Integrative Genetics and Genomics Molecular, Cellular and Integrative Physiology Courses Taught Molecular Biology Laboratory Techniques (ANG 111) Introductory Aquaculture (ANS18) Physiology of the Stress Response (MCP255/ABG255) Animal Biology Graduate Core Course (ABG200B) People For current and past lab member bios, please visit the Kueltz Laboratory Animal System Biology website Selected Publications For a complete list, visit: http://scholar.google.com/citations?user=r77FlyAAAAAJ Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: April 12, 2021 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Yanhong Liu, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Yanhong Liu, Ph.D. Breadcrumb Home People Faculty Yanhong Liu, Ph.D. Position Title Associate Professor of Animal Nutrition 530-752-4275 yahliu@ucdavis.edu Lab Website 2107 Meyer Hall Bio Education B.S., China Agricultural University , 2004 (Biological Science) M.S.,  China Agricultural University , 2007 (Animal Nutrition) Ph.D., University of Illinois , Urbana-Champaign, 2011 (Animal Science) Research Interests The increasing public concerns about antimicrobial resistance of food-borne bacteria impose urgent needs to seek alternatives to antibiotics in agricultural animal industry. Many of feed ingredients and additives now are available as potential ‘alternatives to antibiotics’, either by altering microbial populations in the gastrointestinal tract or by influencing the immune system. However, the still-unclear mechanism hampers their application in the industry. Our research interest is to evaluate dietary effects on pig health by investigating impacts of products now available to the industry and developing new approach for the industry. Our long-term goal is to help the animal industry deploy feed-based health technologies to improve animal health. A secondary research focus is to evaluate low-cost by-products or co-products from feed or food industry as feed ingredients for pigs. The efficient use of these low-cost ingredients in pig diets will increase the sustainability of swine production and reduce the reliance of energy on traditional ingredients, such as, corn and soybean meal. Graduate Groups Animal Biology Nutritional Biology Selected Publications Liu, Y., N. W. Jaworski, O. J. Rojas, and H. H. Stein. 2016. Energy concentration and amino acid digestibility in high protein canola meal, conventional canola meal, and in soybean meal fed to growing pigs. Anim. Feed Sci. Technol. 212: 52-62. Liu, Y., M. Song, F. N. Almeida, S. L. Tilton, M. J. Cecava, and H. H. Stein. 2014. Energy concentration and amino acid digestibility in corn and corn co-products fed to growing pigs. J. Anim. Sci. 92:4557-4565. Liu, Y., M. Song, T. Maison, and H. H. Stein. 2014. Effects of protein concentration and heat treatment on concentration of digestible and metabolizable energy and on amino acid digestibility in four sources of canola meal fed to growing pigs. J. Anim. Sci. 92:4466-4477. Liu, Y., M. Song, T. M. Che, D. Bravo, C. W. Maddox, and J. E. Pettigrew. 2014. Effects of capsicum oleoresin, garlic botanical, and turmeric oleoresin on gene expression profile of ileal mucosa in weaned pigs. J. Anim. Sci. 92:3426-3440. Liu, Y., Y. L. Ma, J. M. Zhao, M. Vazquez-Añón, and H. H. Stein. 2014. Digestibility and retention of Zn, Cu. Mn, Fe, Ca, and P in pigs fed diets containing inorganic or organic minerals. J. Anim. Sci. 92:3407-3415. Liu, Y., M. Song, T. M. Che, J. J. Lee, D. Bravo, C. W. Maddox, and J. E. Pettigrew. 2014. Dietary plant extracts modulate gene expression profiles in ileal mucosa of weaned pigs after an Escherichia coli infection. J. Anim. Sci. 92:2050-2062. Liu, Y., T. M. Che, M. Song, J. J. Lee, J. A. S. Almeida, D. Bravo, W. G. Van Alstine, and J. E. Pettigrew. 2013. Dietary plant extracts improve immune responses and growth efficiency of weaned pigs experimentally infected with porcine reproductive and respiratory syndrome virus. J. Anim. Sci. 91:5668-5679. Liu, Y., M. Song, T. M. Che, J. A. S. Almeida, J. J. Lee, D. Bravo, C. W. Maddox, and J. E. Pettigrew. 2013. Dietary plant extracts alleviate diarrhea and alter immune responses of weaned pigs experimentally infected with a pathogenic Escherichia coli. J. Anim. Sci. 91:5294-5306. Liu, Y., I. R. Ipharraguerre, and J. E. Pettigrew. 2013. Potential applications of knowledge of gut chemosensing in pig production. J. Anim. Sci. 91:1982-1990. Liu, Y., M. Song, T. M. Che, D. Bravo, and J. E. Pettigrew. 2012. Anti-inflammatory effects of several plant extracts on porcine alveolar macrophages in vitro. J. Anim. Sci. 90:2774-2783. Liu, Y. H., X. S. Piao, D. Y. Ou, Y. H. Cao, D. S. Huang, and D. F. Li. 2006. Effects of particle size and physical form of diets on mast cell numbers, histamine, and stem cell factor concentration in the small intestine of broiler chickens. Poult. Sci. 85:2149-2155. Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: July 15, 2021 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Elizabeth Maga, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Elizabeth Maga, Ph.D. Breadcrumb Home People Faculty Elizabeth Maga, Ph.D. Spotlight on Research Jim Murray and Elizabeth Maga developed a line of genetically engineered dairy goats that produce higher levels of lysozyme in their milk.  Lysozyme is naturally found in human breast milk and has antibacterial properties that can help prevent diarrhea. More Position Title Associate Professor 530-752-5930 eamaga@ucdavis.edu Maga Lab Website 2125 Meyer Hall Bio Education B.S.,  Chemical Engineering, Colorado State University, Ft. Collins, CO 1988. Ph.D., Food Science & Technology, UC Davis, Davis, CA 1994. Research Interests The overall goal of my research program is to demonstrate that milk from genetically engineered dairy animals containing increased levels of protective antimicrobial proteins can be used to improve human health. More specifically, we have generated transgenic goats that express increased levels of human lysozyme, a key human milk component thought to be involved with the development of a health-promoting gut microbiota. The overarching hypothesis is that upon consumption, lysozyme-rich milk will cause a beneficial modulation of intestinal microbiota populations thereby resulting in improved intestinal and overall health. The work conducted in my lab is both mechanistic and translational in nature by not only dissecting the role of gut microbiota on health, but also by translating the use of lysozyme-rich milk into an effective preventative or treatment agent against diarrheal illnesses. We use both animal models and cells in culture in conjunction with molecular techniques to 1) define the bacterial community structure of milk and the gastrointestinal tract, 2) investigate immune response at the level of the intestine upon milk consumption and 3) assess the safety of genetically engineered food animals and their products. In addition, studies on the relationship between casein genotypes and milk quality are being carried out in goats. Additional information about Dr. Maga's projects Graduate Groups Animal Biology Food Science Courses Taught Molecular Biology Laboratory Techniques (ANG111) People Current Graduate Students Stephanie Chew, MS Program, Animal Biology Graduate Group. Expected Graduation Date: Spring 2017. Kathleen Furtado, MS Program, Animal Biology Graduate Group. Expected Graduation Date: Spring 2018. Lydia Garas, PhD Program, Animal Biology Graduate Group. Expected Graduation Date: Spring 2016. Dissertation topic: Effects of human-lysozyme transgenic goat milk on the gut microbiota and leukocyte distribution in the intestinal mucosa of young pigs, Jill Hagey, PhD Program, Animal Biology Graduate Group. Expected Graduation Date: Spring 2020. Thesis topic: Mechanism of action of lysozyme at the level of the intestine, Rachel Pinho, PhD Program, Animal Biology Graduate Group. Expected Graduation Date: Spring 2018. Past Graduate Students Erika Scharfen, MS Animal Biology, 2006 - Utilization of Human Lysozyme Transgenic Goat Milk in Cheesemaking: Effects on Bacterial Profile and Yield. Kathryn Jackson, MS Animal Biology, 2009 - Growth and Reproduction of Lysozyme Transgenic Goats Elizabeth McInnis, MS Animal Biology, 2012 - Bacterial Profiling of Raw Milk from Lysozyme Transgenic and Control Goats Merritt Clark, MS Animal Biology, 2013 - Assessing Unintended Effects of a Mammary-Specific Transgene at the Whole Animal Level in Host and Non-Target Animals Selected Publications Clark, M., Murray, J. D. and Maga, E. A. 2013. Assessing unintended effects of a mammary-specific transgene at the whole animal level in host and non-target animals. Transgenic Res. In press DOI 10.1007/s11248-013-9768-6. Cooper, C. A., Maga, E. A. and Murray, J. D. 2014. Consumption of transgenic milk containing the antimicrobials lactoferrin and lysozyme separately and in conjunction by 6-week old pigs improves intestinal and systemic health. J. Dairy Res. 81:30-37. Cooper, C. A., Garas Klobas, L. C., Maga, E. A. and Murray, J. D. 2013. Consuming transgenic goats’ milk containing the antimicrobial protein lysozyme helps resolve diarrhea in young pigs. PloS ONE 8:e58409. Maga, E. A., Weimer, B. C. and Murray, J. D. 2013. Dissecting the role of milk components on gut microbiota composition. Gut Microbes 4:136-139. Cooper, C. A., Nelson, K., Maga, E. A. and Murray, J. D. 2013. Consumption of transgenic cows’ milk containing human lactoferrin results in beneficial changes in the gastrointestinal tract and systemic health of young pigs. Transgenic 22:Res. 571-578. Koop, G., De Visscher, A., Collar, C. A., Bacon, D. A. C., Maga, E. A., Murray, J. D., Supré, K., De Vliegher,S., Haesebrouck, F., Rowe, J. D., Nielen, M. and van Werven, T. 2012. Identification of coagulase-negative Staphylococcus species from goat milk with API staph and with transfer RNA-intergenic spacer PCR combined with capillary electrophoresis. J. Dairy Sci. 95:7200-7205. Maga, E. A., Desai, P. T., Weimer, B. C., Dao, N., Kültz, D. and Murray, J. D. 2012. Consumption of lysozyme-rich milk can alter microbial fecal populations. Appl. Environ. Microbiol. 78:6153-6160. Carvalho, E. B., Maga, E. A., Quetz, J. S., Lima, I. F., Magalhaes, H. Y. , Rodrigues, F. A., Silva, A. V., Prata, M. M., Cavalcante, P. A., Havt, A., Bertolini, M., Bertolini, L. R. and Lima, A. A. 2012. Goat milk with and without increased concentrations of lysozyme improves repair of intestinal cell damage induced by enteroaggregative Escherichia coli. BMC Gastroenterol. 12:106. Cooper, C. A., Brundige, D. R., Reh, W. A., Maga, E. A. and Murray, J. D. 2011. Lysozyme transgenic goats’ milk positively impacts intestinal cytokine expression and morphology. Transgenic Res. 20:1235-1243. Jackson, K. A., Berg, J. M., Murray, J. D. and Maga, E. A. 2010. Evaluating the fitness of human lysozyme transgenic dairy goats: Growth and reproductive traits. Transgenic Res. 19:977-986. Murray, J. D. and Maga, E. A. 2010. Is there a risk from not using GE animals? Transgenic Res. 19:357-361. Brundige, D. R., Maga, E. A., Klasing, K. C. and Murray, J. D. 2010. Consumption of pasteurized human lysozyme transgenic goats' milk alters serum metabolite profile in young pigs. Transgenic Res. 19:563-574. Maga, E. A., Daftari, P, Kültz, D. and Penedo, M. C. T. 2009. Prevalence of as1-casein genotypes in American dairy goats. J. Anim. Sci. 87:3464-3469. Bertolini, L. R., Bertolini, M., Maga, E. A., Madden, K. R. and Murray, J. D. 2009. Increased gene targeting in Ku70 and Xrcc4 transiently deficient human somatic cells. Mol. Biotechnol. 41:106-114. Brundige, D. R., Maga, E. A., Klasing, K. C. and Murray, J. D. 2008. Lysozyme transgenic goats' milk influences gastrointestinal morphology in young pigs. J. Nutr. 138:921-926. Scharfen, E. C., Mills, D. A. and Maga, E. A. 2007. Utilization of human lysozyme transgenic goat milk in cheese-making: Effects on lactic acid bacteria performance. J. Dairy Sci. 90:4084-4091. Bertolini, L. R., Bertolini, M., Anderson, G. B., Maga, E. A., Madden, K. R. and Murray, J. D. 2007. Transient depletion of Ku70 and Xrcc4 by RNAi as a means to manipulate the non-homologous end-joining pathway. J. Biotechnology. 128:246-257. Maga, E. A., Cullor, J. S., Smith, W., Anderson, G. B. and Murray, J. D. 2006. Human lysozyme expressed in the mammary gland of transgenic dairy goats can inhibit the growth of bacteria that cause mastitis and the cold-spoilage of milk. Foodborne Pathogens and Disease. 3:384-392. Maga, E. A., Walker, R. L., Anderson, G. B. and Murray, J. D. 2006. Consumption of milk from transgenic goats expressing human lysozyme in the mammary gland results in the modulation of intestinal microflora. Transgenic Res. 15:515-519. Maga, E. A., Shoemaker, C. F., Rowe, J. D., BonDurant, R. H., Anderson, G. B. and Murray, J. D. 2006. Production and processing of milk from transgenic goats expressing human lysozyme in the mammary gland. J. Dairy Sci. 89:518-524. Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: July 15, 2021 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Maja Makagon, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Maja Makagon, Ph.D. Breadcrumb Home People Faculty Maja Makagon, Ph.D. Position Title Associate Professor 530-752-9419 mmmakagon@ucdavis.edu Lab Website 2245 Meyer Hall Bio Education B.S., University of Virginia, 2001 (Biology) M.A., Cornell University, 2005 (Psychology) Ph.D., University of California Davis, 2010 (Animal Behavior) Research Interests My research program focuses on interplay between the behavior, welfare and management of poultry, including ducks, turkeys, laying hens and broilers.  My lab focuses on 3 topic areas:  1) assessing the effects of the physical and social environments on bird behavior, 2) evaluating the relationship between behavior and bone integrity, and 3) developing and validating practical, species-specific welfare assessment measures.  A common goal of this work is to develop strategies to help minimize behavior-related poultry management issues while optimizing bird welfare and production. Recent Areas of Focus: Behavioral correlates of keel bone damage in laying hens Thermoregulatory behavior of laying hens Quantitative assessment of the walking abilities of Pekin ducks Utility of the transect method as a tool for assessing the welfare of commercial turkeys Use of essential oils for mitigating the spread of northern fowl mites Improving nest use by commercial breeder ducks Graduate Groups If you are interested in pursuing graduate research under my supervision please explore the two programs listedbelow and contact me to discuss current graduate research opportunities in the lab. Animal Biology Animal Behavior Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 18, 2021 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Amy McLean, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Amy McLean, Ph.D. Breadcrumb Home People Faculty Amy McLean, Ph.D. Focus on Research The Santa Cruz Island horse breed is known for its affection and trusting nature. Amy Mclean is working with El Campeon Farms to preserve the breed, which for centuries lived on the isolated Channel Islands. More Position Title Assistant Professor of Teaching 706-296-8743 acmclean@ucdavis.edu 2131A Meyer Hall Bio Education B.S., The University of Georgia, Athens, GA (Animal Science (Equine Emphasis); Dairy Science; Minor: Agribusiness M.S., The University of Georgia, Athens, GA (Dairy Science- Reproduction Physiology (Emphasis)) Ph.D., Michigan State University, East Lansing, MI (Donkeys (Equus asinus) Nutrition, Training, and Management) Research Interests Improving equine management, behavior and welfare with a specific interest in donkeys, mules, hinnies and working equids in developing countries. Current Research Projects Mule Behavior with two main focuses: Pain Assessment- focus on facial grimace scale Behavior development- early foal handling Hematology and blood biochemistry reference values in clinically healthy mules and hinnies Comparing morphometric measurements in donkeys, mules, and hinnies Integrated approaches to improving dairy donkey welfare  and donkeys being used in production by using physiological and morphometric measurements (in collaboration with the University of Torino’s Veterinary Science Program, Torino, Italy) Comparing welfare indicators in working equids in developing countries Comparing heart rate variability and behavioral indicators when using restraint mechanisms in Mules Participatory approaches to working with and surveying mule and donkey owners in developing countries Graduate Groups Animal Biology Selected Publications Journal Articles A.K. McLean, C.R. Heleski, M.T. Yokoyama, W. Wang, A. Doumbia and B. Dembele. 2012. Improving working donkey (Equus asinus) welfare and management in Mali, West Africa. Jrnl of Vet Beh, 7, 123-34. A.K. McLean, W. Wang, F.J. Navas-Gonzalez, and J.B. Rodrigues. 2016. Reference intervals for hematological and blood chemistry reference values in healthy mules and hinnies.  Comp Clin Path, 25:3 May 2016. Emanuela Valle , Federica Raspa, Marzia Giribaldi, Raffaella Barbero, Stefania Bergagna, Sara Antoniazzi, Amy K. Mc Lean, Michela Minero, Laura Cavallarin. 2017. A functional approach to the body condition assessment of lactating donkeys as a tool for welfare evaluation. 10.7717/peerj.3001 F.J. Navas, J. Jordana, J.M. Leon, A. Arando, G. Pizarro, A.K. McLean and J.V. Delgadlo. 2017.Measuring and modeling for the assessment of the genetic background behind cognitive processes in donkeys. Sep 2017 Research in Vet Sci. E. Valle, L. Pozzo, M. Giribaldi, D. Bergero, M.S. Gennero, D. Dezzutto, A.McLean, G. Borreani, M. Coppa and L. Cavallarin. 2017. Effect of farming system on donkey milk composition. 13 Nov 2017 Jrnl of the Science of Food and Agriculture, doi: 10.1002/jsfa.8777. F.J. Navas, J. Jordana, J.M. Leon, A. Arando, G. Pizarro, A.K. McLean and J.V. Delgadlo. 2018. Genetic parameter estimation and implementation of the genetic evaluation for gaits in a breeding program for assisted-therapy in donkeys.  January 2018. Veterinary Research Communications. Book Chapters J.B. Rodrigues and A.K. McLean. 29. Tracion Animal Y Trabajo Animal Traction and Work. 2014 (in print). In: World Wide Donkey Breeds Project, Ed. Francisco Javier Navas Gonzalez. Veterinary Sciences, University of Córdoba, Rabanales University Campus, 14071 Córdoba (Spain). A.K. McLean. 23. Entrenamiento (English translation: Training.) 2013 (in print).  In:  World Wide Donkey Breeds Project, Ed. Francisco Javier Navas Gonzalez. Veterinary Sciences, University of Córdoba, Rabanales University Campus, 14071 Córdoba (Spain). A.K. McLean. 25.  Deportes Y Copeticiones Que Incluyen El Uso De Asnos (English translation: Sports and Competitions involving Donkeys) 2013 (in print). In: World Wide Donkey Breeds Project.  Ed. Francisco Javier Navas Gonzalez. Veterinary Sciences, University of Córdoba, Rabanales University Campus, 14071 Córdoba (Spain). C.R. Heleski, A. K. McLean, and J. C. Swanson. 2010.  Practical Methods for Improving the Welfare of Horses, Donkeys, and other Working Draught Animals in Developing Areas,  Pp 252-73. In: Improving Animal Welfare a Practical Approach, ed. Temple Grandin.  CAB International. Husbandry Manual (2 manuals, 5 languages) Donkey Husbandry Electronic Manual in 5 languages (English, French, Spanish, Portuguese, and Arabic), 7th Annual International Working Equid Colloquium Community Exchange Project, Royal Holloway, University of London, London, U.K. July 2014. Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: March 24, 2021 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Deanne Meyer, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Deanne Meyer, Ph.D. Breadcrumb UC Davis Department of Animal Science Extension Deanne Meyer, Ph.D. Position Title Extension Specialist: Livestock Waste Management Lecturer Master Advisor for Agricultural and Environmental Education major 530-752-9391 dmeyer@ucdavis.edu 2209 Meyer Hall Bio Education B.S., Animal Science University of California, Davis 1983 M.S., Dairy Science, University of Florida, Gainesville, Fl 1986 Ph.D., Animal Science, University of Florida, Gainesville, Fl 1989 Research Interests Analyses of production, collection, storage, transportation, and utilization of manure management waste stream(s) on dairies. Research has focused on nutrient flows through dairy operations including: content of manure solids and liquids, milk parlor water use, efficiency of mechanical and gravity flow separator devices, analyses of other treatment technologies, nutrient distribution during land applications, and ammonia volatilization. Extension Programs Environmental Stewardship Module Coordinator for the California Dairy Quality Assurance Program; develop and disseminate technical information on nutrient flows into and through dairy facilities; provide input to environmental regulatory policy developed for livestock and poultry operations. Graduate Groups Animal Biology People Research Staff Patricia Price , Senior Research Associate Current Graduate Students Christine Miller, PhD Program, Animal Biology Graduate Group. Expected Graduation Date: Spring 2020. Alumni Stephanie Nehasil, Undergraduate Student (B.S. Evolution, Ecology, Biodiversity, UC Davis). Stephanie joined the lab during Spring Quarter 2006. She is a third year student and plans to complete her degree in Spring, 2007. She would then like to go on to graduate school and a research career. Truong Tang, Undergraduate Student (B.S., Biochemistry, UC Davis). Truong joined the lab during Winter Quarter, 2006. He is a third year student in biochemistry and plans to complete his degree in Spring, 2007. His goal is to attend Pharmacy School and work in the pharmaceutical industry. Selected Publications Nennich, T. D., J. H. Harrison, L.M. VanWieringen, D. Meyer, A.J. Heinrichs, W.P. Weiss, N.R. St-Pierre, R.L. Kincaid, D.L. Davidson, E. Block (2005) Prediction of manure and nutrient excretion from dairy cattle. J Dairy Sci 88(10): 3721-33. Cassel, T., L. Ashbaugh, R. Flocchini, D. Meyer (2005) Ammonia flux from open-lot dairies: development of measurement methodology and emission factors. J Air Waste Manag Assoc55(6): 816-25. Meyer, D. (2000). ADSA Foundation Scholar award. Dairying and the environment. J Dairy Sci83(7): 1419-27. Meyer, D. and D. D. Mullinax (1999). Livestock nutrient management concerns: regulatory and legislative overview. J Anim Sci 77 Suppl 2: 51-62. James, T., D. Meyer, E. Esparza, E.J. DePeters, H. Perez-Monti. (1999). Effects of dietary nitrogen manipulation on ammonia volatilization from manure from Holstein heifers. J Dairy Sci82(11): 2430-9. Meyer, D., L. D. Schwankl, T.A. Shultz, C.A. Collar, D.D. Mullinax. (1997). Evaluation of mechanical solid liquid separators. Dairy Day, March 1997, U.C. Davis. Meyer, D., I. Garnett, J.C. Guthrie. (1997) A survey of dairy manure management practices in California. J Dairy Sci 80(8): 1841-1845. Thompson, R. B., D. Morse, K.A. Kelling, L.E. Lanyon, (1996) Computer programs that calculate manure application rates. J Prod Ag 10: 58-69. Schwankl, L. D., D. Morse, C.A. Collar, T.A. Shultz, A. Fulton (1996) Water and nutrient management of dairy manure water irrigations in California. ASAE Annual International Meeting, 1996, Phoenix, AZ, American Society of Agricultural Engineers. Morse, D. (1996) Understanding fugitive dust and ammonia emissions. 1996 National Poultry Waste Management Symposium. Morse, D. (1996) Impact of environmental regulations on Cattle Production. J Anim Sci 74(12): 3103-3111. Morse, D., J. C. Guthrie, R.L. Mutters (1996) Anaerobic digester survey of California dairy producers. J Dairy Sci 79(1): 149-153. Morse, D. (1996) Impacts of water and air quality legislation on the poultry industry. Poultry Science Journal 75(7): 857-861. Morse, D. (1995) Environmental considerations of livestock producers. J Anim Sci 73(9): 2733-2740. Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: March 24, 2021 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Michael Mienaltowski, D.V.M., Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Michael Mienaltowski, D.V.M., Ph.D. Breadcrumb Home People Faculty Michael Mienaltowski, D.V.M., Ph.D. Position Title Associate Professor 530-207-3226 mjmienaltowski@ucdavis.edu Lab Website 2211 Meyer Hall Bio Education B.S., Michigan State University, 1999 (Zoology: Cellular & Developmental Biology) DVM., Michigan State University, 2004 Ph.D., University of Kentucky, 2008 (Veterinary Science) Post-doctoral training, University of South Florida, 2008-2014 (Molecular Pharmacology & Physiology; Orthopaedics & Sports Medicine) Research Interests My primary research interests are based in the development, maturation, and repair of musculoskeletal tissues. Past efforts have been focused on articular cartilage and tendon, particularly on how phenotypes for cells like chondrocytes, bone marrow stromal cells, and tendon peritenon- and tendon proper-derived progenitor cells differ by niche, or surrounding environment. Additionally, because collagen assembly and organization are important to functionally sound musculoskeletal tissue, my research interests include the examination of how collagen fibrillogenesis might be manipulated to achieve optimal recovery of tissues with repair. The ultimate goal is to determine if alterations in niche components and organization and/or interacting cell physiology can lead to alterations in repair pathways or tissue engineering strategies to prevent and treat musculoskeletal injury. In order to reach this goal, I rely on functional genomics as well as expressional (mRNA and protein) analyses, morphometric analyses, and biomechanical assays. I am interested in the physiology of usage and elite performance as well as pathophysiology from over-usage, acute and chronic injury for all musculoskeletal tissues on all species, as they might be related to use, environment, or genetics. Though past efforts have been primarily in horse and mouse, all animals are subject to musculoskeletal injury. Moreover, from performance species like dogs, horses, and us humans, to production species like cattle, swine, and poultry, painful musculoskeletal injuries and disorders are both costly and debilitating on so many levels. Additional information about research Graduate Groups Animal Biology Integrative Pathology Integrative Genetics and Genomics Courses Taught Animal Biochemistry and Metabolism (ABI 102) Introductory Horse Husbandry (ANS 15) Internships in Animal Science - informal (ANS 92 & ANS 192) Internships in Animal Science - formal (ANS 192) Special Study for Undergraduates (ANS 99 & ANS 199) Honors Contract (HNR 190X) People Current Graduate Students Monica Pechanec, MS Program, Animal Biology Graduate Group. Selected Publications Peer-reviewed research articles Mienaltowski MJ, Huang L, Stromberg AJ, MacLeod JN. Differential gene expression associated with equine postnatal articular cartilage maturation. BMC Musculoskeletal Disorders 2008 Nov 5; 9 149. ( Article Link ) Mienaltowski MJ, Huang L, Frisbie DD, McIlwraith CW, Bathke AC, Stromberg AJ, MacLeod JN. Transcriptional profiling differences for articular cartilage and repair tissue in equine joint surface lesions. BMC Medical Genomics 2009 Sep 14; 2 60. ( Article Link ) Mienaltowski MJ, Huang L, Bathke AC, Stromberg AJ, MacLeod JN. Transcriptional comparisons between equine articular repair tissue, neonatal cartilage, cultured chondrocytes, and mesenchymal stromal cells. Briefings in Functional Genomics 2010 May; 9(3):238-50. ( PubMed Abstract ) Mienaltowski MJ, Adams SM, Birk DE. Regional differences in stem cell/progenitor cell populations from the mouse Achilles tendon. Tissue Engineering Part A 2013 Jan; 19 (1-2): 199-210. ( Article Link ) Dunkman AA, Buckley MR, Mienaltowski MJ, Adams SM, Thomas S, Satchell L, Kumar A, Pathmanathana L, Beason DP; Iozzo RV, Birk DE, Soslowsky LJ. Decorin expression is important for age-related changes in tendon structure and mechanical properties. Matrix Biology 2013 Jan; 32:3-13. ( Article Link ) Dunkman AA, Buckley MR, Mienaltowski MJ, Adam S, Thomas SJ, Satchell L, Kumar A, Pathmanathan L, Beason DP, Iozzo RV, Birk DE, Soslowsky LJ. The tendon injury response is influenced by biglycan and decorin. Annals of Biomedical Engineering, 2014 Mar; 42(3):619-30. ( PubMed Abstract ) Dunkman AA*, Buckley MR*, Mienaltowski MJ, Adams SM, Thomas SJ, Kumar A, Beason DP, Iozzo RV, Birk DE, Soslowsky LJ. The injury response of aged tendons in the absence of biglycan and decorin. Matrix Biology, 2014 April; 35:232-238. ( Article Link ) Mienaltowski MJ, Adams SM, Birk DE. Tendon Proper- and Peritenon-Derived Progenitor Cells Have Unique Tenogenic Properties. Stem Cell Research & Therapy, 2014 July 8; 5(4):86. ( Article Link ) Book chapters Coleman SJ, Mienaltowski MJ, MacLeod JN. Ch.8: Functional Genomics in Equine Genomics, Ames, Iowa: Wiley-Blackwell, Inc., 2013, pp. 125-141. (ISBN: 978-0813815633). ( Chapter link ) Mienaltowski MJ and Birk DE. Ch. 2: Structure, Physiology and Biochemistry of Collagens in: Halper J (ed): Progress in Heritable Soft Connective Tissue Disorders, Advances in Experimental Medicine and Biology, NY: Springer, 2014, pp. 5-29. (ISBN 978-94-007-7893-1). ( PubMed Abstract ) Mienaltowski MJ and Birk DE. Ch. 13: Mouse Models in Tendon and Ligament Research in: Halper J (ed): Progress in Heritable Soft Connective Tissue Disorders, Advances in Experimental Medicine and Biology, NY: Springer, 2014, pp. 201-230. (ISBN 978-94-007-7893-1). ( PubMed Abstract ) All peer-reviewed publications can be found here . Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 3, 2021 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Michael Miller, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Michael Miller, Ph.D. Breadcrumb Home People Faculty Michael Miller, Ph.D. Position Title Professor 530-304-4719 micmiller@ucdavis.edu Lab Website 2251 Meyer Hall Bio Education B.S., Biology, University of Oregon, 2006. Ph.D., Biology, University of Oregon, 2011. Research Interests Animal genetics and genomics; conservation and ecological genetics and genomics; genomics and bioinformatics technology development; salmonid fishes. Graduate Groups Animal Biology Ecology Integrative Genetics and Genomics People Current Graduate Students Razib Khan, PhD Program, Integrative Genetics and Genomics Graduate Group. Expected Graduation Date: Summer 2017. Ryan Peek, PhD Program, Ecology Graduate Group. Expected Graduation Date: Summer 2018. Michelle Pepping, MS Program, Animal Biology Graduate Group. Expected Graduation Date: Summer 2018. Daniel Prince, PhD Program, Integrative Genetics and Genomics Graduate Group. Expected Graduation Date: Summer 2018. Tasha Thompson, PhD Program, Integrative Genetics and Genomics Graduate Group. Expected Graduation Date: Summer 2019. Alumni Omar Ali, MS Integrative Genetics and Genomics, Winter 2016. Zach Norgaard, MS Intergrative Genetics and Genomics, Spring 2015. Selected Publications Meek MH, Baerwald MR, Stephens MR, Goodbla A, Miller MR, Tomalty KMH, May B. Sequencing improves our ability to study threatened migratory species: genetic population assignment in California's Central Valley Chinook salmon. Submitted. Saglam IK, Baumsteiger J, Smith MJ, Linares-Casenave J, Nichols AL, O'Rourke SM, Miller MR,. Phylogenetics suggests the common origin of two scientific icons: Devils Hole and Devils Hole pupfish. Submitted. Saglam IK, Miller MR, O'Rourke SM, Caglar SS. Phylo-comparative analysis from RAD sequence data reveal the dual role of drift and selection in reproductive character displacement. Submitted. Arraiano-Castilho R, Saglam IK, O'Rourke SM, Miller MR, Beja-Pereira A. Cryptic speciation challenges conservation and management of mycological resources. Submitted. Bernardi G, Azzurro E, Golani D, Miller MR,. Genomic signatures of pre-adaptation and post-invasion rapid adaptive evolution in the bluespotted cornetfish, a Mediterranean Lessepsian invader. Submitted. Norgaard ZK, Ali OA, Amish SJ, O'Rourke SM, Prince DJ, Luikart G, Muhlfeld CC, Miller MR,. Caution and skepticism are critical when analyzing massively parallel sequencing data. Submitted. Andrews KR, Good JM, Miller MR, Luikart G, Hohenlohe PA. Harnessing the power of RADseq for ecological and evolutionary genomics. Nature Reviews Genetics. In press. [Full Text] Ali OA, O'Rourke SM, Amish SJ, Meek MH, Luikart G, Jeffres C, Miller MR,. RAD Capture (Rapture): Flexible and efficient sequence-based genotyping. Genetics. In press. [Full Text] Arciniega M, Clemento AJ, Miller MR, Peterson M, Garza JC, Pearse DE. (2015) Parallel evolution of the summer steelhead ecotype in multiple populations from Oregon and Northern California.Conservation Genetics. 1-11. [Full Text] Hand BK, Hether TD, Kovach RP, Muhlfeld CC, Amish SJ, Boyer MC, O’Rourke SM, Miller MR, Lowe WH, Hohenlohe PA, Luikart G. (2015) Genomics and introgression: discovery and mapping of thousands of species-diagnostic SNPs using RAD sequencing. Current Zoology. 61(1):146-154. Palti Y, Gao G, Liu S, Kent MP, Lien S, Miller MR, Rexroad CE 3rd, Moen T. (2015) The development and characterization of a 57K single nucleotide polymorphism array for rainbow trout. Molecular Ecology Resources. 15(3):662–672. [Full Text] Welly BT, Miller MR, Blanchard MT, Islas-Trejo AD, O’Rourke SM, Young AE, Stott JL, Medrano JF, Van Eenennaam AL. (2014) Genome assembly of the putative etiologic agent of epizootic bovine abortion. Proceedings, Western Section, American Society of Animal Science. 65(1):8-12. Andrews KR, Hohenlohe PA, Miller MR, Seeb JE, Luikart G. (2014) Trade-offs and utility of alternative RADseq methods. Molecular Ecology. 23(24):5943–5946. [Full Text] Pearse DE, Miller MR, Abadía-Cardoso A, Garza JC. (2014) Rapid parallel evolution of standing variation in a single, complex, genomic region is associated with life history in steelhead/rainbow trout.Proceedings of the Royal Society B: Biological Sciences. 281(1783):20140012. [Full Text] Palti Y, Gao G, Miller MR, Vallejo RL, Wheeler PA, Quillet E, Yao J, Thorgaard GH, Salem M, Rexroad CE 3rd. (2014) A resource of single-nucleotide polymorphisms for rainbow trout generated by RAD sequencing of doubled haploids. Molecular Ecology Resources. 14(3):588–596. [Full Text] Gay L, Karfilis K, Miller MR, Doe CQ, Stankunas K. (2014) Applying thiouracil (TU)-tagging for mouse transcriptome analysis. Nature Protocols. 9(2):410–420. [Full Text] Hale MC, Thrower FP, Berntson EA, Miller MR, Nichols K. (2013) Evaluating adaptive divergence between migratory and non-migratory ecotypes of a salmonid fish, Oncorhynchus mykiss. G3: Genes, Genomes, Genetics. 2(9):1113-1127. [Full Text] Narum SR, Campbell NR, Meyer K, Miller MR, Hardy R. (2013) Thermal adaptation and acclimation of ectotherms in differing aquatic climates. Molecular Ecology . 22(11):3090-3097. [Full Text] Hohenlohe PA, Day MD, Amish SJ, Miller MR, Kamps-Hughes N, Boyer MC, Muhlfeld CC, Allendorf FW, Johnson EA, Luikart G. (2013) Genomic patterns of introgression in rainbow and westslope cutthroat trout illuminated by overlapping paired-end RAD sequencing. Molecular Ecology. 22(11):3002-3013. [Full Text] Narum SR, Buerkle CA, Davey JW, Miller MR, Hohenlohe PA. (2013) Genotyping-by- s equencing in e cological and c onservation g enomics. Molecular Ecology. 22(11):2841-2847. [Full Text] [Cover] Kohwi M, Lupton JR, Lai SL, Miller MR, Doe CQ. (2013) Developmentally r egulated s ubnuclear g enome r eorganization r estricts n eural p rogenitor c ompetence in Drosophila. Cell. 152(1):97–108. [Full Text] [Graphical Abstract] Gay L, Miller MR, Ventura PB, Devasthali V, Vue Z, Thompson HL, Temple S, Zong H, Cleary MD, Stankunas K, Doe CQ. (2013) Mouse TU-tagging: a chemical/genetic intersectional method for purifying cell type - specific nascent RNA. Genes and Development. 27(1):98-115. [Full Text] Lai SL, Miller MR, Robinson KJ, Doe CQ. (2012) The Snail family member Worniu is continuously required in neuroblasts to prevent Elav-induced premature differentiation. Developmental Cell. 23(4):849-57. [Full Text] Everett MV, Miller MR, Seeb JE. (2012) Meiotic maps of sockeye salmon derived from massively parallel DNA sequencing. BMC Genomics. 13:521. [Full Text] Hecht BC, Thrower FP, Hale MC, Miller MR, Nichols KM. (2012) The genetic architecture of migration related traits in rainbow and steelhead trout, Oncorhynchus mykiss. G3: Genes, Genomes, Genetics. 2(9):1113-1127. [Full Text] Bernardi G, Wiley EO, Mansour H, Miller MR, Orti G, Haussler D, O'Brien SJ, Ryder OA, Venkatesh B. (2012) The fishes of Genome 10K. Marine Genomics. 7(9):3-6. [Full Text] Miller MR, Brunelli JP, Wheeler PA, Liu S, Rexroad CE 3rd, Palti Y, Doe CQ, Thorgaard GH. (2012) A conserved haplotype controls parallel adaptation in geographically distant salmonid populations.Molecular Ecology. 21(2):237–249. [Full Text] Carney TD, Miller MR, Robinson KJ, Bayraktar OA, Osterhout JA, Doe CQ. (2012) Functional genomics identifies neural stem cell sub-type expression profiles and genes regulating neuroblast homeostasis.Developmental Biology. 361(1):137-142. [Full Text] [Cover] O'Rourke SM, Yochem J, Connolly AA, Price MH, Carter L, Lowry JB, Turnbull DW, Kamps-Hughes N, Stiffler N, Miller MR, Johnson EA, Bowerman B. (2011) Rapid mapping and identification of mutations in Caenorhabditis elegans by RAD mapping and genomic interval pull-down sequencing. Genetics. 189(3):767-778. [Full Text] Liu C, Sage JC*, Miller MR *, Verhaak RGW*, Hippenmeyer S, Vogel H, Forman O, Bronson RT, Nishiyama A, Luo L, Zong H. (2011) Mosaic analysis with double markers reveals tumor cell of origin in glioma. Cell. 146(2):209-221. *Equal contribution [Full Text] [Graphical Abstract] Tran KD, Miller MR, Doe CQ. (2010) Recombineering Hunchback identifies two conserved domains required to maintain neuroblast competence and specify early-born neuronal identity. Development. 137(9):1421-1430. [Full Text] [Cover] Miller MR, Robinson KJ, Cleary MD, Doe CQ. (2009) TU-tagging: cell type-specific RNA isolation from intact complex tissues. Nature Methods. 6(6):439-441. [Full Text] [Cover] Yokoi H*, Yan YL*, Miller MR, BreMiller RA, Catchen JM, Johnson EA, Postlethwait JH. (2009) Expression profiling of zebrafish sox9 mutants Patents Johnson EA*, Liu G*, Miller MR*. (2006) Methods of mapping polymorphisms and polymorphism microarrays. Patent Pub. No. WO/2006/122215. *Listed alphabetically [Full Text] Spotlight on Research Mike Miller developed new techniques for analyzing DNA, which may transform how imperiled species are considered and managed for conservation protection. More Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: July 6, 2023 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Frank Mitloehner, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Frank Mitloehner, Ph.D. Breadcrumb UC Davis Department of Animal Science Extension Frank Mitloehner, Ph.D. Position Title Professor and Air Quality Extension Specialist 530-752-3936 fmmitloehner@ucdavis.edu Twitter: @GHGGuru Blog 2151 Meyer Hall Bio Education M.S., Agricultural Engineering and Animal Science (Diplom Agrar Ingenieur, Dipl. agr. ing.), University of Leipzig, Germany, 1996. Grad studies, Animal Science, University of Goettingen, Germany. Ph.D., Animal Science, Texas Tech University, Lubbock, TX, 2000. Research Interests Previous research was conducted in the areas of air quality (dust emission and microbial sampling in feedlot cattle and pigs), environmental physiology (heat stress in cattle and pigs), and ethology. Current research activities are in two main areas: Air quality research related to livestock production, especially quantification of ammonia, dust, and odor emissions in dairies, beef feedlots, and poultry operations. Main objective is to help establishing environmentally benign livestock systems. Environmental physiology research, focusing on effects of air emissions on animal health and Graduate Groups Animal Biology Animal Behavior Ecology Agricultural and Environmental Chemistry Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: March 24, 2021 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Carly Moody, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Carly Moody, Ph.D. Breadcrumb Home People Faculty Carly Moody, Ph.D. Position Title Assistant Professor cmoody@ucdavis.edu Lab Website 2131D Meyer Hall Bio Education: Ph.D., Epidemiology, Ontario Veterinary College, University of Guelph, Guelph Canada M.S., Applied Animal Biology, University of British Columbia, Vancouver Canada B.S. (Hons)., Applied Biology, University of British Columbia, Vancouver Canada Research Interests: My research program uses a combination of applied ethology and epidemiology research methods and statistical techniques to study animal welfare. I have conducted research in a variety of areas including low-stress handling, agonistic interactions in socially housed animals, mitigating procedural pain and stress, and studying human-animal interactions. I conduct research with a range of animal species including companion, farmed, and laboratory animals. Broadly, I currently have three areas of study: 1) mitigating agonism in socially housed animals, 2) examining human-animal interactions during handling and other animal procedures , and 3) improving cat welfare in the veterinary clinic. Intraspecific agonistic interactions are a significant and complex issue occurring in a variety of socially housed captive animals such as commercially farmed animal species (e.g., pigs, laying hens, fish), domesticated pets (e.g., cats, dogs), and laboratory animals (e.g., mice, rats, rabbits). Although agonism is a normal part of an animal’s behavioral repertoire, excessive agonism has detrimental consequences. These interactions can result in serious animal welfare issues associated with stress (e.g., subordination or dominance related), distress (i.e., prolonged inability to escape negative interactions), pain from wounding, and even death. Particularly I am interested in examining the influence of early experiences (social, environmental) on later intraspecific agonistic interactions. I have expertise in animal handling, having conducted low stress handling research in cats, mice, rats, and pigs. I have an interest in examining human-animal interactions during animal handling and other necessary procedures. Regardless of whether animal handling is occurring on farm, in a veterinary clinic, or a research laboratory, handling and restraint methods may impact the affective state of both the animal and the handler. I am also interested in studying various approaches for improving human-animal interactions, and the impact these have on the human-animal relationship and animal welfare. Another area of interest is examining strategies for improving cat welfare in the veterinary clinic. Routine health and behavior care are essential for maintaining cat welfare. However, many factors may impede cat owner access to care including social factors such as area of household (example: rural and remote communities), age of owner (example: senior owners may face more challenges bringing their cat to the veterinary clinic), socioeconomic factors (example: access and cost of transportation, time away from home or work), and decreased owner willingness due to stressful experiences associated with clinic visits. Furthermore, with increasing concerns around public health and safety with the COVID-19 pandemic, it has become crucial to improve accessibility to high quality veterinary care. I am interested in studying various strategies for overcoming these barriers. I am currently accepting graduate students and undergraduate research volunteers. If you are interested in joining my lab please email me at cmoody@ucdavis.edu with your CV and research interests. My laboratory is committed to creating a diverse and inclusive environment, and I encourage students from all backgrounds to apply. Dr. Moody is also a faculty member with the UC Davis Center for Animal Welfare . Graduate Groups Animal Behavior Animal Biology Master of Preventive Veterinary Medicine Selected Publications: Moody, C ., Paterson, E., Leroux-Petersen, D., Turner, P. 2020. Brown paper nest pucks may protect female C57BL/6 mice from barbering. J Am Lab Anim Assoc. Randall, M., Moody, C ., Turner, P. 2020. Mental well-being in Laboratory Animal Professionals: A cross-sectional study of compassion fatigue, contributing factors, and coping mechanisms. J Am Lab Anim Assoc. Moody, C. , Dewey, C., Niel, L. 2020. Survey of veterinary staff to identify the common cat handling techniques used in veterinary clinics throughout Canada and the United States. J Am Vet Med Assoc. 256(9):1020-1033. Sargeant J.M., Deb, B., Bergevin, M., Churchill, K., Dawkins, K., Dunn, J., Hu, D., Moody, C. et al. 2019. Efficacy of bacterial vaccines to prevent respiratory disease in swine: A systematic review and network meta-analysis. Anim Health Res Rev. 20(2): 274-290. Sargeant, J.M., Bergevin, M., Churchill, K., Dawkins, K., Deb, B., Dunn, J., Hu, D., Moody, C. , et al . 2019. A systematic review of the efficacy of antibiotics for the prevention of swine respiratory disease. Anim Health Res Rev. 20(2): 291-304. Moody, C. , Dewey, C., Mason, G., Niel, L. 2019. Getting a grip: cats respond negatively to scruffing and clips. Vet Record. Doi:10.1136/vr.105261. Moody, C. , Mason, G., Dewey, C., Landsberg, G., Niel, L. 2018. Testing two behavioural paradigms for use in assessing cat aversion behaviour. Appl Anim Behav Sci. 210: 73-80. Moody, C. , Dewey, C., Mason, G., Picketts, V., Niel, L. 2018. Can you handle it? Validating negative responses to restraint in cats. Appl Anim Behav Sci 204: 94-100. Moody, C . , Chua, B., Weary, D. 2015. Testing three measures of mouse insensibility following induction with isoflurane or CO2for a more humane euthanasia. Appl Anim Behav Sci 163: 183-187. Moody, C . , Weary, D. 2014. Mouse aversion to isoflurane versus carbon dioxide gas. Appl Anim Behav Sci 158: 95-101. Moody, C. ,Makowska, I.,Weary, D. 2014. The effect of carbon dioxide flow rate on the euthanasia of laboratory mice. Lab Anim 48: 298-304. Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: May 19, 2022 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Kelly Nichols, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Kelly Nichols, Ph.D. Breadcrumb Home People Faculty Kelly Nichols, Ph.D. Position Title Assistant Professor +1-530-761-6698 knichols@ucdavis.edu 2203 Meyer Hall Bio Education: B.Sc., University of Guelph, Canada, 2013 M.Sc., University of Guelph, Canada, 2015 Ph.D., Wageningen University, the Netherlands, 2019 Research Interests: Dairy cattle play a crucial role in the global food ecosystem as net producers of human food (e.g., milk) from human-inedible resources (e.g., agricultural byproducts). Maintaining production of high-quality milk while addressing issues related to environmental sustainability and resource availability requires deeper understanding of the interactions between key dietary components like energy and protein, and the dynamics of digestion and metabolism in response to nutritional manipulation. The Nichols Lab focuses on characterizing the digestive and metabolic flexibility of dairy cattle to elevate our understanding of dietary protein and energy interactions, mammary gland metabolism, and postabsorptive nutrient utilization to improve the transfer of dietary nutrients into milk. We conduct studies investigating metabolite flux at the tissue level (e.g., mammary gland), energy and nitrogen balance, digestibility, and milk production in response to nutritional interventions. Further, we are interested in how the postabsorptive efficiencies of nutrients (e.g., amino acids) interact and change with the physiological state of the cow throughout lactation. Our lab has strong collaborations with global animal nutrition companies and other top-tier university research groups, with opportunities for interested students to gain international experience in the animal nutrition industry. Publications Google Scholar Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: November 1, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Anita Oberbauer, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Anita Oberbauer, Ph.D. Breadcrumb Home People Faculty Anita Oberbauer, Ph.D. Position Title Distinguished Professor Executive Associate Dean College of Agricultural & Environmental Sciences 530-752-1046 (Meyer Lab) 530-752-5484 (Mrak Office) amoberbauer@ucdavis.edu Lab Website Canine Genetic Analysis Project (CGAP) 1301 Meyer Hall Bio Education B.S., Zoology, University of California, Davis, CA , 1980. Ph.D., Animal Physiology, Cornell University, Ithaca, NY, 1985. Research Interests My research program has two areas of emphasis: a) growth and development focusing on the skeleton in driving the relationship between skeletal size and body composition and  b) the genetic basis for health disorders and other traits in dogs and cattle. Additional information about Dr. Oberbauer's Research Graduate Groups Integrative Genetics and Genomics Molecular, Cellular and Integrative Physiology Animal Biology Forensic Science Graduate program Courses Taught Introductory Companion Animal Biology (ANS 042) People A full list of current and past lab members . Selected Publications Please visit Dr. Oberbauer’s lab website for a full list of publications. Lai E, Danner A, Famula TR, Oberbauer AM. (2021). Pleiotropic loci associated with claw disorders and periparturient diseases in Holstein cattle. Frontiers in Genetics. 2319. Gershony L, Belanger JM, Hytönen MK, Lohi H, Famula TR, Oberbauer AM. (2021). Whole genome sequencing reveals multiple linked genetic variants on canine chromosome 12 associated with risk for symmetrical lupoid onychodystrophy (SLO) in the bearded collie. Genes 12, no. 8 (2021): 1265. Kinsey NA, Belanger JM, Dog Biomedical Variant Database Consortium, Oberbauer AM. (2022) Canine reference genome accuracy impacts variant calling: Lessons learned from investigating embryonic lethal variants. Animal genetics, 53(5), pp.706-708. Belanger JM, Heinonen T, Famula TR, Mandigers PJ, Leegwater PA, Hytönen MK, Lohi H, Oberbauer AM. (2022) Validation of a chromosome 14 risk haplotype for idiopathic epilepsy in the Belgian shepherd dog found to be associated with an insertion in the RAPGEF5 gene. Genes. Jun 23;13(7):1124. Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: June 14, 2023 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Lee Allen Pettey, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Lee Allen Pettey, Ph.D. Breadcrumb Home People Faculty Lee Allen Pettey, Ph.D. Position Title Assistant Professor of Teaching Director of Animal Science Curriculum Development/Assessment Master Advisor for Animal Science and Management Major 530-752-8924 lapettey@ucdavis.edu 2137 Meyer Hall Bio Research Interests Effectiveness of teaching methodologies and technologies as they apply to animal science courses; pedagogically sound approaches to curriculum and course development for traditional and non-traditional animal science students; applied livestock nutrition focusing on use of alternative feed ingredients. Graduate Groups Animal Biology Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: March 24, 2021 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Pablo Ross, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Pablo Ross, Ph.D. Breadcrumb Home People Faculty Pablo Ross, Ph.D. Position Title Adjunct Professor 530-771-7225 pross@ucdavis.edu GEEAP Project Website Bio Education D.V.M., Veterinary Medicine, La Plata National University (Argentina), 1999 M.S., Animal Science, Mar del Plata National University (Argentina), 2002 Ph.D., Animal Science, Michigan State University, 2007 Research Interests Reproductive biology with emphasis on gamete and embryo development. Epigenetic remodeling during embryonic development, somatic cell nuclear transfer, embryonic stem cells, and induced pluripotency. Development and application of assisted reproductive techniques in livestock species. Additional information about Ross's Research Graduate Groups Animal Biology Integrative Genetics and Genomics Designated Emphasis in Reproductive Biology Designated Emphasis in Biotechnologies Courses Taught Animal Growth and Development (ANS 123) Animal Cell Culture (ANS 133) Animal Cell Culture Laboratory (MCP 200L) People Research Staff Xiaoqin (Shally) Xu Current Graduate Students and Postdocs Ahmed Mahdi, Ph.D. Program, Animal Biology Graduate Group. Expected Graduation Date: Fall 2020. Insung Park, Ph.D. Program, Animal Biology Graduate Group. Expected Graduation Date: Spring 2021. Carly Guiltinan, Ph.D. Program, Animal Biology Graduate Group. Expected Graduation Date: Spring 2023. Daniel Goszczynski, Postdoc. Emily Fishman, Postdoc. Chuan Zhou, Postdoc Current International Visiting Students, Postdocs and Professors Miaohan Jin, Ph.D. student, Northwest A&F University, Yangling, China Past Graduate Students and Postdocs Margaret Buell, M.S. Animal Biology. Kursheed Iqbal, Postdoc. Nhi Chung, M.S. Animal Biology. Juan Reyes, Ph.D. Integrative Genetics and Genomics. Yanina Bogliotti, Ph.D. Animal Biology. Charnice Robinson, M.S. Animal Biology. Michelle Cruz, M.S. Animal Biology. Marcela Vilarino, Ph.D. Animal Biology. Susan Waters, M.S. Integrative Genetics and Genomics. Luis Ferre, Ph.D. Universidad Nacional del Litoral, Argentina. Bradford Daigneault, Postdoc. Delia Soto, Ph.D. Animal Biology. Erika Paulson, Ph.D. Animal Biology. Tae Kim, Postdoc. Michelle Halstead, Ph.D. Integrative Genetics and Genomics Selected Publications Bogliotti YS, Chung N, Paulson E, Chitwood J, Haltead M, Kern C, Schultz RM, Ross PJ. Transcript profiling of bovine embryos implicates specific transcription factors in the maternal-to-embryo transition. Biology of Reproduction 2020 Mar 13;102(3):671-679. doi: 10.1093/biolre/ioz209. Goszczynski DE, Cheng H, Demyda-Peyrás S, Medrano JF, Wu J, Ross PJ. In vitro breeding: application of embryonic stem cells to animal production. Biology of Reproduction 2019 Apr 1;100(4):885-895. doi: 10.1093/biolre/ioy256. Daigneault BW, Rajput S, Smith GW, Ross PJ. Embryonic POU5F1 is required for expanded bovine blastocyst formation. Sci Rep. 2018 May 17;8(1):7753. doi: 10.1038/s41598-018-25964-x. Bogliotti YS, Wu J, Vilarino M, Soto DA, Izpisua Belmonte JC, Ross PJ. Efficient derivation of stable primed pluripotent embryonic stem cells from bovine blastocysts. PNAS 2018 Feb 27;115(9):2090-2095. Vilarino M, Rashid ST, Suchy FP, McNabb BR, van der Meulen T, Fine EJ, Ahsan S, Mursaliyev N, Sebastiano V, Diab SS, Huising MO, Nakauchi H, Ross PJ. CRISPR/Cas9 microinjection in oocytes disables pancreas development in sheep. Sci Rep. 2017 Dec 12;7(1):17472. doi: 10.1038/s41598-017-17805-0. Reyes JM, Silva E, Chitwood JL, Schoolcraft WB, Krisher RL, Ross PJ. Differing molecular response of young and advanced maternal age human oocytes to in vitro maturation. Hum Reprod. 2017 2017 Nov 1;32(11):2199-2208. doi: 10.1093/humrep/dex284. Wu J, Platero-Luengo A, Sakurai M, Sugawara A, Gil MA, Yamauchi T, Suzuki K, Bogliotti YS, Cuello C, Morales Valencia M, Okumura D, Luo J, Vilariño M, Parrilla I, Soto DA, Martinez CA, Hishida T, Sánchez-Bautista S, Martinez-Martinez ML, Wang H, Nohalez A, Aizawa E, Martinez-Redondo P, Ocampo A, Reddy P, Roca J, Maga EA, Esteban CR, Berggren WT, Nuñez Delicado E, Lajara J, Guillen I, Guillen P, Campistol JM, Martinez EA, Ross PJ, Izpisua Belmonte JC. Interspecies Chimerism with Mammalian Pluripotent Stem Cells. Cell. 2017 Jan 26;168(3):473-486.e15. doi: 10.1016/j.cell.2016.12.036. Cannovas S, Cibelli J, Ross PJ. Jumonji domain-containing protein 3 regulates histone 3 lysine 27 methylation during bovine preimplantation development. Proceedings of the National Academy of Sciences of the USA (PNAS) 2012; 109(7):2400-5 Complete List of Published Work : http://www.ncbi.nlm.nih.gov/sites/myncbi/pablo.ross.1/bibliography/42934731/public/?sort=date&direction=descending Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: November 15, 2021 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Andrea Schreier, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Andrea Schreier, Ph.D. Breadcrumb Home People Faculty Andrea Schreier, Ph.D. Position Title Associate Adjunct Professor 530-752-0664 amdrauch@ucdavis.edu Lab Website 2235 Meyer Hall Bio Education B.S., Biology (Chemistry Minor), Hillsdale College, 2003. M.S., Wildlife Genetics, Purdue University, 2006. Ph.D., Ecology, University of California Davis, 2012. Research Interests Applying genetic and genomic techniques to answer ecological or evolutionary questions about wild populations, conservation of threatened and endangered species, genetic management of conservation and commercial aquaculture, animal polyploidy. Graduate Groups Ecology Integrative Genetics and Genomics People For a list of current lab members, please check out the Genomic Variation Laboratory website . Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: October 20, 2023 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Kathryn Teixeira, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Kathryn Teixeira, Ph.D. Breadcrumb Home People Faculty Kathryn Teixeira, Ph.D. Position Title Assistant Professor of Teaching kteixeira@ucdavis.edu Bio Education Ph.D. - Agricultural Education, Oklahoma State University M.S. - Agriculture with specialization in Agricultural Education, Cal Poly, San Luis Obispo B.S. - Agricultural Science, Cal Poly, San Luis Obispo Research Interests Evaluation of informal teacher mentoring and in-service in school-based agricultural education; Inclusion of students with special needs in school-based agricultural education; Teachers’ use of social media as a means for increased social capital in agricultural education. Selected Publications Teixeira, K. L., & Edwards, M. (2020). Teaching Students with Special Needs in School-Based, Agricultural Education: A Historical Inquiry. Journal of Research in Technical Careers, 4 (1). https://doi.org/10.9741/2578-2118.1066 Settle, Q., Teixeira, K., Bechtold, R., Shoulders, C., & King, A. (2020). Coauthor network analysis of journal of agricultural education articles from 2008-2017. Journal of Agricultural Education, 61(2), 115-127. https://doi.org/10.5032/jae.2020.02115 Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: March 25, 2021 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Anne Todgham, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Anne Todgham, Ph.D. Breadcrumb Home People Faculty Anne Todgham, Ph.D. Spotlight on Research Research by Anne Todgham examines how Antarctic fishes may make trade-offs in their physiology and behavior to cope with ocean acidification and warming waters. More Position Title Professor and Chair 530-752-1252 530-752-1897 todgham@ucdavis.edu Lab Website 2223B Meyer Hall Bio Education B.S., University of Guelph, Canada , 1997 (Marine Biology) Ph.D., University of British Columbia, Canada , 2005 (Animal Science & Zoology) Research Interests I am an environmental physiologist with an interest in understanding the molecular, biochemical and physiological mechanisms that underlie an animal's capacity to cope with environmental change.  I am fascinated by the diversity of physiological specializations (or strategies) used by animals to tolerate particular habitats that others would find very challenging.  This interest has led my research to investigate how an animal's physiology and environment interact to structure organismal stress tolerance.  My current research program has an eye towards global climate change and addresses the general question of whether contemporary animals have the physiological flexibility necessary to buffer the unprecedented rates of environmental change, specifically their response to changes in multiple environmental variables. My research focuses mainly on aquatic organisms that are distributed along the California coast and estuaries (e.g. limpets, sea urchins, crabs, oysters and intertidal fishes), but extends to Antarctic fishes and aquaculture species. Graduate Groups Animal Biology Ecology Courses Taught Animal Physiology (ANS100) Experimental Animal Physiology (ANS 139) People Current Graduate Students Brittany Davis (nee Bjelde), Ph.D. Program, Animal Biology Graduate Group. Expected Graduation Date: Spring 2018. Annelise Del Rio, Ph.D. Program, Ecology Graduate Group. Expected Graduation Date: Summer 2019. Erin Flynn, Ph.D. Program, Ecology Graduate Group. Expected Graduation Date: Summer 2018. Michaiah Leal, Ph.D. Program, Animal Biology Graduate Group. Expected Graduation Date: Summer 2019. Past Graduate Students Madeline Kinsey, M.S. Program, Animal Biology Graduate Group. Expected Graduation Date: Winter 2016. Selected Publications Todgham, A.E., Stillman, J.H. 2013. Physiological responses to shifts in multiple environmental stressors: Relevance in a changing world. Integr. Comp. Biol. 53:539-544. Bjelde, B.E.*, Todgham, A.E. 2013. Thermal physiology of the fingered limpet Lottia digitalis under emersion and immersion. J. Exp. Biol. 216:2858-2869. Kültz, D., Clayton, D.F., Robinson, G.E., Albertson, C., Carey, H.V., Cummings, M.V., Dewar, K., Edwards, S.V., Hofmann, H.A., Gross, L.J., Kingsolver, J.G., Meaney, M.J., Schlinger, B.A., Shingleton, A.W., Sokolowski, M.B., Somero, G.N., Stanzione, D.C., and Todgham, A.E. 2013. New frontiers for organismal biology. BioScience 63:464-471. Fangue, N.A., Osborne, E.J. #, Todgham, A.E. and Schulte, P.M. 2011. The onset temperature of the heat-shock response and whole-organism thermal tolerance are tightly correlated in both laboratory-acclimated and field-acclimatized tidepool sculpins (Oligocottus maculosus). Physiol. Biochem. Zool. 84:341-352. Hofmann, G.E. and Todgham, A.E. 2010. Living in the now: Physiological mechanisms to tolerate a rapidly changing environment. Annu. Rev. Physiol. 72:127-145. O’Donnell, M.J., Todgham, A.E., Sewell, M.A., Hammond, L.M.*¥, Ruggiero, K., Fangue, N.A., Zippay, M.L.* and Hofmann, G.E. 2010. Ocean acidification alters skeletogenesis and gene expression in larval sea urchins. Mar. Ecol. Prog. Ser. 398:157-171. Todgham, A.E. and Hofmann, G.E. 2009. Transcriptomic response of sea urchin larvae Strongylocentrotus purpuratus to CO2-driven seawater acidification. J. Exp. Biol. 212: 2579-2594. Hofmann, G.E., O’Donnell, M.J. and Todgham, A.E. 2008. Using functional genomics to explore the impacts of ocean acidification on calcifying marine organisms. Mar. Ecol. Prog. Ser. 373:219-225. Todgham, A.E., Hoaglund, E.A. and Hofmann, G.E. 2007. Is cold the new hot?: Elevated ubiquitin conjugated protein levels in tissues of Antarctic fish as evidence for cold-denaturation of proteins in vivo. J. Comp. Physiol. B 177:857-866. Todgham, A.E., Iwama, G.K. and Schulte, P.M. 2006. Effect of the natural tidal cycle and artificial tempeature cycling on Hsp levels in tidepool sculpins, Oligocottus maculosus. Physiol. Biochem. Zool. 79: 1033-1045. Todgham, A.E., Schulte, P.M. and Iwama, G.K. 2005. Cross-tolerance in the tidepool sculpin: the role of heat shock proteins. Physiol. Biochem. Zool. 78:133-144. Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: July 1, 2022 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Cassandra Tucker, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Cassandra Tucker, Ph.D. Breadcrumb Home People Faculty Cassandra Tucker, Ph.D. Position Title Professor 530-754-5750 cbtucker@ucdavis.edu Lab Website 2109 Meyer Hall Bio Education B.S., Animal Science and Management, University of California, Davis, California, 1998. Ph.D., Animal Science, University of British Columbia, Vancouver, Canada, 2003. Research Interests Research in my laboratory focuses on assessment and improvement of animal welfare. I am particularly interested in how the behavior of dairy cattle changes in response to controversial procedures (e.g. tail docking, disbudding), management decisions (e.g. stocking density), and housing design (e.g. type and quantity of free-stall bedding, effects of inclement weather). Graduate Groups Animal Behavior Animal Biology Courses Taught Principles and Applications of Domestic Animal Behavior (ANS104) Laboratory in Domestic Animal Behavior (ANS106) Advanced Animal Welfare (ABG203) People For the current information about our lab members please visit the Tucker Lab Website Selected Publications For an updated list of publications please visit Dr. Tucker's Google scholar website Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: March 25, 2021 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Payam Vahmani, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Payam Vahmani, Ph.D. Breadcrumb Home People Faculty Payam Vahmani, Ph.D. Position Title Assistant Professor, Nutritional Enhancement of Animal Sourced Foods pvahmani@ucdavis.edu Lab Website Bio Education B.S., Animal Science, Bahonar University of Kerman, 2003 M.S., Animal Nutrition, Ferdowsi University of Mashhad, 2006 Ph.D., Ruminant Nutrition, Dalhousie University, 2013 Research Interests My research interests include: Enhancing the nutritional and health value of animal-sourced foods for human consumption Developing nutritional and management strategies to enhance the level of bioactive nutrients in animal-sourced foods Examining health effects of functional/nutritionally enhanced animal-sourced foods using cell culture, animal models and clinical trials Studying how animal-sourced foods foster human health (i.e. prevent chronic diseases and nutrient deficiencies), and their role in food security Nutrient requirements for humans are similar to animals, changing with stage of life and health status. To meet people’s needs for health, longevity and quality of life, Animal Nutrient Farming can be used to manipulate and match foods to better meet personalized requirements. The overall goal of my research program is to develop effective nutritional and management strategies to enhance the nutritional and health value of animal-sourced foods (meat, milk, poultry, fish and eggs), while promoting animal health and sustainable animal-based food production. To accomplish this, my lab conducts animal feeding studies at both the whole animal and molecular level to identify/develop animal products enriched with bioactive nutrients, complemented by studies on their biochemical, physiological and gene expression effects in cell culture and animal disease models. In addition, we synergistically work with other University and Government researchers to follow-up on human health effects (i.e. clinical trials), carbon footprint (e.g. enteric methane emissions), as well as sensory and quality/manufacturing properties of nutritionally enhanced animal sourced foods. Publication list on Google Scholar Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 13, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Alison Van Eenennaam, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Alison Van Eenennaam, Ph.D. Breadcrumb UC Davis Department of Animal Science Extension Alison Van Eenennaam, Ph.D. Position Title Extension Specialist: Animal Biotechnology and Genomics 530-752-7942 alvaneenennaam@ucdavis.edu Lab Website Twitter: @biobeef Blog Google Scholar Address ORCID Id 2113 Meyer Hall Bio Education B.S., (Hons.),Agricultural Science, University of Melbourne, Victoria, Australia, 1987 M.S., Animal Science, University of California, Davis, CA, 1990 Ph.D., Genetics, University of California, Davis, CA, 1997 Research Interests The mission of the Animal Genomics and Biotechnology Program is to provide research and education on the use of animal genomics and biotechnology in livestock production systems.\" The research focus of my lab is the use of DNA-based biotechnologies in beef cattle production and agricultural systems. Outreach Publications Fact Sheets General Information Sheets Biotechnology and Genomics in the News Presentations Videos Awards 2022 Academic Federation Excellence in Graduate and Professional Teaching or Mentoring Award 2021 Beef Improvement Foundation Ambassador Award (to eBEEF) 2021 Beef Improvement Foundation Pioneer Award 2019 ASAS National Rockefeller Prentice Breeding and Genetics Award 2019 James H. Meyer Distinguished Achievement Award 2017 American Association for the Advancement of Science Fellow 2016 BIO 2016 Future Maker Award 2016 Beef Improvement Federation (BIF) Continuing Service Award 2014 Council for Agricultural Science and Technology (CAST) Borlaug Communication Award 2014 American Society of Animal Science Extension Award 2013 American Association of Animal Science (ASAS) Video Competition Winner for 5 minute You Tube video “Gene Shop” 2013 Association for Communication Excellence in Agriculture, Natural Resources, and Life and Human Sciences (ACE) Honorable mention for video “Were those the days my friend?” 2012 American Association of Animal Science (ASAS) Video Competition Winner for 5 minute video “Were those the days my friend?” 2010 American Association of Public and Land-Grant Universities (APLU), 2010 National Award for Excellence in Extension 2010 American Society of Animal Science, Western Section Extension Award 2010 Association for Communication Excellence (ACE) Bronze Award for “Animal Biotechnology” Educational Video Production 2009 University of California Agriculture and Natural Resources (ANR) “Outstanding New Professional Distinguished Service Award 2009” 2009 University of California, Davis “2009 Academic Federation Award for Excellence in Research” 2009 The Communicator “Award of Distinction” for “Animal Biotechnology” video production 2005 The Communicator “Award of Distinction” for “Genetic Engineering in California Agriculture” video Current projects See my laboratory page Graduate Groups Animal Biology Integrative Genetics and Genomics People Research Staff Josephine Trott, PhD, Project Scientist Nicholas Werry, PhD, Postdoctoral Scholar Current Graduate Students Oluwafemi Falade, PhD student, Animal Biology. Expected Graduation Date 2027 Austin Brown B.S., M.S. student, Animal Biology. Expected Graduation Date: 2024 Mitchell Angrove B.S., M.S. student, Animal Biology. Expected Graduation Date: 2024 María Florencia Casale D.V.M., M.S. student, Animal Biology. Expected Graduation Date: 2024 Former Research Staff Alba Verónica Ledesma, PhD, Postdoctoral Scholar Tom Bishop, PhD, Postdoctoral Scholar Joey Owen, PhD, Postdoctoral Scholar Amy E. Young, Staff Research Associate Catalina Cabrera, DVM, MPVM, Junior Specialist Justin Buchanan, PhD, Postdoctoral Scholar Anke Schennink, Ph.D., Postdoctoral Scholar Kasey DeAtley, Ph.D., Postdoctoral Scholar Shawn Yarnes, Ph.D., Project Scientist Kerri Clark, Ph.D., Postdoctoral Scientist Kristine A. Lewis, Staff Research Associate Past Graduate Students Maci Mueller, Ph.D. Animal Biology 2023 Devon Fitzpatrick, M.S. Animal Biology 2022 Jason Lin, M.S. Animal Biology 2022 Joseph Owen, Ph.D. Integrative Genetics and Genomics 2019 Maci Mueller, M.S. Animal Biology 2018 Lindsay Upperman, M.S. Animal Biology 2017 Sasha Dubrovsky, M.S. Animal Biology 2016 Bryan Welly, M.S. Animal Biology 2014 Kristina Weber, Ph.D. Animal Biology 2013 Krista Cooprider, M.S. Animal Biology 2010 Andrew Wong, Ph.D. Integrative Genetics and Genomics 2009 William Pohlmeier, M.S. Animal Biology 2008 Kristin Deines, M.S. Animal Biology 2007 Kathleen Bongiovanni, M.S. Genetics 2006 Rachael Sondeno, M.S. Genetics 2006 Beth Kao, M.S. Animal Biology 2005 Selected Publications Alison Van Eennnaam's Selected Publications Outreach, and Applied Research Alison Van Eennnaam's Outreach and Applied Research Spotlight on Research Animal geneticist Alison Van Eenennaam discovered it is possible to splice the 'hornless' gene from Aberdeen Angus cattle into the widespread black-and-white Holstein dairy cows so that they are born without protrusions. More Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: February 21, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Jason Watters, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Jason Watters, Ph.D. Breadcrumb Home People Faculty Jason Watters, Ph.D. Position Title Associate Adjunct Professor 415-213-8128 jvwatters@ucdavis.edu Bio Education B.S., Wildlife and Fisheries Conservation Biology, University of California, Davis, 1997. Ph.D., Animal Behavior, University of California, Davis, 2003. Research Interests Animal behavior, animal welfare, conservation behavior; behavioral assays of animal welfare, environmental enrichment for zoo and aquarium animals; zoo animal behavior and its impact on zoo-goers. Positions Executive Editor ­ Zoo Biology Graduate Groups Animal Biology Courses Taught Integrated Animal Biology II (ABG 200B) People Current Graduate Students Eridia Pacheco, Ph.D. Program, Animal Biology Graduate Group. Expected Graduation Date: Fall 2019. Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: November 29, 2023 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Xiang (Crystal) Yang, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Xiang (Crystal) Yang, Ph.D. Breadcrumb Home People Faculty Xiang (Crystal) Yang, Ph.D. Position Title Associate Professor Meat Scientist 530-752-6590 xcryang@ucdavis.edu Lab Website 2237 Meyer Hall Bio Education B.S.,  Colorado State University, 2010 (Animal Science) M.S., Colorado State University, 2012 (Animal Science/Meat Science) Ph.D.,  Colorado State University, 2015 (Animal Science/Meat Science) Research Interests Meat safety; meat quality; shelf-life of meat and meat products; post-harvest foodborne pathogen control; characterizing pathogen and whole microbial community profiles present in meat production chain; effect of feeding system on degree of antimicrobial resistance and pathogen prevalence in livestock and poultry. My research interests include the evaluation and validation of new antimicrobial chemicals and interventions against foodborne pathogens, as well as the investigations of the influence meat safety strategies have on the quality and shelf-life of meat products. In addition to applied investigations of meat safety, I also plan to continue my research characterizing degree of antimicrobial resistance, pathogen and whole microbial community profiles present in different meat and poultry production chains in order to gain a more comprehensive understanding of how pathogens and bacteria interact with different food matrices using novel technologies, such as next generation sequencing. Overall, the goal of our research is to continue to assist in industry efforts to deliver highly safety, affordable meat that are high in quality and nutritional values to national and global consumers. Graduate Groups Animal Biology Food Science Selected Publications Yang X, Noyes NR, Doster E, Martin JN, Linke LM, Magnuson RJ, Yang H, Geornaras I, Woerner DR, Jones KL, Ruiz J, Boucher C, Morley PS and Belk KE. Use of metagenomic shotgun sequencing technology to detect foodborne pathogens within the microbiome of the beef production chain. Appl. Environ. Microbiol. 2016. 82(8):2433-43 N. R. Noyes, X. Yang, L. M. Linke, R. J. Magnuson, A. T. Dettenwanger, C. A. Boucher, I. Geornaras, H. Yang, D. R. Woerner, P. S. Morley, and K. E. Belk. Resistome diversity in cattle and the environment decreases during beef production. eLife. 2016;5:e13195 Scott, B., Yang, X., Geornaras, I., Delmore, Woerner, D. R., Adler, J., and Keith Belk. Antimicrobial efficacy of a lactic acid and citric acid blend against Shiga toxin-producing Escherichia coli, Salmonella and nonpathogenic Escherichia coli biotype I on inoculated warm beef carcass surface tissue. J. Food Prot. 2015; 78(12):2136-2142 Yang X, Woerner DR, McCullough KR, Hasty JD, Geornaras I, Smith GC, Sofos JN, Belk KE. 2016. An evaluation of the effectiveness of FreshCase technology to extend the storage life of whole-muscle pork and ground pork sausage. J Anim Sci. 94(11):4921 – 4929 Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 22, 2023 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Huaijun Zhou, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Huaijun Zhou, Ph.D. Breadcrumb Home People Faculty Huaijun Zhou, Ph.D. Spotlight on Research Research by Huaijun Zhou aims to use new discoveries in chicken genome research to help breed a chicken more resistant to disease and heat stress. More Position Title Professor and Chancellor’s Leadership Professor Director of USAID Feed the Future Innovation Lab for Genomics to Improve Poultry 530-752-1034 hzhou@ucdavis.edu Lab Website 2247 Meyer Hall Bio Education M.S., Bioinformatics and Computational Biology, Iowa State University. Ph.D., Immunogenetics and Molecular Genetics Iowa State University. Honors and Awards 2024 Inaugural Top Agrifood Pioneers (TAP), World Food Prize Foundation 2023 Chancellor's Leadership Professor 2023 The National Academy of Sciences Prize in Food and Agriculture Sciences 2020 Prize for Outstanding Achievement in Science, Agriculture and Agri-Food Canada 2020 Chancellor’s Awards for International Engagement 2018 Zoetis Fundamental Science Award (PSA) 2016 - Evonik Degussa Award for Achievement in Poultry Science 2014 - Chancellor’s Fellow 2013 - The American Association of Immunologists Early Career Faculty Travel Award 2011 - PSA Early Achievement Award for Research 2010 - Hy-Line International Research Award 2009 - Big 12 Faculty Fellowship 2009 - Outstanding Overseas Young Investigator Award, NSF China 2004 - Natural Sciences and Engineering Research Council of Canada (NSERC) Fellowship 2002 - Research Excellence Award, Iowa State University News Huaijun Zhou was selected 2024 inaugural Top Agrifood Pioneers (TAP) Huaijun Zhou wins 2023 National Academy of Sciences prize ; FFAR Press Release Our research program was highlighted at the UC Davis CA&ES Outlook Spring 2017: https://ucdavis.github.io/caes3dissue/Outlook-Spring17/ https://egghead.ucdavis.edu/2021/03/23/researchers-uncover-important-genetic-code-of-chickens-cattle-and-pigs/ Research Projects USAID Project: Feed the Future Innovation Lab for Genomics to Improve Poultry (GIP) : Improving food security in Africa by enhancing resistance to Newcastle disease and heat stress in chickens. Followings are selected media reports about this project: Feed the Future Fox40 News on November 8, 2013 UC Davis GlobalMeat Feedstuffs UC Health The Davis Enterprise Daily Democrat High Plains/Midwest AG Journal feedlink Examiner 5M Poultry USDA NIFA project: Functional Annotation of Regulatory Elements in Livestock Species . This project is one of pilot projects of FAANG consortium ( www. FAANG.org ). The overall goal of this project is to generate a comprehensive resource of functional genomic elements for the chicken, cattle, and pig genomes. Our specific goals are: Annotate chromatin states corresponding to DNase hypersensitivity, four histone modifications, and one transcription factor Annotate promoters, enhancers, and silencers by integrating information from RNA-seq, DNAse-seq, and ChIP-seq against four histone modifications and one transcription factor. Freely distribute all raw and annotated data via UCSC Genome Browser and Ensembl. NIH-NIFA Dual Purpose with Dual Benefits project: Development of Colonization Resistance in Chicks . Our long-range goal is to understand the mechanisms that govern the interactions between the host and its gut-associated microbial communities. The objectives of this application are to study the mechanism of colonization resistance and devise strategies to prevent a bloom of Proteobacteria after hatching. Specific Aim 1: Determine the mechanism by which obligate anaerobic bacteria confer colonization resistance against Proteobacteria in newly hatched chicks Specific Aim 2: Determine whether a treatment that enhances colonization resistance accelerates development of a mature microbial community structure in newly hatched chicks. USDA NIFA National Need Fellowship Project: Genomics for Improving Animal Production (GIAP) USDA NIFA Bioinformatics Project: The Animal Systems Biology Analysis and Modeling Center (ASBAMC) Graduate Groups Animal Biology Immunology Integrative Genetics and Genomics Microbiology Courses Taught Animal Health and Disease, offered in Spring (ANS 150) Avian Biology, offered in Spring (AVS 100) People A full list of current and past lab members is available on the Zhou Laboratory website. Selected Publications Dr. Huaijun Zhou has published a total of 150 peer-reviewed papers, five book chapters and more than 240 peer-reviewed abstract and/or meeting proceedings. Pan Z, Y. Wang, M. Wang, Y. Wang, X. Zhu, S. Gu, C. Zhong, L. An, M. Shan , J. Damas, M. M. Halstead, D. Guan, N. Trakooljul, K. Wimmers, Y. Bi, S. Wu, M. E. Delany, X. Bai, H.H. Cheng, C. Sun, N. Yang, X. Hu, H. A Lewin, L. Fang, H. Zhou. 2023. An atlas of regulatory elements in chicken: a resource for chicken genetics and genomics. Sci. Adv. 9,eade1204. DOI:10.1126/sciadv.ade1204 Sun, Y.H., Cui, H., Song, C. J. Shen, X. Zhuo, R. Wang, X.Yu, R. Ndamba, Q. Mu, H. Gu, D. Wang, G. G. Murthy, P. Li, F. Liang, L. Liu, Q. Tao, Y. Wang, S. Orlowski, Q. Xu, H. Zhou, J. Jagne, O. Gokcumen, N. Anthony, X. Zhao, and X. Li. Amniotes co-opt intrinsic genetic instability to protect germ-line genome integrity. Nat Commun 14, 812 (2023). https://doi.org/10.1038/s41467-023-36354-x D. Guan, M. Halstead, A. D Islas-Trejo, D. Goszczynski, H. Cheng, P. J. Ross, H. Zhou. 2022. Prediction of transcript isoforms in 19 chicken tissues by Oxford Nanopore long-read sequencing. Front Genet. 2022 doi: 10.3389/fgene.2022.997460. Y. Yao, S Liu,C. Xia, Y. Gao, Z. Pan, O. Canela‑Xandri, A. Khamseh, K. Rawlik, S. Wang, B. Li, Y. Zhang, E. Pairo‑Castineira, K. D’Mellow, X. Li, Z. Yan, C. Li, Y. Yu, S. Zhang, L. Ma, J. B. Cole, P. J. Ross, H. Zhou, C. Haley, G. E. Liu, L. Fang and A. Tenesa. 2022. Comparative transcriptome in large‑scale human and cattle populations. Genome Biology 23:176. https://doi.org/10.1186/s13059-022-02745-4 Pan, Z., Y. Yao, H. Yin, Z.Cai, Y. Wang, L. Bai, C. Kern, M. Halstead, G. Chanthavixay, N. Trakooljul, K. Wimmers, G. Sahana, G. Su, M. Lund, M. Fredholm, P. Karlskov-Mortensen, C. W. Ernst, P. Ross, C. K. Tuggle, L. Fang & H. Zhou. Pig genome functional annotation enhances the biological interpretation of complex traits and human disease. Nat Commun 12, 5848 (2021). https://doi.org/10.1038/s41467-021-26153-7 KKZ Mon, C Kern, G Chanthavixay, Y Wang, H Zhou. 2021. Tolerogenic Immunoregulation towards Salmonella Enteritidis Contribute to Colonization Persistence in Young Chicks. Infect Immun doi: 10.1128/IAI.00736-20. Aston EJ, Wang Y, Tracy KE, Gallardo RA, Lamont SJ. Zhou H. 2021. Comparison of cellular immune responses to avian influenza virus in two genetically distinct, highly inbred chicken lines. Vet Immunol Immunopathol. 235:110233. doi: 10.1016/j.vetimm.2021.110233. M. Tixier-Boichard, S. FABRE, S. Dhorne-Pollet, A. Goubil, H. Acloque, S. Vincent-Naulleau, P. Ross, Y. Wang, G. Chanthavixay, H. Cheng, C. Ernst, V. Leesburg, E. Giuffra, H. Zhou. 2021. Tissue resources for the functional annotation of animal genomes\" Frontiers in Genetics. https://doi.org/10.3389/fgene.2021.666265 . M. M. Halstead, D. E. Goszczynski, A. D. Islas-Trejo, H. Zhou and P. J. Ross. 2021. Large-scale multiplexing permits full-length transcriptome annotation of 32 bovine tissues from a single Nanopore flow cell. Front. Genet. | doi: 10.3389/fgene.2021.664260. Kern, C., Wang, Y., Xu, X. M. Halstead, J. I. Korf, M. Delany, H. Cheng, J. F. Medrano, A. Van Eenennaam, C. W. Ernst. P. Flicek, G. Quon, J. Ross. Zhou, H. 2021. Functional genome annotations of three domestic animal species provide a vital resource for comparative and agricultural research. Nature Communications 12, 1821. https://doi.org/10.1038/s41467-021-22100-8. Daniel E. Goszczynski, Michelle M. Halstead, Alma D. Islas-Trejo, Huaijun Zhou and Pablo J. Ross 2021. Transcription initiation mapping in 31 bovine tissues reveals complex promoter activity, pervasive transcription, and tissue-specific promoter usage Genome Res. 31: 732-744 Kebschull JM, Richman EB, Ringach N, Friedmann D, Albarran E, Kolluru SS, Jones RC, Allen WE, Wang Y, Cho SW, Zhou H, Ding JB, Chang HY, Deisseroth K, Quake SR, Luo L. Cerebellar nuclei evolved by repeatedly duplicating a conserved cell-type set. Science. 2020 Dec 18;370(6523):eabd5059. doi: 10.1126/science.abd5059. PMID: 33335034. Chanthavixay, K., C. Kern, Y. Wang, Saelao, P., R. Gallardo, S.J. Lamont, G. Rincon, Zhou, H. 2020. Integrated Transcriptome and Histone Modification Analysis Reveals NDV Infection Under Heat Stress Affects Bursa Development and Proliferation in Susceptible Chicken Line. Frontiers in Genetics. http://doi.org/10.3389/fgene.2020.567812 Wang, Y, Saelao, K. Chanthavixay P., R. Gallardo, D,A, Bunn, S.J. Lamont. J.K. Dekkers, T. R. Kelly, Zhou, H. 2020. Liver Transcriptome Responses to Heat Stress and Newcastle Disease Virus Infection in Genetically Distinct Chicken Inbred Lines. Genes 11(9), 1067; https://doi.org/10.3390/genes11091067 . Ana Paula da Silva, E. Aston, G. Chiwanga, A. Birakos, A. Muhairwa, B. Kayang, T. Kelly, H. Zhou, RODRIGO GALLARDO 2020, Molecular Characterization of Newcastle Disease Viruses Isolated from Chickens in Tanzania and Ghana. Viruses  12, 916; doi:10.3390/v12090916 Walugembe M, Amuzu-Aweh EN, P. K. Botchway, A. Naazie, G. Aning, Wang Y, Saelao P, Kelly T, Gallardo RA, Zhou H, Lamont SJ, Kayang B.B., Dekkers JCM. 2020. Genetic Basis of Response of Ghanaian Local Chickens to Infection With a Lentogenic Newcastle Disease Virus. Front. Genet., https://doi.org/10.3389/fgene.2020.00739 . Kim, T.H., C. Kern, and H. Zhou. 2020. Knockout of IRF7 Highlights its Modulator Function of Host Response Against Avian Influenza Virus and the Involvement of MAPK and TOR Signaling Pathways in Chicken. Genes 11, 385; doi:10.3390/genes11040385 K. K.Z. Mon, Y. Zhu, G. Chanthavixay, C. Kern and H. Zhou. 2020. Integrative analysis of gut microbiome and metabolites revealed novel mechanisms of intestinal Salmonella carriage in chicken. Sci Rep. 10, Article number: 4809. www.nature.com/articles/s41598-020-60892-9 Halstead M., C. Kern, Saelao, P. G. Chanthavixay, Y. Wang, M. Delany, H. Zhou, P. Ross. 2020. Systematic alteration of ATAC-seq for profiling open chromatin in cryopreserved nuclei preparations from livestock tissues. Sci Rep 10, Article number: 5230. https://www.nature.com/articles/s41598-020-61678-9 Walugembe M, Mushi JR, Amuzu-Aweh EN, Chiwanga GH, Msoffe PL, Wang Y, Saelao P, Kelly T, Gallardo RA, Zhou H, Lamont SJ, Muhairwa AP, Dekkers JCM. 2019. Genetic Analyses of Tanzanian Local Chicken Ecotypes Challenged with Newcastle Disease Virus. Genes (Basel). 2019 Jul 17;10(7). pii: E546. doi: 10.3390/genes10070546. Giuffra E, Tuggle CK; Archibald AL, Acloque H, Chamberlain AJ, Cochrane G, Daetwyler HD, Djebali S, Eory L, Foissac S, Goddard ME, Groenen MA, Halstead M, Harrison PW, Hayes BJ, Kern C, Khatib H, Kuo RI, MacHugh DE, Macleod IM, Madsen O, Reecy JM, Ross PJ, Watson M, Wells JM, Zhou H. 2019. Functional Annotation of Animal Genomes (FAANG): Current Achievements and Roadmap. Annu Rev Anim Biosci. 7:65-88. doi: 10.1146/annurev-animal-020518-114913. Litvak Y., K.K.Z. Mon, H. Nguyen, G. Chanthavixay, M. Liou, E. M. Velazquez, L. Kutter, M. A. Alcantara, M. X. Byndloss, C.R. Tiffany, G. T. Walker, F. Faber, Y. Zhu, D. N. Bronner, A. J. Byndloss, R. M. Tsolis, H. Zhou. A. J. Baumler. 2019. Commensal Enterobacteriaceae protect against Salmonella colonization by competing for oxygen. Cell Host & Microbes 25, 1-12https://doi.org/10.1016/j.chom.2018.12.003 Saelao, P., Y. Wang, G. Chanthavixay, V. Yu, J. Dekkers, R. Gallardo, T.R. Kelly, S.J. Lamont. Zhou, H. 2018. Integrated proteomic and transcriptomic analysis of differential expression of chicken lung tissue in response to NDV infection during heat stress. Genes 9, 579; doi:10.3390/genes9120579 Kim, T.H. and H. Zhou. 2018. Overexpression of chicken IRF7 increased viral replication and programmed cell death to the avian influenza virus infection through TGF-beta/FoxO signaling axis in DF-1. Frontiers in Genetics. doi: 10.3389/fgene.2018.00415. Saelao, P., Y. Wang, K. Chanthavixay, J. Dekkers, R. Gallardo, T.R. Kelly, S.J. Lamont. H. Zhou. 2018. Novel insights into the host immune response of chicken Harderian gland tissue during Newcastle disease virus infection and heat treatment. BMC Veterinary Research https://doi.org/10.1186/s12917-018-1583-0 Kern, C. P. P. Saelao, Y. Wang, M. Halstead, J. L. Chitwood, I. Korf, M. Delany, H. Cheng, J. F. Medrano, A. Van Eenennaam, C. W. Ernst. J. Ross, H. Zhou. 2018. Genome-wide identification of tissue-specific long non-coding RNA in three farm animal species. BMC Genomics https://doi.org/10.1186/s12864-018-5037-7. K. Rowland. Wolc. J. H. Zhou, R. Gallardo, T. Kelly, A. Dekkers, Lamont. S.J. 2018. Genome-wide association study of a commercial egg laying line challenged with Newcastle disease virus. Front. Genet., | https://doi.org/10.3389/fgene.2018.00326 Wilson B. K, T. Kelly, D.A. Bunn, and H. Zhou. 2018. Key criteria and models for implementing a sustainable chicken breeding and distribution program for smallholder poultry producers. Livestock Research for Rural Development. 30 (4), Article #67. Retrieved April 13, 2018, http://www.lrrd.org/lrrd30/4/wils30067.html. Zhang J, Kaiser MG, Deist MS, Gallardo RA, Bunn DA, Kelly TR, Dekkers JCM, Zhou H, Lamont SJ. Transcriptome Analysis in Spleen Reveals Differential Regulation of Response to Newcastle Disease Virus in Two Chicken Lines. Sci Rep. 2018 Jan 19;8(1):1278. doi: 10.1038/s41598-018-19754-8. Zar Mon, K. K., P. Saelao, M. M. Halstead, G. Chanthavixay, H.-C. Chang, L. Garas, E. A Maga and H. Zhou. 2016. Salmonella enterica serovars Enteritidis infection alters the indigenous microbiota diversity in young layer chicks. Front. Vet. Sci. - Veterinary Infectious Diseases. 2:61. doi: 10.3389/fvets.2015.00061. Li J, Li R, Wang Y, Hu X, Zhao Y, Li L, Feng C, Gu X, Liang F, Lamont S, Hu S, Zhou H*, Li N. 2015. Genome-wide DNA methylome variation in two genetically distinct chicken lines using MethylC-seq. BMC Genomics, 16 :851 (23 October 2015) Kim, T.H, H. Zhou. 2015. Functional Analysis of Chicken IRF7 in Response to dsRNA Analog Poly(I:C) by Integrating Overexpression and Knockdown: 10.1371/journal.pone.0133450. Schmid M. et al. H. Zhou. 2015.Third Report on Chicken Genes and Chromosomes.  Cytogenet Genome Res 145:78-179 (DOI:10.1159/000430927). Leif, A. et al. H. Zhou, The FAANG Consortium.  2015. Coordinated international action to accelerate genome-to-phenome with FAANG, the Functional Annotation of Animal Genomes project. Genome Biology 16:57. DOI: 10.1186/s13059-015-0622-4 Abernathy, J., Li, X., Jia, X., Chou, W., Lamont, S.J., Crooijmans, R., and Zhou, H. 2014. Copy number variation in Fayoumi and Leghorn chickens analyzed using array comparative genomic hybridization. Animal Genetics. doi: 10.1111/age.12141. Wang Y, Lupiani B, Reddy S, S. J. Lamont, Zhou H. 2014. RNA-seq analysis revealed novel genes and signaling pathway associated with disease resistance to avian influenza virus infection in chickens. Poultry Science. 93(2):485-93. doi: 10.3382/ps.2013-03557. Wang, Y., V. Brahmakshatriya, B. Lupiani, S. M Reddy, B. Soibam, A. L Benham, P. Gunaratne, H.Liu, M. Trakooljul, N. Ing, R. Okimoto and H. Zhou 2012. Integrated Analysis of microRNA Expression and mRNA Transcriptome in Lungs of Avian Influenza Virus Infected Broilers. BMC Genomics 13:278 (Highly assessed) Wang Y, N. Ghaffari, C. D. Johnson, U. M. Braga-Neto, H. Wang, R. Chen, H. Zhou. 2011 Evaluation of the coverage and depth of transcriptome by RNA-Seq in chickens. BMC Bioinformatics 12: doi:10.1186/1471-2105-12-S10-S5. Li X., C. L. Swaggerty, M. H. Kogut, H. Chiang, Y. Wang, K. J. Genovese, H. He, H. Zhou. 2010. Gene expression profiling of the local cecal response of genetic chicken lines that differ in their susceptibility to Campylobacter jejuni colonization. PLoS ONE 5(7): e11827. doi:10.1371/journal.pone.0011827 Wang Y., V. Brahmakshatriya, B. Lupiani, S. Reddy, B. Yoon, H. Zhu, P. Gunaratne, R. Chen, J. Wang, H. Zhou. 2009. Identification of differentially expressed microRNAs In chicken lung and trachea with avian influenza virus infection by Solexa Sequencer. BMC Genomics 10:512. (Highly assessed) Chiang, H.I., C. Swaggerty, M. Kogut, S. Dowd, X. Li, I. Pevzner, and H. Zhou. 2008. Gene expression profiling in chicken heterophils with Salmonella enteritidis stimulation using a chicken 44K Agilent microarray. BMC Genomics 9:526. Li, X.Y, H.I. Chiang, J. Zhu, S. Dowd and H. Zhou. 2008. Characterization of newly developed chicken 44K Agilent microarray. BMC Genomics 9:60. (Highly assessed) Wong, G. K., H Zhou et al.  2004.  A genetic variation map for chicken with 2.8 million single-nucleotide polymorphisms.  Nature 432:717-722. Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: October 15, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Richard Zinn, Ph.D. | UC Davis Department of Animal Science Skip to main content Menu UC Davis Department of Animal Science Open Search Search Quick Links + Directory Advising Center Job Openings Safety Weekly Newsletter Resources Standard Operating Procedures Sitemap Make a gift Alumni & Friends Conference Rooms Main navigation (extended config) Home About Welcome Vision & Goals Steward the Environment Breed Better Animals Promote Animal Welfare Reveal the Complex Biology of Animals Produce Healthy Food from Healthy Animals Translate Science from Bench to Benefit Enhance Sustainable Animal Production Inspire Future Leaders Programs and Centers Sustainability History Alumni & Friends Resources Diversity Commitment Support Our Program Job Openings Contact People Faculty Emeriti Postdocs and Visiting Scholars Project Scientists Staff Alumni & Friends Academics Undergraduate Majors Minors Advising Center Internships Financial Assistance Clubs & Organizations Handouts & Resources Careers Interested in Vet School? Graduate Courses Why UC Davis? Why study Animal Science? How to Apply Extension Overview Specialists Farm Advisors Animal Biotechnology Aquaculture Livestock Air Quality Livestock Systems Management Livestock Waste Management Poultry Software Facilities Facility Recharge Rates Biosecurity Aquatic Facilities Avian Facilities Beef Cattle Facilities Cole Facility Dairy Teaching & Research Facility Goat Research Facility Horse Barn Meat Laboratory Sheep Facilities Small Animal Colony Swine Teaching and Research Center News & Events News Seminars Events Jobs Richard Zinn, Ph.D. Breadcrumb Home People Faculty Richard Zinn, Ph.D. Position Title Professor Desert Research & Extension Center 760-756-3068 razinn@ucdavis.edu Bio Education B.S., Animal Science, Brigham Young University, Utah, 1974. M.S., Animal Science, Brigham Young University, Utah, 1975. Ph.D., Nutrition (Ruminant), University of Kentucky, Kentucky, 1978 Research Interests Nutrition, health, and management of feedlot cattle. Postal Address Dr. Richard Zinn Desert R and E Center 1004 E Holton Rd, Holtville, CA 92243 USA Graduate Groups Animal Biology Selected Publications Ruminal Alkalizing Potential Of Brucite (Magnesium Hydroxide) And Sodium Bicarbonate For Feedlot Cattle Influence of Protein Supplementation on the Feeding Value of Dry Rolled and Steam-Flaked Corn in Diets for Feedlot Cattle Immediate And Carryover Effects Of Short-Term Therapeutic Feeding Of Chlortetracycline On Digestive Function In Feedlot Steers A Guide to Feed Mixing Influence Of Flocculent Coating On The Feeding Value Of Cottonseed Meal And Steam-Flaked Corn For Feedlot Cattle Implant Strategies For Calf-Fed Holstein Steers Influence of Fluctuating Feed Intake on Feedlot Cattle Growth-Performance and Digestive Function Influence Of Potassium Spiking On Marketing Shrink And Carcass Characteristics Of Feedlot Steers Influence Of Tempering On The Feeding Value Of Steam-Flaked Sorghum For Feedlot Cattle Toxic Effects Of High Dietary Sulfur On Growth Performance Of Feedlot Calves During The Early Growing Phase Subcutaneous Versus Intramuscular Administration Of Vitamin E In Feedlot Calves Fat Quality And Feeding Value Of Fat For Feedlot Cattle Influence Of Yeast Culture On Health, Performance And Digestive Function Of Feedlot Steers Ruminal Undigestible Intake Protein Value And Post Ruminal Digestibility Of Menhaden Fish Meal Versus Two High-Bypass Animal Protein Blends In An 88% Concentrate Finishing Diet For Feedlot Cattle Effects Of Dietary Calcium Levels On Growth-Performance And Digestive Function In Cattle Fed A High-Fat Finishing Diet Influence Of Method Of Supplementation On The Utilization Of Supplemental Fat By Feedlot Steers Effects Of Program-Feeding Strategies On Growth-Performance And Carcass Characteristics Of Feedlot Cattle Feeding Value of Cottonseed Meal for Feedlot Cattle Influence Of Dietary Sulfur Level On Growth-Performance And Digestive Function In Feedlot Cattle Influence Of The -Agonist, Zilpaterol, On Growth Performance And Carcass Characteristics Of Feedlot Steers Alpharma Symposium - Performance Variance 6-28-10 Department of Animal Science, 2251 Meyer Hall, One Shields Ave, Davis CA 95616-5270 | 530-752-1250 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: March 25, 2021 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm ."
]