[
    "College of Biological Sciences - Keith Baar Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Keith Baar Breadcrumb Home Faculty Keith Baar Position Title Professor Neurobiology, Physiology and Behavior Physiology and Membrane Biology 530-752-3367 kbaar@ucdavis.edu Lab website Google Scholar 195 Briggs Hall Bio Research Interests Muscle hypertrophy How resistance exercise is sensed by muscle and how does it lead to an increase in protein synthesis and muscle mass? Research from our laboratory has identified the mammalian target of rapamycin (mTORC1)/S6 protein kinase (S6K1) pathway as the central mechanism involved in physiological hypertrophy of skeletal muscle in response to resistance exercise. It is now clear that resistance exercise activates mTORC1 and that this activation is important in increasing muscle's capacity to boost protein synthesis. By studying the control of rDNA synthesis, we hope to identify molecules that are critical for this process and that can reproduce the increase in muscle mass without the need for the exercise stimulus Muscular endurance How is endurance exercise transduced into changes in mitochondrial mass and fatigue resistance? Unlike resistance exercise, endurance exercise results in a coordinated genetic response that increases aerobic capacity. Our laboratory and others have identified a central transcriptional cofactor that is activated following a single bout of aerobic exercise. The peroxisome proliferative activated receptor, gamma coactivator (PGC)-1α is a master regulator of mitochondrial biogenesis and enzymes of fatty acid metabolism. It is now clear that many stimuli converge on PGC-1 and that a number of these molecules also inhibit the activation of the mTORC1/S6K1 pathway. Understanding this interplay will be essential if we are to develop genetic or pharmacological interventions to create bigger, stronger, and more fatigue resistant muscles. Ligament engineering Can we engineer ligaments to replace people's damaged ACLs? In our bodies, ligaments connect bone to bone, are essential to normal movement and do not repair very well. We have developed a series of calcium phosphate based cements that we are using to recreate the ligament to bone connection. Our engineered ligaments are developmentally similar to embryonic ligament. Using these constructs and our calcium phosphate cements, we have engineered the first in vitro ligament (bone-ligament-bone) with the hope of implanting these tissues into animals and in the future using them to repair ligaments in humans after rupture. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Biomedical Engineering Graduate Group Molecular, Cellular and Integrative Physiology Education and Degree(s) 1992 B.S. in Kinesiology, University of Michigan 1994 M.A. in Human Biodynamics, University of California, Berkeley 2000 Ph.D. in Physiology and Biophysics, University of Illinois Publications Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Keith Baar Pick Up the Pace: Exercise Intensity Matters More For Your Health Than Steps May 23, 2023 Intermittent Fasting, Balanced or a Keto Diet? Food for Thought April 20, 2023 The Keto Diet’s Muscle and Brain Boost February 23, 2023 Bios Magazine: Exercise and Your Body November 08, 2019 Biology Undergraduate Scholars Program Celebrates 30 Years of Inspiring Change in the Life Sciences April 19, 2019 Pagination Page 1 Next page Next Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Karen L. Bales | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Karen L. Bales Breadcrumb Home Faculty Karen L. Bales Position Title Professor Neurobiology, Physiology, and Behavior Psychology she/her/hers 530-754-5890 klbales@ucdavis.edu Lab website Google Scholar ORCID (0000-0001-5826-2095) 1129 Green Hall Bio Research Interests Professor Bales studies the neurobiology and physiology of pair bonding in socially monogamous species. She works with prairie voles (Microtus ochrogaster), titi monkeys (Plecturocebus cupreus), and lined seahorses (Hippocampus erectus), all species in which males and females form pair-bonds, and males have a role in infant care. In particular, she is interested in the role of neuropeptides such as oxytocin and vasopressin in these behaviors, as well as the effects of early experiences on the development of these behaviors. She is currently investigating the mechanisms for pair bonding in seahorses; the role of pair bond quality in healthy aging in prairie voles; and the role of the kappa opioid receptor in titi monkey pair bonds. Graduate Program Affiliations Animal Behavior Graduate Group Neuroscience Graduate Group Psychology Graduate Program Education and Degree(s) 1993 B.A. in Anthropology, minor in Biology, University of New Orleans 1995 M.A. in Anthropology, University of Tennessee, Knoxville 2000 Ph.D. in Biology, University of Maryland 2000-2004 Postdoc in Psychiatry, University of Illinois, Chicago Publications Tags Department of Neurobiology, Physiology and Behavior Karen L. Bales (0000-0001-5826-2095) ORCID record for Karen L. Bales. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Rebecca M. Calisi Rodríguez Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Rebecca M. Calisi Rodríguez Breadcrumb Home Faculty Rebecca M. Calisi Rodríguez Position Title Associate Professor Neurobiology, Physiology and Behavior rmcalisi@ucdavis.edu Lab website Google Scholar Green Care Lab 280A Briggs Hall Bio Research Interests I specialize in neuroendocrinology and animal behavior. My research investigates how environmental factors influence brain function, reproductive behavior, and overall health. I employ a multidisciplinary approach, integrating genomics, physiology, and behavioral studies to understand the mechanisms underlying these processes. My work aims to uncover the impacts of environmental stressors on wildlife, with implications for both conservation efforts and human health. Center Affiliations Center for Neuroscience Graduate Program Affiliations Animal Behavior Graduate Group Molecular, Cellular and Integrative Physiology Graduate Group Education and Degree(s) 2001 B.A. in Psychology, Boston College 2006 M.S. in Biology, University of Texas, Arlington 2010 Ph.D. in Integrative Biology, University of California, Berkeley Publications Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Rebecca M. Calisi Rodríguez Fusion of Science and Parenting is Focus of Professor's Research, Advocacy and Art April 26, 2022 Professors Crystal Rogers and Wilsaan Joiner Respond to Ongoing Injustices Against Black Americans June 10, 2020 College of Biological Sciences Offers Weekly Virtual COVID-19 Town Hall Through May 29 April 16, 2020 Assistant Professor Rebecca Calisi Rodríguez Named Faculty Assistant to the Dean for Science Communications April 11, 2019 Woman, Professor, Artist and Mother: Rebecca Calisi Rodríguez Charts an Original Path in iBiology Video March 27, 2019 Pagination Page 1 Next page Next Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Natalia Caporale Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Natalia Caporale Breadcrumb Home Faculty Natalia Caporale Position Title Associate Professor of Teaching Neurobiology, Physiology and Behavior ella / she / her 530-752-8976 ncaporale@ucdavis.edu Google Scholar Equity in STEM Education Research Group 188A Briggs Hall Bio Natalia Caporale's research interests center on issues of equity and diversity in science education, with a focus on understanding the barriers that Students of Color, women, LGBTQ+ students and non-traditional college students (parenting students, foster youth, veterans, returning students, etc) face as they pursue their science degrees. Her research group applies both qualitative and quantitative methods in their studies, and her research philosophy is informed by theory of learning, critical race frameworks, intersectionality and asset-based models. Originally from Argentina, Natalia pursued her Bs in Biology at the University of Buenos Aires and then came to the US where she pursued her PhD in Neuroscience at UC Berkeley focusing on the cellular mechanisms of learning and memory. Following her postdoctoral work with Dr. Linda Wilbrecht studying the effects of early-life adversity on cognitive development and decision making in rodents, Dr. Caporale decided to dedicate herself to undergraduate education, which she adored, and she worked as a lecturer at UC Berkeley and SFSU for several years while also being a Visiting Scholar in Dr. Kimberly Tanner’s lab, where she started her training in science education research. Identifying and Overcoming Barriers to Students' Success in Science I aim to identify barriers to the success of minorities and underrepresented students in science majors at UC Davis and develop class interventions and departmental programs to help students overcome these barriers. In particular, I am deeply committed to the success of our transfer students, most of whom are ethnic minorities, first generation or non-traditional students.  For this, I hope to establish projects to involve local community colleges and CSUs. Improving Science Learning in Large Enrollment Courses It is a reality of our education system that courses are getting larger and larger and educators are faced with the need to modify our teaching to accommodate this new course format. Research in Physics, Chemistry and Biology over the last 30 years have identified various strategies that can increase student engagement, participation and learning in large science classrooms. Yet implementation remains a challenge. As a Faculty in UC Davis, I will be implementing many of these strategies in our classes while collecting evidence of their effectiveness as well as researching the barriers at the student and faculty level that difficult the transition of our courses into to a more active learning, student-centered teaching model. Conceptual Barriers to Changing People's Minds about Science One of the most challenging jobs science educators have is to change student's minds about their intuitive ideas about how the physical world works. Such intuitive knowledge is a significant barrier to student's understanding of many fundamental concepts in the sciences. This research project focuses on identifying and documenting the alternative conceptions that students bring into the biology classroom to develop better teaching strategies to help their learning of Biology. In this context, and as a neuroscientist by training, I am very interested in science misconceptions and ways to develop better instructional tools to help students resolve them. Education and Degree(s) 2002 Licenciatura Ciencias Biológicas, Universidad de Buenos Aires 2007 Ph.D. in Neuroscience, University of California, Berkeley Publications Tags Academic Departments Department of Neurobiology, Physiology and Behavior Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Rishidev Chaudhuri | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Rishidev  Chaudhuri Breadcrumb Home Faculty Rishidev  Chaudhuri Position Title Assistant Professor Neurobiology, Physiology and Behavior Mathematics rchaudhuri@ucdavis.edu Lab website Google Scholar ORCID (0000-0003-2301-3261) Bio Research Interests I am a computational neuroscientist focusing on the modeling of brain function and neural dynamics. My research combines theoretical and computational approaches to understand how complex behaviors and cognitive processes emerge from neural circuits. I develop mathematical models and simulations to study patterns of neural activity and their relationship to perception, memory, and decision-making. My contributions are important to advancing our understanding of brain function and addressing neurological disorders through innovative computational methods . Center Affiliations Center for Neuroscience Graduate Program Affiliations Applied Mathematics Graduate Group Neuroscience Graduate Group Education and Degree(s) B.A. in Physics, Amherst College Ph.D. in Applied Mathematics, Yale University Publications Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Rishidev  Chaudhuri Perception Inception: Exploring How the Brain Makes Up the World with New Faculty Rishidev Chaudhuri November 19, 2019 Rishidev  Chaudhuri (0000-0003-2301-3261) ORCID record for Rishidev  Chaudhuri. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Xiaomo Chen | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Xiaomo Chen Breadcrumb Home Faculty Xiaomo Chen Position Title Assistant Professor Neurobiology, Physiology, and Behavior xmch@ucdavis.edu Lab website Google Scholar Bio Research Interests The research in my lab is focused on investigating the neural mechanisms that underlie cognitive control functions. By exploring how the brain manages and regulates thought processes, attention, learning, and actions, we aim to uncover the fundamental principles that govern these essential cognitive functions. Furthermore, we are dedicated to developing novel and innovative approaches to study and enhance cognitive control. These approaches include using advanced large-scale neurophysiology techniques, computational modeling, and behavioral experiments to gain deeper insights into brain function. Ultimately, our objective is to improve our understanding of cognitive control mechanisms and develop strategies to enhance these functions, potentially benefiting individuals with cognitive impairments and improving overall mental health. Center Affiliations Center for Neuroscience Graduate Program Affiliations Neuroscience Graduate Group Education and Degree(s) 2005, B.Eng., Huazhong Univ. of Science and Technology 2008, M.Eng., Tsinghua University 2010, M.A., Johns Hopkins University 2013, Ph.D., Johns Hopkins University Publications Tags Department of Neurobiology, Physiology and Behavior Content by Xiaomo Chen CBS Welcomes Three New Faculty Members for 2021-2022 Year December 07, 2021 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Stacey A. Combes Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Stacey A.  Combes Breadcrumb Home Faculty Stacey A.  Combes Position Title Professor Neurobiology, Physiology and Behavior 530-752-8144 sacombes@ucdavis.edu Lab website Google Scholar ORCID (0000-0003-1586-6459) 155A Hutchison Hall Bio Research Interests Research in the Combes Lab focuses on the physical interaction between flying insects and their environment, and on how physiology, morphology and behavior contribute to the performance of ecologically relevant flight behaviors. Our work combines lab-based flight biomechanics with field-based insect ecology to understand the physical foundations of diverse, natural flight behaviors. Projects in the lab explore topics such as flexible wing morphology, the mechanics of aerial predator-prey interactions, flight through cluttered environments, causes and consequences of wing damage, and the effects of turbulent airflow on flight stability. Center Affiliations Center for Neuroscience Graduate Program Affiliations Animal Behavior Graduate Group Entomology Graduate Program Neuroscience Graduate Group Education and Degree(s) 1994 B.A. in Integrative Biology, University of California, Berkeley 2002 Ph.D. in Zoology, University of Washington Publications Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Stacey A.  Combes How Dragonflies Catch Prey in Midair January 05, 2023 Bumblebees Carry Heavy Loads in Economy Mode February 05, 2020 Stacey Combes Recognized as a 2019 Chancellor's Fellow January 29, 2019 Social Bee-stortion: Exploring Pesticide’s Effects on Pollinators November 08, 2018 Flight Turbulence: New Study Explores How Flies Navigate Unstable Convective Air October 24, 2018 Pagination Page 1 Next page Next Stacey A.  Combes (0000-0003-1586-6459) ORCID record for Stacey A.  Combes. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - William DeBello Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team William DeBello Breadcrumb Home Faculty William DeBello Position Title Associate Professor Neurobiology, Physiology and Behavior 530-754-7165 wmdebello@ucdavis.edu Bio Research Interests Our current goal is to reconstruct the complete wiring diagram of local circuits in the barn owl auditory localization pathway. This is a classic model system for studying the neural bases of information processing, plasticity and learning. Our integrative approach combines in vivo electrophysiology, auditory and visual receptive field mapping, tracer injection, immmunohistochemistry, confocal microscopy, automated transmission electron microscopy, 3D visualization, computer simulation and bootstrap analysis. We hope to better understand how individual life experience is encoded by changes in wiring patterns, and by extension, to shed light on principles of neural processing that are employed across brain regions and across species. Center Affiliations Center for Neuroscience Graduate Program Affiliations Neuroscience Graduate Group Education and Degree(s) 1990 B.S. in Biology, Stanford University 1996 Ph.D. in Neurobiology, Duke University Publications Nichols GS and DeBello WM (2008) Bidirectional regulation of the cyclic-AMP response element binding protein encodes spatial map alignment in prism-adapting barn owls. Journal of Neuroscience 28(40):9898-9909. DeBello WM (2008) Micro-rewiring as a substrate for learning. Trends in Neurosciences 31(11):600-610. McBride TJ, Rodriguez-Contreras A, Trinh A, Bailey R and DeBello WM (2008) Learning drives differential clustering of axodendritic contacts in the barn owl auditory system. Journal of Neuroscience 28(27):6960-73. Swofford JA and DeBello WM. (2007) Transcriptome changes associated with instructed learning in the barn owl auditory localization pathway. Developmental Neurobiology 67(11):1457-77. DeBello WM, Mikula S, Nguyen PL, Karten HJ and Jones EG (2006) A digital atlas of the brain of the barn owl, Tyto Alba. Online publication: BrainMaps.org. Tags Academic Departments Department of Neurobiology, Physiology and Behavior Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Jochen Ditterich Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Jochen Ditterich Breadcrumb Home Faculty Jochen Ditterich Position Title Professor Neurobiology, Physiology and Behavior 530-754-5084 jditterich@ucdavis.edu Bio Research Interests Our lab is interested in neural mechanisms underlying higher-order brain functions linking perception and action, especially decision-making. We are addressing the question how the brain processes sensory information and combines it with other information in order to select what action to take next and when to take that action. These mechanisms have mainly been studied from a psychological point of view, whereas neurophysiologists have largely concentrated on lower-level mechanisms. We are bridging this gap by utilizing both behavioral and neurophysiological methods and by using mathematical models for exploring potential neural mechanisms. The goal of our research is to provide a solid foundation for understanding human choice behavior, the neural implementation of decision mechanisms, as well as problems with decision-making in neurological and psychiatric disorders. In addition, our lab is also active in the area of neuroengineering, developing new technology that allows neuroscientists to address questions or test hypotheses that are difficult or impossible to investigate with currently available techniques. Center Affiliations Center for Neuroscience Graduate Program Affiliations Neuroscience Graduate Group Education and Degree(s) 1995 Diploma in Electrical Engineering, Technical University of Munich, Germany 2000 Ph.D. in Electrical Engineering, Technical University of Munich, Germany Publications Thakur VN, Basso MA, Ditterich J, Knowlton BJ (2021) Implicit and explicit learning of Bayesian priors differently impacts bias during perceptual decision-making. Scientific Reports 11:16932 Rodriguez Rivero C, Ditterich J (2021) A user-friendly algorithm for adaptive closed-loop phase-locked stimulation. Journal of Neuroscience Methods 347:108965 McLean CS, Ouyang B, Ditterich J (2020) Second guessing in perceptual decision-making. Journal of Neuroscience 40:5078-5089 Stine GM, Zylberberg A, Ditterich J, Shadlen MN (2020) Differentiating between integration and non-integration strategies in perceptual decision making. Elife 9:e55365 Moxon K, Saez I, Ditterich J (2019) Mind Over Matter: Cognitive Neuroengineering. Cerebrum. Published online 2019 Jun 5 Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Jochen Ditterich UC Davis Researchers Explore Sci-fi Solutions for Neurological Diseases May 20, 2021 Bios Magazine: Making Sense of Your Perceptions January 10, 2020 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Diasynou Fioravante Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Diasynou Fioravante Breadcrumb Home Faculty Diasynou Fioravante Position Title Associate Professor Neurobiology, Physiology and Behavior dfioravante@ucdavis.edu Lab website Bio Research Interests The response to a stimulus or a context varies between individuals and across time and depends on internal state, prior experience and expectations. How are expectations formed, communicated and interpreted in the brain to modulate emotional and motivated behavior? How do expectations change with learning? To answer these question, my lab studies long-range neural networks between the cerebellum, the \"prediction machine\" of the brain, and emotional and reward centers. Our toolbox includes transgenic mice, ex vivo and in vivo electrophysiology, optogenetics, advanced imaging, single cell RNA sequencing and animal behavior assays. With these tools at hand, we aim to bridge the knowledge gap between synaptic, cellular and circuit levels of analysis. Center Affiliations Center for Neuroscience Graduate Program Affiliations Neuroscience Graduate Group Education and Degree(s) B.A. in Psychology, The American College of Greece Ph.D. in Neuroscience, University of Texas, Houston Postdoc in Neuroscience, Harvard Medical School Publications Wang CC, Weyrer C, Fioravante D, Kaeser PS, Regehr WG. (2021) Presynaptic short-term plasticity persists in the absence of PKC phosphorylation of Munc18-1. J Neurosci. Jul 21:JN-RM-0347-21. Online ahead of print. PMID: 34290081. doi: 10.1523/JNEUROSCI.0347-21.2021. D’Ambra, A., Jung, S.J., Ganesan, S., Antzoulatos*, E., Fioravante*, D. (2020) Cerebellar Activation Bidirectionally Regulates Nucleus Accumbens Shell and Core. BioRxiv 2020.09.28.283952; doi: https://doi.org/10.1101/2020.09.28.283952  *equal senior authors. Graham, J., D’Ambra, A., Jung, S,J., Vishwakarma, N., Venkatesh, R., Parigi, A., Antzoulatos, E.,  Fioravante*, D., Wiltgen*, B.J. (2020). Activation of ventral CA1 to basolateral amygdala-projecting neurons disrupts contextual fear memory retrieval. BioRxiv 2020.06.29.178970; doi: https://doi.org/10.1101/2020.06.29.178970. *equal senior authors. Pannoni, K., Sanculi, D., […], Antzoulatos, E., Fioravante, D., Ellisman, M., DeBelllo, W. (2019) Toric spines at a site of learning. eNeuro 7 (1) ENEURO.0197-19.2019; DOI: 10.1523/ENEURO.0197-19.2019. Wang CC, Weyrer C, Paturu M, Fioravante D, Regehr WG. (2016) Calcium-dependent protein kinase C is not required for post-tetanic potentiation at the hippocampal CA3 to CA1 synapse. J Neurosci. 36: 6393-6402. PubMed PMID: 27307229. Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Diasynou Fioravante New Research Suggests Cerebellum May Play Important Role in Autism April 02, 2024 The Brain Detectives: UC Davis Neuroscientists Investigate The Brain to Solve The Mysteries of Mental Health March 23, 2020 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 17, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Eva K. Fischer | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Eva K. Fischer Breadcrumb Home Faculty Eva K. Fischer Position Title Assistant Professor Neurobiology, Physiology and Behavior ekfischer@ucdavis.edu Lab website Google Scholar 0000-0002-2916-0900 Bio Research Interests Biologists and non-biologists alike are fascinated by both widespread similarities and prodigious diversity in animal behavior. Nature documentaries, conservation agencies, and educators capitalize on the intuitive appeal of the fact that human and non-human animals exhibit similar behaviors – including aggression, courtship, and parental care – as well as the amazing diversity of forms these behaviors take and adaptations animals have to perform them. A modern extension of this fascination asks whether similarities in behavior are governed by the same underlying mechanisms. Exploration of underlying mechanisms can improve our understanding of the phenomena that shape evolution and dictate organisms’ ability to adapt to novel and changing environments. Moreover, the accuracy of the assumption that shared phenotypes share underlying mechanisms is central to the success or failure of using non-human model organisms in biomedical research. In my lab, we use integrative approaches to address these questions across hierarchical levels of biological organization (from gene networks, to neural circuits, to physiology, to behavior) and timescales (from immediate, to developmental, to evolutionary). I believe that fundamental principles governing brains and behavior are most apparent in evolutionary and developmental contexts. We therefore leverage natural behavioral diversity with technological advances that allow cutting edge work outside of traditional model systems. Specifically, we capitalize on the morphological, physiological, and behavioral diversity (and charisma!) of frogs to understand mechanisms of behavior and its evolution. We also think frogs are great for community engagement and education. Just as we need human diversity in our teaching and research spaces, we need diversity in our study systems to address fundamental open questions and to distinguish shared core principles from species-specific diversity in the biological bases of behavior and its evolution. Education and Degree(s) 2007 B.A. in Biology and French, College of Arts & Sciences, Cornell University 2015 Ph.D. in Zoology, Colorado State University NSF Postdoctoral Fellow (2015 - 2017) Center for Systems Biology, Harvard University Postdoctoral Fellow (2017 - 2020) Department of Biology, Stanford University Publications Tags Department of Neurobiology, Physiology and Behavior Content by Eva K. Fischer CBS Welcomes 5 New Faculty in the 2023-24 Year August 07, 2024 Eva K. Fischer (0000-0002-2916-0900) ORCID record for Eva K. Fischer. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: October 4, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - David D. Furlow Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team David D. Furlow Breadcrumb Home Faculty David D. Furlow Position Title Professor Neurobiology, Physiology and Behavior 530-754-8609 jdfurlow@ucdavis.edu 274B Briggs Hall Bio Research Interests Molecular basis of hormone action, particularly during development. Analysis of gene expression programs during morphogenesis. Genome editing in model organisms, particularly applied to nuclear hormone receptor function. His research has been funded by the NIH, the US EPA, and European agencies. He has been a visiting faculty member at the Marine Biological Laboratory in Woods Hole, MA and the European Molecular Biology Laboratory, Heidelberg, Germany, and at UC Davis, primarily teaches undergraduate physiology and endocrinology courses. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Molecular, Cellular and Integrative Physiology Graduate Group Education and Degree(s) 1985 B.S. in Biochemistry, Pennsylvania State University 1992 Ph.D. in Biochemistry, University of Wisconsin, Madison Postdoc in Embryology, Carnegie Institution of Washington Publications Mengeling BJ, Wei Y, Dobrawa LN, Streekstra M, Louisse J, Singh V, Singh L, Lein PJ, Wulff H, Murk AJ, Furlow JD. A multi-tiered, in vivo, quantitative assay suite for environmental disruptors of thyroid hormone signaling. Aquat Toxicol. 2017 Sep;190:1-10. doi: 10.1016/j.aquatox.2017.06.019. Epub 2017 Jun 21. PubMed PMID: 28662416 Pérez JH, Furlow JD, Wingfield JC, Ramenofsky M. Regulation of vernal migration in Gambel's white-crowned sparrows: Role of thyroxine and triiodothyronine. Horm Behav. 2016 Aug;84:50-6. doi: 10.1016/j.yhbeh.2016.05.021. Epub 2016 May 24. PubMed PMID: 27234300 Mengeling BJ, Murk AJ, Furlow JD. Trialkyltin Rexinoid-X Receptor Agonists Selectively Potentiate Thyroid Hormone Induced Programs of Xenopus laevis Metamorphosis. Endocrinology. 2016 Jul;157(7):2712-23. doi: 10.1210/en.2016-1062. Epub 2016 May 11. PubMed PMID: 27167774 Tandon P, Conlon F, Furlow JD, Horb ME. Expanding the genetic toolkit in Xenopus: Approaches and opportunities for human disease modeling. Dev Biol. 2017 Jun 15;426(2):325-335. doi: 10.1016/j.ydbio.2016.04.009. Epub 2016 Apr 22. Review. PubMed PMID: 27109192 Singh L, Pressly B, Mengeling BJ, Fettinger JC, Furlow JD, Lein PJ, Wulff H, Singh V. Chasing the Elusive Benzofuran Impurity of the THR Antagonist NH-3: Synthesis, Isotope Labeling, and Biological Activity. J Org Chem. 2016 Mar 4;81(5):1870-6. doi: 10.1021/acs.joc.5b02665. Epub 2016 Feb 18. PubMed PMID: 26849160. Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by David D. Furlow Donor-Supported Research Brings Experiential Learning to Summer Quarters October 03, 2024 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Mark Goldman Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Mark Goldman Breadcrumb Home Faculty Mark Goldman Position Title Professor Neurobiology, Physiology and Behavior 530-757-8749 msgoldman@ucdavis.edu Lab website Google Scholar Center for Neuroscience, 1544 Newton Court, Davis, CA, 95618 Bio Research Interests Animal behavior typically involves interactions among networks of large numbers of interconnected neurons, but experimental techniques in most systems are limited to the direct measurement of single or small numbers of neurons. My laboratory uses computational modeling to bridge the gap between single-neuron measurements and hypothesized network function. We study a wide variety of systems and seek to address questions ranging from cellular and network dynamics to sensory coding to memory and plasticity. One major project involves constructing models of networks involved in motor control and working memory in which a briefly presented stimulus leads to long-lasting, or “persistent”, neural activity whose level encodes the triggering stimulus. Our work focuses primarily on a model system for studying such activity, the oculomotor neural integrator, in which transient eye movement commands are accumulated into persistent neural signals that control the horizontal position of the eyes. By modeling electrophysiological and optical imaging data, we seek to dissect the contributions of synaptic inhibition, synaptic excitation, and intrinsic cellular properties to the generation of the observed neural activity. More recently, we have also been studying the role of the cerebellum in controlling the plasticity of oculomotor responses. In a second set of projects, we have been modeling how desert harvester ants make decisions about whether to leave their nest and forage for food in the arid desert climate.  These ants appear to integrate sequences of contacts from successfully returning foragers who provide evidence related to the amount of food in the environment.  We hypothesize that the behavior of the ants can be described by a stochastic leaky integrator (that we term the \"integrate-and-forage\" model) such that each contact increases the probability that the ant forages and, between contacts, there is an intrinsic decay of the accumulated decision variable. Center Affiliations Center for Neuroscience Graduate Program Affiliations Neuroscience Graduate Group Education and Degree(s) 1993 B.S., Stanford University 2000 Ph.D., Harvard University Publications Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Mark Goldman Equipped to Fight in 2020: College of Biological Sciences Launches Capstone COVID-19 Virtual Lab Course April 02, 2020 Professor Mark Goldman Appointed to the Joel Keizer Endowed Chair in Theoretical and Computational Biology April 24, 2019 Advocating a Computational Shift in Neuroscience Training December 04, 2017 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Aldrin V. Gomes Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Aldrin V. Gomes Breadcrumb Home Faculty Aldrin V. Gomes Position Title Professor Neurobiology, Physiology and Behavior Physiology and Membrane Biology he/him/his 530-752-3207 avgomes@ucdavis.edu Lab website Google Scholar ORCID (0000-0002-9819-3036) ResearchGate 187 Briggs Hall Bio Research Interests Ibuprofen can increase the risk of stroke and cardiovascular disease. The signal transduction pathways, particularly the role of protein homeostasis (proteostasis) and mitochondrial function,  in cardiovascular diseases associated with commonly used drugs are investigated. Impaired protein degradation and dysfunctional mitochondria are associated with many cardiac and skeletal muscle diseases. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Molecular, Cellular and Integrative Physiology Graduate Group Education and Degree(s) 1998 Ph.D. in Biochemistry, University of the West Indies, St. Augustine, Trinidad and Tobago Publications Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Aldrin V. Gomes 2021 Chancellor's Fellowship For Diversity, Equity and Inclusion November 30, 2021 Gomes Lab Recognized at Annual Campus Lab Safety Awards October 28, 2021 $2 Million NIH Grant Expands Grad Program for Underrepresented Students July 15, 2021 Popular Painkiller Ibuprofen Affects Liver Enzymes in Mice March 11, 2020 Biology Undergraduate Scholars Program Elevates Diversity in the Life Sciences August 20, 2018 Pagination Page 1 Next page Next Aldrin V. Gomes (0000-0002-9819-3036) ORCID record for Aldrin V. Gomes. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Thomas P. Hahn Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Thomas P. Hahn Breadcrumb Home Faculty Thomas P. Hahn Position Title Professor Neurobiology, Physiology and Behavior 530-752-8531 tphahn@ucdavis.edu Google Scholar 102 Animal Communication Lab Bio Research Interests Environmental regulation of avian annual cycles of behavior, physiology and morphology; behavioral and physiological responses of birds to unpredictable environmental events. Interfaces of behavior, endocrine and neuroendocrine physiology, ecology, and evolution. Specifically environmental regulation of avian annual schedules of reproduction, plumage molt and migration; scheduling tradeoffs between current reproduction and survival (future reproduction); evolution of mechanisms of responses to environmental cues such as day length, food, social factors; effects of unpredictable environmental events on behavior and physiology of free-living birds. Avian communication, especially use of heterospecific mimicry in song, and learned non-song vocalizations. Graduate Program Affiliations Animal Behavior Graduate Group Ecology Graduate Group Education and Degree(s) 1984 B.S. in Biological Sciences, Stanford University 1985 M.S. in Biological Sciences, Stanford University 1993 Ph.D. in Zoology, University of Washington Publications Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Thomas P. Hahn CBS Nets Multiple Year-End Mentorship and Research Awards June 07, 2022 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Fumika Hamada | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Fumika Hamada Breadcrumb Home Faculty Fumika Hamada Position Title Professor Neurobiology, Physiology and Behavior fnhamada@ucdavis.edu Lab website 280 Briggs Hall Bio Research Interests The goal of my lab is to understand the molecular and neural mechanisms of temperature homeostasis. We are particularly interested in how the circadian clock, sleep, sensory experience, and internal nutrient state modulate temperature homeostasis. My lab uses Drosophila as a model system through a combination of genetic, behavioral, optogenetic, and physiological (i.e., calcium imaging) approaches. We have also recently started focusing on mice. Center Affiliations Center for Neuroscience Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Entomology Graduate Program Integrative Genetics and Genomics Graduate Group Molecular, Cellular and Integrative Physiology Graduate Group Neuroscience Graduate Group Education and Degree(s) 1999, B.S. in Biology, Tokyo University of Science 2001, M.S. in Biology, Tokyo University of Science 2004, Ph.D. in Biology, Tokyo University of Science 2004-2005, Postdoc in Biology, Harvard Medical School 2005-2009, Postdoc in Neurobiology, Massachusetts Institute of Technology; Brandeis University Tags Department of Neurobiology, Physiology and Behavior Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Mark O. Huising Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Mark O. Huising Breadcrumb Home Faculty Mark O. Huising Position Title Professor Neurobiology, Physiology and Behavior Physiology and Membrane Biology 530-752-4670 mhuising@ucdavis.edu Lab website Google Scholar ORCID (0000-0002-6594-2205) ResearchGate 193 Briggs Hall Bio Research Interests Proper control of glucose metabolism is essential to thrive. Consequently our bodies have evolved sophisticated and subtle yet remarkably effective ways to maintain tight blood glucose control over the course of many decades. Key to glucose homeostasis are the opposing actions of insulin, which promotes peripheral uptake of glucose, and glucagon, which is a signal to the liver to break down glycogen and release glucose. These hormones are made by beta and alpha cells, respectively, which co-localize in the islets of Langerhans to facilitate the coordinated regulation of their release. The islets also contain somatostatin-producing delta cells, which provide essential negative feedback to both alpha and beta cells. My group studies how the alpha, beta and delta cells within the islet communicate with each other and integrate signals from the central and peripheral nervous system, gastro-intestinal tract, liver, skeletal muscle and adipose tissue. We are only just starting to appreciate the depth and complexity of this intricate network, which contains potential therapeutic targets to treat or even cure diabetes. One of the family of signals that the Huising lab studies, is named for the stress peptide Corticotropin Releasing Factor, or CRF in short. CRF was originally discovered as the principal hypothalamic factor to initiate the stress response by acting on the pituitary gland. It turns out that the insulin-producing beta cells of the pancreas can respond directly to CRF with increased insulin secretion, increased beta cell proliferation and reduced beta cell death in the face of pro-inflammatory insults, which is a promising set of beneficial characteristics united in a single molecule. Urocortin3 (Ucn3), a peptide related to CRF, is abundantly expressed by mature beta cells. We discovered that Ucn3 is co-released with insulin to trigger somatostatin release from neighboring delta cells, which in turn inhibits insulin secretion. In essence, Ucn3 triggers a negative feedback loop that attenuates insulin secretion, provided that glucose levels are successfully reduced. Ucn3 expression also distinguishes mature, functional beta cells from their immature progenitors, which is a trait that is particularly useful to track the differentiation of mature, glucose-responsive beta cells from embryonic or induced pluripotent stem cells. CRF and Ucn3 are just two examples of signaling molecules whose direct actions on the pancreas add a novel layer of complexity to the intricate network of signaling molecules that in concert governs beta cell mass and insulin and glucagon output of the pancreas. My group is focused on unraveling the contributions of these local pancreatic CRF family signaling cascades on glucose metabolism in healthy and diabetic individuals. Graduate Program Affiliations Molecular, Cellular, and Integrative Physiology Graduate Group Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Education and Degree(s) 2000 M.Sc. in Biology, Wageningen University, The Netherlands 2006 Ph.D. in Comparative Neuroendocrinology and Immunology, Radboud University Nijmegen, The Netherlands Publications Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Mark O. Huising Advancing Diabetes Research: Mark Huising Receives Faculty Research Award October 19, 2018 Diabetes Research in Huising Lab Emphasizes Importance of Reproducibility in Science November 02, 2017 New Type of Insulin-Producing Cell Discovered April 04, 2017 Mark Huising Discovers \"Beautiful System\" in Insulin Regulation that Gives Clues to Diabetes June 15, 2015 Mark O. Huising (0000-0002-6594-2205) ORCID record for Mark O. Huising. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 18, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Wilsaan Joiner | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Wilsaan Joiner Breadcrumb Home Faculty Wilsaan Joiner Position Title Professor Neurobiology, Physiology, and Behavior Neurology 530-752-5624 wmjoiner@ucdavis.edu Google Scholar 1009 Green Hall Bio Research Interests Our laboratory studies how we use different sources of information to aid behavior, ranging from visual perception to movement planning and updating. Specifically, we are interested in how external and internally-generated sensory information is integrated in healthy individuals, in comparison to certain disease and impaired populations (e.g., Schizophrenia and upper extremity amputees). Achieving this understanding may lead to better methods for diagnosing and treating impairments of the nervous system. Center Affiliations Center for Neuroscience Graduate Program Affiliations Neuroscience Graduate Group Education and Degree(s) 2001 B.S. in Biomedical Engineering, Saint Louis University 2007 Ph.D. in Biomedical Engineering, Johns Hopkins School of Medicine Publications Tags Department of Neurobiology, Physiology and Behavior Content by Wilsaan Joiner Wilsaan Joiner Named 2023 Chancellor's Fellow February 15, 2023 Making Prosthetics More Lifelike December 01, 2022 Improving Prosthetic Limbs for Children December 14, 2021 Learning to Control and Embody Robot Arms in Space May 11, 2021 Professors Crystal Rogers and Wilsaan Joiner Respond to Ongoing Injustices Against Black Americans June 10, 2020 Pagination Page 1 Next page Next Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Taiyi Diana Kuo | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Taiyi Diana  Kuo Breadcrumb Home Faculty Taiyi Diana  Kuo Position Title Assistant Professor Neurobiology, Physiology and Behavior she/her/hers tdkuo@ucdavis.edu Google Scholar ORCID (0000-0001-6167-0284) 1111 Green Hall Bio Research Interests The Kuo lab studies the etiology of metabolic disorder and diabetes, and aims to elucidate the molecular mechanism(s) underlying pancreatic beta cell failure and insulin resistance. Our interdisciplinary approaches span physiology, molecular biology, biochemistry, bioinformatics, and functional genomics. We utilize integrative functional genomics with next generation sequencing (ChIP-seq, RNA-seq, HiC) to obtain multi-layered, genome-wide datasets to compare and contrast human and mouse epigenetics in the context of beta cell function. One of the current projects focuses on a resulting human diabetes susceptibility gene- C2CD4A. We have generated several animal models, cell lines, and necessary reagents to investigate a link between pancreatic beta-cell, exercise-induced hypoglycemia, and type 2 diabetes therapy. These studies will advance our understanding of C2CD4A, and provide a blueprint to leverage human genetics data into biological insight that will eventually benefit patients. We are hiring at all levels. Individuals with a deep interest in science, programming skills, and an ambition to excel in diabetes research are highly sought. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Molecular, Cellular and Integrative Physiology Graduate Group Education and Degree(s) 2006 B.A. in Molecular and Cellular Biology, UC Berkeley 2012 Ph.D. in Endocrinology and Metabolic Biology, UC Berkeley 2021 Postdoc in Diabetes, Columbia University Publications Tags Department of Neurobiology, Physiology and Behavior Content by Taiyi Diana  Kuo CBS Welcomes Three New Faculty Members for 2021-2022 Year December 07, 2021 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Lee M. Miller Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Lee M. Miller Breadcrumb Home Faculty Lee M. Miller Position Title Professor Neurobiology, Physiology and Behavior Otolaryngology 530-297-4474 leemiller@ucdavis.edu Lab website Bio Research Interests My research focuses on understanding the neural bases of auditory perception and speech recognition in human listeners. Countless normal listeners have trouble understanding speech in noisy environments, and certain special populations, such as those with learning impairments, autism, or using hearing aids and cochlear implants, face even greater difficulties. Among these, the most numerous are individuals with hearing loss, now numbering 30 million Americans and half a billion worldwide. This reduced ability to communicate often leads to depression, loneliness, and social anxiety, particularly in older adults. Untreated hearing loss in the U.S. costs tens of billions of dollars annually, with immeasurable human costs. Using non-invasive techniques such as functional magnetic resonance imaging (fMRI), high-density electroencephalography (EEG), and neural network analysis, my research aims to learn how different parts of the brain cooperate to achieve perception, especially in noisy environments, and what happens when comprehension fails. Results from this research may lead to practical solutions such as improved audiological diagnosis and targeting, enhanced hearing-device design, better speech recovery after device fitting, improved training on listening strategies, and greater social integration among special populations. This research is generously supported by the National Institute on Deafness and other Communication Disorders (NIDCD), a division of the National Institutes of Health (NIH). Center Affiliations Center for Mind and Brain Center for Neuroscience Graduate Program Affiliations Neuroscience Graduate Group Psychology Graduate Program Education and Degree(s) 1993 B.S. in Physics, Duke University 2001 Ph.D. in Bioengineering, University of California San Francisco/Berkeley Publications Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Lee M. Miller NPB Professor Lee Miller Awarded UC Davis STAIR Grant to Advance Solutions in Human Health September 04, 2024 Neuroscience Researcher Receives $1.5 Million Grant from Department of Defense to Develop New Diagnostic Tool for Hearing Loss July 06, 2020 Giving Humanity a Hand with Supernumerary Robotics February 06, 2020 Researchers Study How Cochlear Implants Affect Brain Circuits June 30, 2016 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: October 10, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Felicity Muth | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Felicity Muth Breadcrumb Home Faculty Felicity Muth Position Title Assistant Professor Neurobiology, Physiology and Behavior fmuth@ucdavis.edu Research Website Google Scholar ORCID (0000-0003-0904-0589) Bio Research Interests The Muth Lab work on the cognitive ecology of wild-foraging and lab-based bumblebees, focusing on cognitive abilities that have a clear function in bees’ natural environments. Current projects in the lab include investigating cognition in relation to complex floral rewards and comparative cognition in wild bumblebees. We also work on anthropogenic effects on bee behavior and cognition, in particular focusing on pesticide exposure. Education and Degree(s) 2009 B.Sc. in Zoology with honours (1st), University of Edinburgh, UK. 2012 Ph.D. in Biology, University of St. Andrews, UK. Publications Tags Department of Neurobiology, Physiology and Behavior Content by Felicity Muth What Makes Queen Bees So Smart? November 07, 2024 UC Davis Exceeds $1 Billion in Research Awards for Third Consecutive Year September 09, 2024 CBS Welcomes 5 New Faculty in the 2023-24 Year August 07, 2024 Felicity Muth (0000-0003-0904-0589) ORCID record for Felicity Muth. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: November 6, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Gabrielle A. Nevitt Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Gabrielle A. Nevitt Breadcrumb Home Faculty Gabrielle A. Nevitt Position Title Professor Neurobiology, Physiology and Behavior 530-752-5929 ganevitt@ucdavis.edu Lab website 1131 Green Hall Bio Research Interests A major focus of my laboratory is to better understand the sensory ecology of other organisms, and how these systems are shaped by evolution. My specialty is olfaction - the sense of smell - and much of my research has focused on exploring how marine birds and fishes use smell in the natural environment. I have worked in areas ranging from olfactory homing in salmon, to olfactory foraging, navigation and individual recognition in birds, and in particular, petrels and albatrosses. Because our world is experiencing rapid, anthropogenic change, our work increasingly interfaces with problems associated with global climate, habitat loss or degradation and by-catch concerns in marine fisheries. Many of the species we study are currently threatened or endangered. In line with this concern, we also conduct research on the proximate and evolutionary factors contributing to phenotypic plasticity, and this work has been carried out primarily with model fish species (various species of desert pupfish and salmon). Graduate Program Affiliations Animal Behavior Graduate Group Education and Degree(s) 1983 B.S. in Biology, Stanford University 1983 M.S. in Biology, Stanford University 1990 Ph.D. in Zoology, University of Washington Publications Debose, J.L., Lema, S.C., & Nevitt, G.A. (2008). Dimethylsulfionoproprianate as a foraging cue for reef fishes. Science, 319, 1356. Nevitt, G.A., Losekoot, M. & Weimerskirch, H. (2008). Evidence for olfactory search in Wandering albatross Diomedea exulans. Proceedings of the National Academy of Sciences, 105(12), 4576-81. (Cover article) Nevitt, G.A. (2008). Sensory ecology on the high seas: The odor world of the procellariiform seabirds. Journal of Experimental Biology, 211, 1706-1713. De Bose, J. L. & Nevitt, G. A. (2008). The use of odors at different spatial scales: Comparing birds with fish. Journal of Chemical Ecology 34(7), 867-81. VanBuskirk, R. & Nevitt, G.A. (2008). The influence of developmental environment on the evolution of olfactory foraging behavior in procellariiform seabirds. Journal of Evolutionary Biology, 21(1), 67-76. Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Gabrielle A. Nevitt The Scent of a Mate: Seabird Study Provides Insights into Sexual Selection August 20, 2018 Why Do Seabirds Eat Plastic? The Answer Stinks November 10, 2016 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Alexander S. Nord Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Alexander S. Nord Breadcrumb Home Faculty Alexander S. Nord Position Title Professor Neurobiology, Physiology and Behavior Psychiatry and Behavioral Services asnord@ucdavis.edu Lab website Google Scholar ORCID (0000-0003-4259-7514) School of Medicine Center for Neuroscience Building, 612B Bio Research Interests My research explores gene regulatory circuits and chromatin dynamics in the brain, studying how these features contribute to brain development, evolution, and function. I apply a combination of genomics, mouse and cell-based models, and human genetics.  My work is rooted in basic and translational science, with an ultimate goal of understanding the biological components of human diseases and disorders of the brain and improving clinical care of afflicted individuals.  To that end, I perform both experimental work and computational analysis to reveal the function of primary DNA sequence, epigenomic modifications, and chromatin structure. Center Affiliations Center for Neuroscience Genome Center Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Integrative Genetics and Genomics Graduate Group Neuroscience Graduate Group Education and Degree(s) 2001 B.A. in Biology, Carleton College 2011 Ph.D. in Genome Sciences, University of Washington 2014 Postdoctoral Fellow Axel Visel, Len Pennacchio, Eddy Rubin LBNL Publications Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Alexander S. Nord New Research Suggests Cerebellum May Play Important Role in Autism April 02, 2024 Discovery Hints at Genetic Basis for the Most Challenging Symptoms of Schizophrenia March 19, 2024 The Brain Detectives: UC Davis Neuroscientists Investigate The Brain to Solve The Mysteries of Mental Health March 23, 2020 Bios Magazine: Strengthening the Science Muscles November 04, 2019 Mice Provide Insight Into Genetics of Autism Spectrum Disorders August 31, 2017 Pagination Page 1 Next page Next Alexander S. Nord (0000-0003-4259-7514) ORCID record for Alexander S. Nord. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 3, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Carolynn Patten | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Carolynn Patten Breadcrumb Home Faculty Carolynn Patten Position Title Professor Neurobiology, Physiology and Behavior Physical Medicine and Rehabilitation cpatten@ucdavis.edu Bio Research Interests My research focuses on understanding the neural basis of human movement with overriding goals of elucidating mechanisms of movement dysfunction with aging and in adult neuropathologies; determining capacity for motor recovery following central nervous system injury; and identifying critical factors that contribute to rehabilitation efficacy. To achieve these goals, my research program investigates neural mechanisms and biomechanical consequences of CNS pathologies causing motor dysfunction; development of biomarkers of motor recovery; and novel means to induce neuroplasticity and recovery. This translational neuroscience research combines expertise in neurophysiological (i.e., transcranial magnetic stimulation (TMS), EEG, EMG, motor unit recordings, reflex probes), neuroimaging, biomechanical (measures of force production, kinetics), behavioral (kinematics), and clinical approaches to study human performance, and as a result, crosses disciplines of motor control, neuroscience, biomechanics, clinical medicine, rehabilitation, and bioengineering. My research supports clinical care in neurorehabilitation or individuals with motor dysfunction resulting from neuropathologies, such as stroke, to aid in recovery, restore activity participation and optimize quality of life. Education and Degree(s) 1980, B.A., University of Washington 1992, M.S.P.T., Boston University 1998, Ph.D., University of Massachusetts, Amherst 1998-2001, Postdoctoral Fellowship, Stanford University, VA Rehab Research Center Publications Ao D, Li G, Shourijeh MS*, Patten C, and Fregly BJ. EMG-driven musculoskeletal model calibration with wrapping surface personalization. IEEE Trans Neur Sys and Rehab Eng, accepted 08 Oct 2023 Banks CL*, Patten C†. Development of an Assessment of Bilateral Locomotor Efficacy for Individuals Poststroke, Gait & Posture, 2023: 172-177; https://doi.org/10.1016/j.gaitpost.2023.05.012. PMID: 37210850 Young BM, Holman EA, Cramer SC, STRONG Study Investigators. Rehabilitation Therapy Doses Are Low After Stroke and Predicted by Clinical Factors. Stroke. 2023 Feb; doi: 10.1161/STROKEAHA.122.041098. PMID:36734234 Srivastava S, Seamon BG, Patten C, Kautz SA. Relationship between parameters of body weight supported treadmill training and muscle activity patterns in post-stroke gait, Exp Br Res, 2023 Jan; 10.1007/s00221-023-06551-7, PMID: 36639543 Vega MM, Li G, Shourijeh MS, Ao D, Weinschenk RC, Patten C, Font-Llagunes JM, Lewis VO, Fregly BJ. Computational Evaluation of Psoas Muscle Influence on Walking Function Following Internal Hemipelvectomy with Reconstruction, Fron Bioeng Biotech, Biomechanics, 2022 Sep 28;10:855870. doi:10.3389/fbioe.2022.855870. PMID: 36246391. PMCID: PMC9559731 Tags Department of Neurobiology, Physiology and Behavior Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Gregg H. Recanzone Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Gregg H. Recanzone Breadcrumb Home Faculty Gregg H. Recanzone Position Title Professor Neurobiology, Physiology and Behavior 530-752-6778 (executive assistant) ghrecanzone@ucdavis.edu Lab Website Google Scholar 211 Green Hall Bio Research Interests Our research involves investigating the role of the cerebral cortex in the perception of auditory signals, with a current emphasis on the effects of aging. Age-related hearing deficits affect the majority of American retirees, and virtually all Americans over the age of 75. These deficits go beyond a simple loss of hearing, but also result in a poor ability to tell where different sounds are coming from, and in understanding speech. Our research investigates how natural aging affects the cerebral cortex, the neural structure that is necessary for one to perceive, and appreciate, different sound qualities. Our ultimate objective is to better understand cortical processing mechanisms in young and aged brains in order to develop effective remedial therapies to circumvent age-related hearing loss. Center Affiliations Center for Neuroscience Graduate Program Affiliations Neuroscience Graduate Group Education and Degree(s) 1984 B.S. in Biology and Psychology, University of California, San Diego 1990 Ph.D. in Neuroscience, University of California, San Francisco Publications Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Gregg H. Recanzone Dan Starr Named New CBS Associate Dean of Research September 29, 2023 Discovering Curiosity: Exploring Age-Related Hearing Loss with Gregg Recanzone June 06, 2018 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Karen Ryan Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Karen Ryan Breadcrumb Home Faculty Karen Ryan Position Title Professor Neurobiology, Physiology and Behavior 530-752-0642 kkryan@ucdavis.edu Lab website Google Scholar 1129 Green Hall Bio Research Interests We study the neuroendocrine mechanisms by which environmental signals influence systemic metabolism, with the goal to identify new targets for therapeutic intervention in stress-related and metabolic disease. Research interests include neuroendocrine regulation of feeding behavior, body weight and glucose control; mechanisms linking psychological stress and metabolic disease. Graduate Program Affiliations Molecular, Cellular, and Integrative Physiology Graduate Group Neuroscience Graduate Group Education and Degree(s) 1994 A.B. in Biology, Washington University, St. Louis 2000 Ph.D. in Evolutionary Biology, University of Chicago Publications Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Karen Ryan Engineering a Balanced Diet? Hormone FGF21 Promotes Protein Preference May 13, 2019 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Lucas R. Smith | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Lucas R. Smith Breadcrumb Home Faculty Lucas R. Smith Position Title Assistant Professor Neurobiology, Physiology and Behavior 530-752-2930 lucsmith@ucdavis.edu Google Scholar 189 Briggs Hall Bio Research Interests Our research is focused on understanding the mechanisms by which skeletal muscle adapts, with an emphasis on the fibrotic process that is associated with many muscle pathologies including muscular dystrophies.  We seek to uncover the relationship between the structure of the extracellular matrix and both the mechanical function of muscle and the regenerative capacity of muscle stem cells. These studies will guide novel therapies for fibrotic muscle diseases. Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Biomedical Engineering Graduate Group Molecular, Cellular and Integrative Physiology Graduate Group Education and Degree(s) B.S. in Bioengineering, University of Washington Ph.D. in Bioengineering, University of California, San Diego Publications Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Lucas R. Smith Breaking the Loop Leading to Muscular Fibrosis December 06, 2022 Award Supports Cutting-Edge Biomedical Research to Benefit Children with Cerebral Palsy April 07, 2020 Discovering Curiosity: Fighting Neuromuscular Disorders with New Faculty Lucas Smith April 05, 2019 College of Biological Sciences Welcomes Eight New Faculty for 2018-2019 Year October 17, 2018 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Mitchell Sutter Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Mitchell Sutter Breadcrumb Home Faculty Mitchell Sutter Position Title Professor Neurobiology, Physiology and Behavior 530-754-5078 mlsutter@ucdavis.edu Center for Neuroscience, 1544 Newton Court, Davis, CA 95618 Bio Research Interests My lab investigates how the brain analyzes sounds, how attention influences this process, and how it leads to decisions and actions. We employ a multidisciplinary approach that includes recording the electrical activity of single neurons, behavioral studies, psychology, and quantitative methods. Our research addresses how we distinguish sounds, such as an alarm clock from a barking dog, or an ambulance siren from a car horn, and how we can understand speech in noisy environments like crowded parties. We focus on the role of higher auditory areas in the midbrain, thalamus, and cortex in sound perception and sound-guided behavior. Our recent findings show that these areas, thought to be purely auditory, are also influenced by attention and decision-making, suggesting they play a role in guiding behavior as well as sensing sounds. Center Affiliations Center for Neuroscience Graduate Program Affiliations Neuroscience Graduate Group Education and Degree(s) 1985 B.S. in Bioengineering, Brown University 1991 Ph.D. in Bioengineering, University of California, San Francisco/Berkeley Publications Downer, J.D., Niwa, M. and Sutter, M.L. (2017) Hierarchical differences in population coding within auditory cortex. J Neurophysiol 118, p. 717-731. Downer, J.D., Rapone, B., Verhein, J., O'Connor, KN, and Sutter, M.L.   (2017). Feature-Selective Attention Adaptively Shifts Noise Correlations in Primary Auditory Cortex Journal of Neuroscience 37(21): p. 5378-92. Downer, JD, Niwa, M., Sutter, M.L. Task Engagement Selectively Modulates Neural Correlations in Primary Auditory Cortex. Journal of Neuroscience 35: 7565-7574, 2015. Johnson, J.S., O'Connor, K.N., and Sutter, M.L. Segregating two simultaneous sounds in elevation using temporal envelope: Human psychophysics and a physiological model. J. Acoust. Soc. Am. 138: 33-43. 2015. Niwa, M., O'Connor, K.N., Engall, E., Johnson, J.S., and Sutter, M.L. Hierarchical effects of task engagement on amplitude modulation encoding in auditory cortex.  Journal of Neurophysiology 111: 307-327, 2015. Tags Academic Departments Department of Neurobiology, Physiology and Behavior Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Brie Tripp | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Brie Tripp Breadcrumb Home Faculty Brie Tripp Position Title Assistant Professor of Teaching Neurobiology, Physiology and Behavior 530-754-2729 btripp@ucdavis.edu Lab website Google Scholar ORCID (0000-0003-0491-3491) 177 Briggs Hall Bio Research Interests Our lab studies how to promote social and racial justice in undergraduate science classrooms. We perform mixed methods education and psychology research by centering students' voices from underserved communities in science and developing justice-centered curricula in physiology and neurobiology education. Publications Tags Department of Neurobiology, Physiology and Behavior Content by Brie Tripp Brie Tripp Named 2024 Chancellor’s Fellow for Diversity, Equity and Inclusion July 30, 2024 CBS Welcomes Three New Faculty Members for 2021-2022 Year December 07, 2021 Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 17, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - W. Martin Usrey Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team W. Martin Usrey Breadcrumb Home Faculty W. Martin Usrey Position Title Professor and Department Chair Barbara A. Horwitz and John M. Horowitz Endowed Chair in Physiology Neurobiology, Physiology and Behavior Neurology wmusrey@ucdavis.edu Lab website Google Scholar 1544 Newton Court, Davis, CA 95618 Bio Research Interests Our research is funded by the N.I.H and the NSF. The long-term goal of the Usrey laboratory is to understand the functional properties of neural circuits that serve vision and the relationship between cell physiology, circuit activity, behavior and perception. Current research projects are focused on determining (1) how sensory information is processed and transmitted within and between brain areas, (2) the cellular and circuit mechanisms that mediate the effects of spatial attention on visual processing, (3) the role of feedback pathways for vision, and (4) the relationship between neural activity and visual perception. Using an arsenal of techniques, we are discovering how sensory information is established and encoded in brain activity, as well as the mechanisms employed by the brain for communicating information dynamically from one level to the next. The Usrey laboratory is also home to Brainmaps.org, an interactive, high-resolution digital brain atlas and virtual microscope for students, educators, and researchers. Center Affiliations Center for Neuroscience Graduate Program Affiliations Neuroscience Graduate Group Psychology Graduate Group Education and Degree(s) 1987 B.A. in Animal Physiology, Anthropology University of California, San Diego 1989 M.S. in Physiology, San Diego State University 1994 Ph.D. in Neurobiology, Duke University Publications Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by W. Martin Usrey $15 Million Grant Will Support Study on the Role of the Thalamus in Cognitive Control and Schizophrenia December 07, 2023 Evolutionary Thinking August 10, 2021 Developing Next-Gen Neuroscientists: EEOP Receives $1.2 Million to Advance Diversity in Research September 24, 2019 Stacey Combes Recognized as a 2019 Chancellor's Fellow January 29, 2019 Exploring Vision, Perception and Behavior: W. Martin Usrey Named Barbara A. Horwitz and John M. Horowitz Endowed Chair in Physiology November 27, 2018 Pagination Page 1 Next page Next Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: September 17, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "Talitha van der Meulen | College of Biological Sciences Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Talitha van der Meulen Breadcrumb Home Faculty Talitha van der Meulen Position Title Assistant Professor of Teaching Neurobiology, Physiology and Behavior she/her/hers (530) 754-1928 tvandermeulen@ucdavis.edu Google Scholar ORCID (0000-0002-2150-9258) 190 Briggs Hall Bio Research Interests Dr. Van der Meulen's background in physiology research in Diabetes serves her well in her current position as assistant professor of teaching in the NPB department. Within her classrooms, Dr. Van der Meulen is interested in how students learn and how to pass insights from her research on student learning on to other students. Education and Degree(s) 2000 M.Sc. in Biology, Wageningen University, The Netherlands 2005 Ph.D. in Developmental muscle biology and biomechanics, Wageningen University, The Netherlands 2006-2008 Postdoc in biochemistry, San Diego State University 2008-2014 Postdoc in Peptide Biology and Diabetes, Salk Institute, La Jolla Publications Tags Department of Neurobiology, Physiology and Behavior Talitha van der Meulen (0000-0002-2150-9258) ORCID record for Talitha van der Meulen. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Karen Zito Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Karen Zito Breadcrumb Home Faculty Karen Zito Position Title Professor Neurobiology, Physiology and Behavior she/her 530-752-7832 kzito@ucdavis.edu Lab website Center for Neuroscience profile ORCID (0000-0002-0799-0460) Center for Neuroscience, 1544 Newton Court, Davis, CA 95618 Bio Research Interests The goal of our research is to understand at the cellular and molecular level how synaptic connections form during development, how they are modified during learning and altered in disease. Most of the excitatory synaptic connections in the cortex occur on dendritic spines, tiny protrusions that extend from the dendritic membrane. Dendritic spines are highly dynamic during development both in vitro and in vivo; periods of high motility coincide with synapse formation. Spine motility, driven by actin dynamics, is thought to allow the postsynaptic neuron to explore and sample presynaptic partners. In addition, alterations of spine dynamics and stability have been observed during learning, leading to the hypothesis that these anatomical changes underlie the adaptive remodeling of cortical circuits. The identification and characterization of the molecules and mechanisms that control spine morphogenesis will be a crucial step toward understanding the formation and plasticity of cortical circuits. Our approach to this problem combines time-lapse imaging to observe nascent spine formation, and fluorescence recovery after photobleaching (FRAP) to measure protein dynamics, with molecular manipulations of synaptic proteins to decipher their roles in the growth of dendritic spines and synapses. In addition, we use electrophysiological measurements in combination with two-photon uncaging of glutamate to examine the function of nascent synapses at the single synapse level. Center Affiliations Center for Neuroscience Graduate Program Affiliations Biochemistry, Molecular, Cellular and Developmental Biology Graduate Group Neuroscience Graduate Group Molecular, Cellular and Integrative Physiology Graduate Group Education and Degree(s) B.S., Indiana University Ph.D., University of California, Berkeley Publications Stein IS, Park DK, Claiborne N, Zito K. (2021) Non-ionotropic NMDA receptor signaling gates bidirectional structural plasticity of dendritic spines. Cell Rep. 34(4):108664. Stein IS, Park DK, Flores JC, Jahncke JN, Zito K. (2020) Molecular Mechanisms of Non-ionotropic NMDA Receptor Signaling. J Neurosci. 40:3741-3750. Stein IS, Zito K. (2019) Dendritic Spine Elimination: Molecular Mechanisms and Implications. Neuroscientist. 25:27-47 Lambert JT, Hill TC, Park DK, Culp JH, Zito K. (2017) Protracted and asynchronous accumulation of PSD95-family MAGUKs during maturation of nascent dendritic spines. Dev Neurobiol. 77:1161-1174. Hamilton AM, Lambert JT, Parajuli LK, Vivas O, Park DK, Stein IS, Jahncke JN, Greenberg ME, Margolis SS, Zito K. (2017) A dual role for the RhoGEF Ephexin5 in regulation of dendritic spine outgrowth. Mol Cell Neurosci. 80:66-74. Tags Academic Departments Department of Neurobiology, Physiology and Behavior Content by Karen Zito 9 Elected as AAAS Fellows, 2 from CBS January 27, 2022 NIH Grant Supports Collaborative UC Effort to Visualize Brain Learning December 05, 2017 Zito Named 2015-16 Chancellor's Fellow January 05, 2016 Karen Zito (0000-0002-0799-0460) ORCID record for Karen Zito. ORCID provides an identifier for individuals to use with their name as they engage in research, scholarship, and innovation activities. Visit ORCID Profile Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Marilyn Ramenofsky Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Marilyn Ramenofsky Breadcrumb Home Faculty Marilyn Ramenofsky Position Title Adjunct Professor Neurobiology, Physiology and Behavior 530 400 8945 mramenofs@ucdavis.edu Google Scholar 104 Animal Communications Lab Bio Research Interests I am fascinated by the interplay of environmental signals and the physiological and behavioral expressions of organisms and primarily those of migratory birds. As migration is the movement to and away from areas where species breed, each trip is composed of multiple steps or substages that involve regulation of the neuroendocrine, endocrine, metabolic, and behavioral systems. During these trips, organisms are exposed to a wide range environmental conditions that include photoperiod, atmospheric and climatic, food availability, predation and unpredictable pertubations. Thus, in order for migrants to be successful they rely on environmental information to cue progression of each substage. Migrants therefore can serve as an effective model for studying how organisms rely on environmental conditions and respond to environmental changes and in particular global climate fluctuations. Former studies have focused on the effects of photoperiod, lunar condition, food availability and stressors on migratory specific characteristics that include migratory behavior (migratory restlessness, feeding, locomotor activity) and measures of the endocrine and metabolic systems. My other studies include vocal communication of nocturnal migrants, role of experience and geomagnetic field on orientation during migration, endogenous rhythms and migratory behavior, effects of prolonged migratory restlessness on the endocrine and metabolic systems. Most recently my laboratory has used the migrant/resident model present in the Pacific White-crowned Sparrows subspecies (Zonotrichia leucophrys) to compare the physiological and behavioral traits attributed to the migratory life history and assess whether these features are present in residents and may be considered more in seasonal terms rather then strictly migratory. Graduate Program Affiliations Animal Behavior Graduate Group Animal Biology Graduate Group Education and Degree(s) 1969 B.A. in Botany-Biology, Pomona College 1972 M.Sc. in Zoology, University of Texas, Austin 1982 Ph.D. in Zoology, University of Washington, Seattle Publications Tags Academic Departments Department of Neurobiology, Physiology and Behavior Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 28, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm .",
    "College of Biological Sciences - Grace Rosenquist Skip to main content Menu College of Biological Sciences Open Search Search Quick Links + UC Davis Main navigation (extended config) About College Overview Rankings and Distinctions Memberships and Awards Mission and Vision History Virtual Tour Leadership Office of the Dean Faculty Executive Committee Faculty Standing Committees Committee for DEIJ Philanthropy Leadership Council Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Directory Dean's Office Staff Department Chairs and Managers Center Directors and Managers Graduate Group Chairs and Coordinators Diversity, Equity and Inclusion Faculty and Staff Resources Academic Personnel Brand Toolkit Business and Administrative Instructional Resources Software, IT and Websites Undergraduate Advising Biology Academic Success Center Health Professions Advising New and Transfer Student Programs BioLaunch Mentorship and Career Readiness AvenueB Transfer Student Program Majors and Minors Student Diversity Programs Experiential Learning Honors and Awards College Awards and Scholarships Annual Award and Citation Ceremony Dean's Honor List Clubs and Organizations Graduate Academic Programs and Degrees Graduate Groups Designated Emphases Graduate Academic Certificates Funding and Support Training Grants Teaching Assistantships Application Fee Fellowship Awards and Fellowships New and Prospective Graduate Students Application and Degree Requirements Graduate Advising Faculty Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Research Departments Evolution and Ecology Microbiology and Molecular Genetics Molecular and Cellular Biology Neurobiology, Physiology and Behavior Plant Biology Centers Center for Neuroscience Center for Population Biology Genome Center Facilities Research Features Model Organisms News & Events Events Annual Award and Citation Ceremony 2023 Storer Lectureship in the Life Sciences Joint Seminars in Molecular Biology News Articles Biome Newsletter Give Make a Gift College Priority Areas Information About Giving Our Giving Team Grace Rosenquist Breadcrumb Home Faculty Grace Rosenquist Position Title Assistant Adjunct Professor Neurobiology, Physiology and Behavior 530-752-4973 glrosen@ucdavis.edu 179 Briggs Hall Tags Academic Departments Department of Neurobiology, Physiology and Behavior Need an update to your faculty profile? CBS faculty who need changes made to their directory profile should email: cbswebedits@ucdavis.edu . Contact Directory & Visitor Information Undergraduate Inquiries: cbsundergrads@ucdavis.edu Graduate Inquiries: cbsgrads@ucdavis.edu Advising Undergraduates Biology Academic Success Center Health Professions Advising Graduate Students Program Coordinators Support Make a gift to the UC Davis College of Biological Sciences. Give Social Media Facebook Instagram LinkedIn YouTube Newsletter Biome College of Biological Sciences 202 Green Hall 605 Hutchison Drive, Davis, CA 95616 University of California, Davis , One Shields Avenue, Davis, CA 95616 | 530-752-1011 Questions or comments? Privacy & Accessibility Principles of Community University of California Sitemap Last update: August 2, 2024 Copyright © The Regents of the University of California, Davis campus. All rights reserved. This site is officially grown in SiteFarm ."
]